RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/**
 **************************************************************************
 * File Name    : at32f4xx.h
 * Description  : at32f4xx peripheral access layer header file
 * Date         : 2018-02-26
 * Version      : V1.0.4
 **************************************************************************
 */


/** @addtogroup CMSIS
  * @{
  */

/** @addtogroup at32f4xx
  * @{
  */

#ifndef __AT32F4xx_H
#define __AT32F4xx_H

#ifdef __cplusplus
extern "C" {
#endif

/** @addtogroup Library_configuration_section
  * @{
  */

/* Uncomment the line below according to the target AT32 device used in your
   application
  */
#if !defined (AT32F403Cx_MD) && !defined (AT32F403Cx_HD) && \
    !defined (AT32F403Cx_XL) && !defined (AT32F403Rx_HD) && \
    !defined (AT32F403Rx_XL) && !defined (AT32F403Vx_HD) && \
    !defined (AT32F403Vx_XL) && !defined (AT32F403Zx_HD) && \
    !defined (AT32F403Zx_XL) && \
    !defined (AT32F413Kx_MD) && !defined (AT32F413Kx_HD) && \
    !defined (AT32F413Cx_MD) && !defined (AT32F413Cx_HD) && \
    !defined (AT32F413Rx_MD) && !defined (AT32F413Rx_HD) && \
    !defined (AT32FEBKCx_MD) && !defined (TS32F401CBU7)  && \
    !defined (AT32F415C8T7)  && !defined (AT32F415CBT7)  && !defined (AT32F415CCT7)  && \
    !defined (AT32F415CBU7)  && !defined (AT32F415CCU7)  && !defined (AT32F415R8T7)  && \
    !defined (AT32F415RBT7)  && !defined (AT32F415RCT7)  && !defined (AT32F415K8U7_4)&& \
    !defined (AT32F415KBU7_4)&& !defined (AT32F415KCU7_4)&& !defined (AT32F415R8T7_7)&& \
    !defined (AT32F415RBT7_7)&& !defined (AT32F415RCT7_7)&& \
    !defined (AT32F407RGT7)  && !defined (AT32F407VGT7)  && !defined (AT32F407RCT7)  && \
    !defined (AT32F407VCT7)  && \
    !defined (AT32F403AVCT7) && !defined (AT32F403ARCT7) && !defined (AT32F403ACCT7) && \
    !defined (AT32F403ACCU7) && !defined (AT32F403AVGT7) && !defined (AT32F403ACGT7) && \
    !defined (AT32F403ARGT7) && !defined (AT32F403ACGU7) && !defined (AT32F403AVET7) && \
    !defined (AT32F403ARET7) && !defined (AT32F403ACEU7) && !defined (AT32F403ACET7)
/* #define AT32F403Cx_MD */   /*!< AT32F403Cx_MD: LQFP48, Medium density devices: AT32F403CB */
/* #define AT32F403Cx_HD */   /*!< AT32F403Cx_HD: LQFP48, High density devices: AT32F403CC, AT32F403CE */
/* #define AT32F403Cx_XL */   /*!< AT32F403Cx_XL: LQFP48, XL-density devices: AT32F403CG */
/* #define AT32F403Rx_HD */   /*!< AT32F403Rx_HD: LQFP64, High density devices: AT32F403RC, AT32F403RE */
/* #define AT32F403Rx_XL */   /*!< AT32F403Rx_XL: LQFP64, XL-density devices: AT32F403RG */
/* #define AT32F403Vx_HD */   /*!< AT32F403Vx_HD: LQFP100, High density devices: AT32F403VC, AT32F403VE */
/* #define AT32F403Vx_XL */   /*!< AT32F403Vx_XL: LQFP100, XL-density devices: AT32F403VG */
/* #define AT32F403Zx_HD */   /*!< AT32F403Zx_HD: LQFP144, High density devices: AT32F403ZC, AT32F403ZE */
/* #define AT32F403Zx_XL */   /*!< AT32F403Zx_XL: LQFP144, XL-density devices: AT32F403ZG */

/* #define AT32F413Kx_MD */   /*!< AT32F413Kx_MD: LQFP32, Medium density devices: AT32F413KB */
/* #define AT32F413Kx_HD */   /*!< AT32F413Kx_HD: LQFP32, High density devices: AT32F413KC */
/* #define AT32F413Cx_MD */   /*!< AT32F413Cx_MD: LQFP48, Medium density devices: AT32F413C8, AT32F413CB */
/* #define AT32F413Cx_HD */   /*!< AT32F413Cx_HD: LQFP48, High density devices: AT32F413CC */
/* #define AT32F413Rx_MD */   /*!< AT32F413Rx_MD: LQFP64, Medium density devices: AT32F413RB */
/* #define AT32F413Rx_HD */   /*!< AT32F413Rx_HD: LQFP64, High density devices: AT32F413RC */
/* #define AT32FEBKCx_MD */   /*!< AT32FEBKCx_MD: LQFP48, Medium density devices: AT32FEBKC8*/
/* #define TS32F401CBU7 */    /*!< TS32F401CBU7: QFN48, Medium density devices: TS32F401CBU7 */

/* #define AT32F415C8T7 */    /*!< AT32F415C8T7: LQFP48, Medium density devices: AT32F415C8T7 */
/* #define AT32F415CBT7 */    /*!< AT32F415CBT7: LQFP48, Medium density devices: AT32F415CBT7 */
/* #define AT32F415CCT7 */    /*!< AT32F415CCT7: LQFP48, High density devices: AT32F415CCT7 */
/* #define AT32F415CBU7 */    /*!< AT32F415CBU7: QFN48, Medium density devices: AT32F415CBU7 */
/* #define AT32F415CCU7 */    /*!< AT32F415CCU7: QFN48, High density devices: AT32F415CCU7 */
/* #define AT32F415R8T7 */    /*!< AT32F415R8T7: LQFP64, Medium density devices: AT32F415R8T7 */
/* #define AT32F415RBT7 */    /*!< AT32F415RBT7: LQFP64, Medium density devices: AT32F415RBT7 */
/* #define AT32F415RCT7 */    /*!< AT32F415RCT7: LQFP64, High density devices: AT32F415RCT7 */
/* #define AT32F415K8U7_4 */  /*!< AT32F415K8U7_4: QFN32, Medium density devices: AT32F415K8U7_4 */
/* #define AT32F415KBU7_4 */  /*!< AT32F415KBU7_4: QFN32, Medium density devices: AT32F415KBU7_4 */
/* #define AT32F415KCU7_4 */  /*!< AT32F415KCU7_4: QFN32, High density devices: AT32F415KCU7_4 */
/* #define AT32F415R8T7_7 */  /*!< AT32F415R8T7_7: LQFP64, Medium density devices: AT32F415R8T7_7 */
/* #define AT32F415RBT7_7 */  /*!< AT32F415RBT7_7: LQFP64, Medium density devices: AT32F415RBT7_7 */
/* #define AT32F415RCT7_7 */  /*!< AT32F415RCT7_7: LQFP64, High density devices: AT32F415RCT7_7 */

/* #define AT32F407RGT7 */    /*!< AT32F407RGT7: LQFP64, XL-density devices: AT32F407RGT7 */
/* #define AT32F407VGT7 */    /*!< AT32F407VGT7: LQFP100, XL-density devices: AT32F407VGT7 */
/* #define AT32F407RET7 */    /*!< AT32F407RET7: LQFP64, XL-density devices: AT32F407RET7 */
/* #define AT32F407VET7 */    /*!< AT32F407VET7: LQFP100, XL-density devices: AT32F407VET7 */
/* #define AT32F407RCT7 */    /*!< AT32F407RCT7: LQFP64, High density devices: AT32F407RCT7 */
/* #define AT32F407VCT7 */    /*!< AT32F407VCT7: LQFP100, High density devices: AT32F407VCT7 */

/* #define AT32F403AVCT7 */   /*!< AT32F403AVCT7: LQFP100, High density devices: AT32F403AVCT7 */
/* #define AT32F403ARCT7 */   /*!< AT32F403ARCT7: LQFP64, High density devices: AT32F403ARCT7 */
/* #define AT32F403ACCT7 */   /*!< AT32F403ACCT7: LQFP48, High density devices: AT32F403ACCT7 */
/* #define AT32F403ACCU7 */   /*!< AT32F403ACCU7: QFN48, High density devices: AT32F403ACCU7 */
/* #define AT32F403AVET7 */   /*!< AT32F403AVET7: LQFP100, XL-density devices: AT32F403AVET7 */
/* #define AT32F403ARET7 */   /*!< AT32F403ARET7: LQFP64, XL-density devices: AT32F403ARET7 */
/* #define AT32F403ACET7 */   /*!< AT32F403ACET7: LQFP48, XL-density devices: AT32F403ACET7 */
/* #define AT32F403ACEU7 */   /*!< AT32F403ACEU7: QFN48, XL-density devices: AT32F403ACEU7 */
/* #define AT32F403AVGT7 */   /*!< AT32F403AVGT7: LQFP100, XL-density devices: AT32F403AVGT7 */
/* #define AT32F403ACGT7 */   /*!< AT32F403ACGT7: LQFP48, XL-density devices: AT32F403ACGT7 */
/* #define AT32F403ARGT7 */   /*!< AT32F403ARGT7: LQFP64, XL-density devices: AT32F403ARGT7 */
/* #define AT32F403ACGU7 */   /*!< AT32F403ACGU7: QFN48, XL-density devices: AT32F403ACGU7 */

#endif
/*  Tip: To avoid modifying this file each time you need to switch between these
        devices, you can define the device in your toolchain compiler preprocessor.

 - Medium-density devices are at32f4xx microcontrollers where
   the Flash memory density ranges between 64 and 128 Kbytes.
 - High-density devices are at32f4xx microcontrollers where
   the Flash memory density ranges between 256 and 512 Kbytes.
 - XL-density devices are at32f4xx microcontrollers where
   the Flash memory density ranges between 512 and 1024 Kbytes.
  */

