RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/** @addtogroup Exported_types
  * @{
  */

typedef int32_t  INT32;
typedef int16_t  INT16;
typedef int8_t   INT8;
typedef uint32_t UINT32;
typedef uint16_t UINT16;
typedef uint8_t  UINT8;

/** at32f4xx Standard Peripheral Library old types (maintained for legacy purpose) */
typedef int32_t  s32;
typedef int16_t  s16;
typedef int8_t   s8;

typedef const int32_t sc32;  /*!< Read Only */
typedef const int16_t sc16;  /*!< Read Only */
typedef const int8_t  sc8;   /*!< Read Only */

typedef __IO int32_t  vs32;
typedef __IO int16_t  vs16;
typedef __IO int8_t   vs8;

typedef __I int32_t vsc32;  /*!< Read Only */
typedef __I int16_t vsc16;  /*!< Read Only */
typedef __I int8_t  vsc8;   /*!< Read Only */

typedef uint32_t u32;
typedef uint16_t u16;
typedef uint8_t  u8;

typedef const uint32_t uc32;  /*!< Read Only */
typedef const uint16_t uc16;  /*!< Read Only */
typedef const uint8_t  uc8;   /*!< Read Only */

typedef __IO uint32_t vu32;
typedef __IO uint16_t vu16;
typedef __IO uint8_t  vu8;

typedef __I uint32_t vuc32;  /*!< Read Only */
typedef __I uint16_t vuc16;  /*!< Read Only */
typedef __I uint8_t  vuc8;   /*!< Read Only */

typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus;

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;

/** at32f4xx Standard Peripheral Library old definitions (maintained for legacy purpose) */
#define HSEStartUp_TimeOut   HSE_STARTUP_TIMEOUT
#define HSE_Value            HSE_VALUE
#define HSI_Value            HSI_VALUE
/**
  * @}
  */

/** @addtogroup Peripheral_registers_structures
  * @{
  */

/**
  * @brief HSI Auto Clock Calibration
  */
typedef struct
{
  __IO uint32_t STS;
  __IO uint32_t CTRL1;
  __IO uint32_t CTRL2;
  __IO uint32_t C1;
  __IO uint32_t C2;
  __IO uint32_t C3;
} ACC_Type;

/**
  * @brief Analog to Digital Converter
  */
typedef struct
{
    __IO uint32_t STS;
    __IO uint32_t CTRL1;
    __IO uint32_t CTRL2;
    __IO uint32_t SMPT1;
    __IO uint32_t SMPT2;
    __IO uint32_t JOFS1;
    __IO uint32_t JOFS2;
    __IO uint32_t JOFS3;
    __IO uint32_t JOFS4;
    __IO uint32_t WHTR;
    __IO uint32_t WLTR;
    __IO uint32_t RSQ1;
    __IO uint32_t RSQ2;
    __IO uint32_t RSQ3;
    __IO uint32_t JSQ;
    __IO uint32_t JDOR1;
    __IO uint32_t JDOR2;
    __IO uint32_t JDOR3;
    __IO uint32_t JDOR4;
    __IO uint32_t RDOR;
} ADC_Type;

/**
  * @brief Backup Registers
  */
#if !defined (AT32F415xx)
typedef struct
{
    uint32_t  RESERVED0;
    __IO uint16_t DT1;
    uint16_t  RESERVED1;
    __IO uint16_t DT2;
    uint16_t  RESERVED2;
    __IO uint16_t DT3;
    uint16_t  RESERVED3;
    __IO uint16_t DT4;
    uint16_t  RESERVED4;
    __IO uint16_t DT5;
    uint16_t  RESERVED5;
    __IO uint16_t DT6;
    uint16_t  RESERVED6;
    __IO uint16_t DT7;
    uint16_t  RESERVED7;
    __IO uint16_t DT8;
    uint16_t  RESERVED8;
    __IO uint16_t DT9;
    uint16_t  RESERVED9;
    __IO uint16_t DT10;
    uint16_t  RESERVED10;
    __IO uint16_t RTCCAL;
    uint16_t  RESERVED11;
    __IO uint16_t CTRL;
    uint16_t  RESERVED12;
    __IO uint16_t CTRLSTS;
    uint16_t  RESERVED13[5];
    __IO uint16_t DT11;
    uint16_t  RESERVED14;
    __IO uint16_t DT12;
    uint16_t  RESERVED15;
    __IO uint16_t DT13;
    uint16_t  RESERVED16;
    __IO uint16_t DT14;
    uint16_t  RESERVED17;
    __IO uint16_t DT15;
    uint16_t  RESERVED18;
    __IO uint16_t DT16;
    uint16_t  RESERVED19;
    __IO uint16_t DT17;
    uint16_t  RESERVED20;
    __IO uint16_t DT18;
    uint16_t  RESERVED21;
    __IO uint16_t DT19;
    uint16_t  RESERVED22;
    __IO uint16_t DT20;
    uint16_t  RESERVED23;
    __IO uint16_t DT21;
    uint16_t  RESERVED24;
    __IO uint16_t DT22;
    uint16_t  RESERVED25;
    __IO uint16_t DT23;
    uint16_t  RESERVED26;
    __IO uint16_t DT24;
    uint16_t  RESERVED27;
    __IO uint16_t DT25;
    uint16_t  RESERVED28;
    __IO uint16_t DT26;
    uint16_t  RESERVED29;
    __IO uint16_t DT27;
    uint16_t  RESERVED30;
    __IO uint16_t DT28;
    uint16_t  RESERVED31;
    __IO uint16_t DT29;
    uint16_t  RESERVED32;
    __IO uint16_t DT30;
    uint16_t  RESERVED33;
    __IO uint16_t DT31;
    uint16_t  RESERVED34;
    __IO uint16_t DT32;
    uint16_t  RESERVED35;
    __IO uint16_t DT33;
    uint16_t  RESERVED36;
    __IO uint16_t DT34;
    uint16_t  RESERVED37;
    __IO uint16_t DT35;
    uint16_t  RESERVED38;
    __IO uint16_t DT36;
    uint16_t  RESERVED39;
    __IO uint16_t DT37;
    uint16_t  RESERVED40;
    __IO uint16_t DT38;
    uint16_t  RESERVED41;
    __IO uint16_t DT39;
    uint16_t  RESERVED42;
    __IO uint16_t DT40;
    uint16_t  RESERVED43;
    __IO uint16_t DT41;
    uint16_t  RESERVED44;
    __IO uint16_t DT42;
    uint16_t  RESERVED45;
} BKP_Type;
#endif

/**
  * @brief Controller Area Network TxMailBox
  */
typedef struct
{
    __IO uint32_t TMI;
    __IO uint32_t TDT;
    __IO uint32_t TDL;
    __IO uint32_t TDH;
} CAN_TxMailBox_Type;

/**
  * @brief Controller Area Network FIFOMailBox
  */
typedef struct
{
    __IO uint32_t RFI;
    __IO uint32_t RDT;
    __IO uint32_t RDL;
    __IO uint32_t RDH;
} CAN_FIFOMailBox_Type;

/**
  * @brief Controller Area Network FilterRegister
  */
typedef struct
{
    __IO uint32_t FBR1;
    __IO uint32_t FBR2;
} CAN_FilterRegister_Type;

/**
  * @brief Controller Area Network
  */
typedef struct
{
    __IO uint32_t MCTRL;
    __IO uint32_t MSTS;
    __IO uint32_t TSTS;
    __IO uint32_t RF0;
    __IO uint32_t RF1;
    __IO uint32_t INTEN;
    __IO uint32_t ESTS;
    __IO uint32_t BTMG;
    uint32_t  RESERVED0[88];
    CAN_TxMailBox_Type TxMailBox[3];
    CAN_FIFOMailBox_Type FIFOMailBox[2];
    uint32_t  RESERVED1[12];
    __IO uint32_t FM;
    __IO uint32_t FM1;
    uint32_t  RESERVED2;
    __IO uint32_t FS1;
    uint32_t  RESERVED3;
    __IO uint32_t FFA1;
    uint32_t  RESERVED4;
    __IO uint32_t FA1;
    uint32_t  RESERVED5[8];
    CAN_FilterRegister_Type FilterRegister[14];
} CAN_Type;

/**
  * @brief Comparator
  */
typedef struct
{
  __IO uint32_t CTRLSTS1;     /*!< COMP comparator control and status register, Address offset: 0x1C */
  __IO uint32_t CTRLSTS2;
  __IO uint32_t G_FILTER_EN;
  __IO uint32_t HIGH_PULSE;
  __IO uint32_t LOW_PULSE;
} COMP_Type;

/**
  * @brief CRC calculation unit
  */
typedef struct
{
    __IO uint32_t DT;
    __IO uint8_t  IDT;
    uint8_t   RESERVED0;
    uint16_t  RESERVED1;
    __IO uint32_t CTRL;
} CRC_Type;

/**
  * @brief Digital to Analog Converter
  */
typedef struct
{
    __IO uint32_t CTRL;
    __IO uint32_t SWTRG;
    __IO uint32_t HDR12R1;
    __IO uint32_t HDR12L1;
    __IO uint32_t HDR8R1;
    __IO uint32_t HDR12R2;
    __IO uint32_t HDR12L2;
    __IO uint32_t HDR8R2;
    __IO uint32_t HDR12RD;
    __IO uint32_t HDR12LD;
    __IO uint32_t HDR8RD;
    __IO uint32_t ODT1;
    __IO uint32_t ODT2;
} DAC_Type;

/**
  * @brief MCU Debug
  */
typedef struct
{
    __IO uint32_t IDCR;
    __IO uint32_t CTRL;
} MCUDBG_Type;

/**
  * @brief DMA Controller
  */
typedef struct
{
    __IO uint32_t CHCTRL;
    __IO uint32_t TCNT;
    __IO uint32_t CPBA;
    __IO uint32_t CMBA;
} DMA_Channel_Type;

typedef struct
{
    __IO uint32_t ISTS;
    __IO uint32_t ICLR;
    uint32_t  RESERVED[38];
    __IO uint32_t DMA_SRC_SEL0;
    __IO uint32_t DMA_SRC_SEL1;
} DMA_Type;

/**
  * @brief External Interrupt/Event Controller
  */
typedef struct
{
    __IO uint32_t INTEN;
    __IO uint32_t EVTEN;
    __IO uint32_t RTRSEL;
    __IO uint32_t FTRSEL;
    __IO uint32_t SWIE;
    __IO uint32_t PND;
} EXTI_Type;

/**
  * @brief FLASH Registers
  */
typedef struct
{
    __IO uint32_t ACR;
    __IO uint32_t FCKEY;
    __IO uint32_t OPTKEYR;
    __IO uint32_t STS;
    __IO uint32_t CTRL;
    __IO uint32_t ADDR;
    uint32_t RESERVED0;
    __IO uint32_t UOB;
    __IO uint32_t WRPRT;
    uint32_t RESERVED1[8];
    __IO uint32_t FCKEY2;
    uint32_t RESERVED2;
    __IO uint32_t STS2;
    __IO uint32_t CTRL2;
    __IO uint32_t ADDR2;
    uint32_t RESERVED3[7];
#if defined (AT32F415xx)
    __IO uint32_t SLIB_CDR0;
    __IO uint32_t SLIB_CDR1;
    __IO uint32_t SLIB_PSW;
    __IO uint32_t SLIB_PSW_STS;
    __IO uint32_t CRC_AR;
    __IO uint32_t CRC_CR;
    __IO uint32_t CRC_OUTR;
    uint32_t RESERVED4[3];
#else
    uint32_t RESERVED5[4];
    __IO uint32_t FCKEY3;
    __IO uint32_t B3SEL;
    __IO uint32_t STS3;
    __IO uint32_t CTRL3;
    __IO uint32_t ADDR3;
    __IO uint32_t DA;
#endif
    uint32_t RESERVED6[12];
#if defined (AT32F415xx)
    uint32_t RESERVED7[6];
#else
    __IO uint32_t SLIB_CDR0;
    __IO uint32_t SLIB_CDR1;
    __IO uint32_t SLIB_PSW;
    __IO uint32_t SLIB_PSW_STS;
    __IO uint32_t SLIB_SET_PSW;
    __IO uint32_t SLIB_SET_RANGE;
#endif
    uint32_t RESERVED8[3];
#if defined (AT32F415xx)
    uint32_t RESERVED9[3];
#else
    __IO uint32_t SLIB_KEYR;
    __IO uint32_t CRC_DR;
    __IO uint32_t CRC_OUTR;
#endif
#if defined (AT32F415xx)
    uint32_t RESERVED10[25];
    __IO uint32_t SLIB_SET_PSW;
    __IO uint32_t SLIB_SET_RANGE;
    __IO uint32_t SYS_SLIB_SET;
    __IO uint32_t SYS_BOOT_DIS_SET;
    __IO uint32_t SLIB_KEYR;
#endif
} FLASH_Type;

/**
  * @brief Option Bytes Registers
  */
typedef struct
{
    __IO uint16_t RDPRT;
    __IO uint16_t USR;
    __IO uint16_t DATA0;
    __IO uint16_t DATA1;
    __IO uint16_t WRPRT0;
    __IO uint16_t WRPRT1;
    __IO uint16_t WRPRT2;
    __IO uint16_t WRPRT3;
#if !defined (AT32F415xx)
    __IO uint16_t EOPB0;
    __IO uint16_t EOPB1;
    __IO uint16_t HID[4];
    __IO uint32_t Reserved;
    __IO uint32_t BANK3SCRKEY[4];
#endif
} UOB_Type;

/**
  * @brief Flexible Static Memory Controller
  */
typedef struct
{
    __IO uint32_t BK1CTRLR[8];
} XMC_Bank1_Type;

/**
  * @brief Flexible Static Memory Controller Bank1E
  */
typedef struct
{
    __IO uint32_t BK1TMGWR[7];
} XMC_Bank1Ext_Type;

/**
  * @brief Flexible Static Memory Controller Bank1H
  */
typedef struct
{
    __IO uint32_t BK1EXT[4];
} XMC_Bank1Hide_Type;

/**
  * @brief Flexible Static Memory Controller Bank2
  */
typedef struct
{
    __IO uint32_t BK2CTRL;
    __IO uint32_t BK2STS;
    __IO uint32_t BK2TMGMEM;
    __IO uint32_t BK2TMGATT;
    uint32_t  RESERVED0;
    __IO uint32_t BK2ECC;
} XMC_Bank2_Type;

/**
  * @brief Flexible Static Memory Controller Bank3
  */
typedef struct
{
    __IO uint32_t BK3CTRL;
    __IO uint32_t BK3STS;
    __IO uint32_t BK3TMGMEM;
    __IO uint32_t BK3TMGATT;
    uint32_t  RESERVED0;
    __IO uint32_t BK3ECC;
} XMC_Bank3_Type;

/**
  * @brief Flexible Static Memory Controller Bank4
  */
typedef struct
{
    __IO uint32_t BK4CTRL;
    __IO uint32_t BK4STS;
    __IO uint32_t BK4TMGMEM;
    __IO uint32_t BK4TMGATT;
    __IO uint32_t BK4TMGIO;
} XMC_Bank4_Type;

/**
  * @brief General Purpose I/O
  */
typedef struct
{
    __IO uint32_t CTRLL;
    __IO uint32_t CTRLH;
    __IO uint32_t IPTDT;
    __IO uint32_t OPTDT;
    __IO uint32_t BSRE;
    __IO uint32_t BRE;
    __IO uint32_t LOCK;
#if defined (AT32F403Axx) || defined (AT32F407xx)
    uint32_t RESERVED0;
    __IO uint32_t SRCTR;
    uint32_t RESERVED1;
    uint32_t RESERVED2;
    uint32_t RESERVED3;
    uint32_t RESERVED4;
    uint32_t RESERVED5;
    uint32_t RESERVED6;
    __IO uint32_t HDRV;
#endif
} GPIO_Type;

/**
  * @brief Alternate Function I/O
  */
typedef struct
{
    __IO uint32_t EVCTRL;
    __IO uint32_t MAP;
    __IO uint32_t EXTIC[4];
    uint32_t RESERVED0;
    __IO uint32_t MAP2;
#ifndef AT32F403xx
    __IO uint32_t MAP3;
    __IO uint32_t MAP4;
    __IO uint32_t MAP5;
    __IO uint32_t MAP6;
    __IO uint32_t MAP7;
#ifndef AT32F413xx
    __IO uint32_t MAP8;
#endif
#endif
} AFIO_Type;

/**
  * @brief Inter Integrated Circuit Interface
  */
typedef struct
{
    __IO uint16_t CTRL1;
    uint16_t  RESERVED0;
    __IO uint16_t CTRL2;
    uint16_t  RESERVED1;
    __IO uint16_t OADDR1;
    uint16_t  RESERVED2;
    __IO uint16_t OADDR2;
    uint16_t  RESERVED3;
    __IO uint16_t DT;
    uint16_t  RESERVED4;
    __IO uint16_t STS1;
    uint16_t  RESERVED5;
    __IO uint16_t STS2;
    uint16_t  RESERVED6;
    __IO uint16_t CLKCTRL;
    uint16_t  RESERVED7;
    __IO uint16_t TMRISE;
    uint16_t  RESERVED8;
} I2C_Type;

/**
  * @brief Independent WATCHDOG
  */
typedef struct
{
    __IO uint32_t KEY;
    __IO uint32_t PSC;
    __IO uint32_t RLD;
    __IO uint32_t STS;
} IWDG_Type;

/**
  * @brief Power Control
  */
typedef struct
{
    __IO uint32_t CTRL;
    __IO uint32_t CTRLSTS;
} PWR_Type;

/**
  * @brief Reset and Clock Control
  */
typedef struct
{
    __IO uint32_t CTRL;
    __IO uint32_t CFG;
    __IO uint32_t CLKINT;
    __IO uint32_t APB2RST;
    __IO uint32_t APB1RST;
    __IO uint32_t AHBEN;
    __IO uint32_t APB2EN;
    __IO uint32_t APB1EN;
    __IO uint32_t BDC;
    __IO uint32_t CTRLSTS;
#if defined (AT32F415xx)
    __IO uint32_t AHBRST;
    __IO uint32_t PLL;
#elif defined (AT32F403Axx) || defined (AT32F407xx)
    __IO uint32_t AHBRST;
    __IO uint32_t RESERVED;
#else
    __IO uint32_t RESERVED[2];
#endif
    __IO uint32_t MISC;
#if defined (AT32F413xx) || defined (AT32F403Axx) || \
    defined (AT32F407xx)
    __IO uint32_t RESERVED1[7];
    __IO uint32_t TEST;
    __IO uint32_t MISC2;
    __IO uint32_t RESERVED2;
    __IO uint32_t INTCTRL;
#elif defined (AT32F415xx)
    __IO uint32_t RESERVED1[8];
    __IO uint32_t MISC2;
#endif
} RCC_Type;

/**
  * @brief Real-Time Clock
  */
#if defined (AT32F415xx)
typedef struct
{
  __IO uint32_t TIME;     /*!< ERTC time register,                                        Address offset: 0x00 */
  __IO uint32_t DATE;     /*!< ERTC date register,                                        Address offset: 0x04 */
  __IO uint32_t CTRL;     /*!< ERTC control register,                                     Address offset: 0x08 */
  __IO uint32_t ISTS;     /*!< ERTC initialization and status register,                   Address offset: 0x0C */
  __IO uint32_t PSC;      /*!< ERTC prescaler register,                                   Address offset: 0x10 */
  __IO uint32_t WATR;     /*!< ERTC wakeup timer register,                                Address offset: 0x14 */
  __IO uint32_t CAL;      /*!< ERTC calibration register,                                 Address offset: 0x18 */
  __IO uint32_t ALA;      /*!< ERTC alarm A register,                                     Address offset: 0x1C */
  __IO uint32_t ALB;      /*!< ERTC alarm B register,                                     Address offset: 0x20 */
  __IO uint32_t WPR;      /*!< ERTC write protection register,                            Address offset: 0x24 */
  __IO uint32_t SBSR;     /*!< ERTC sub second register,                                  Address offset: 0x28 */
  __IO uint32_t SFCTR;    /*!< ERTC shift control register,                               Address offset: 0x2C */
  __IO uint32_t TSTM;     /*!< ERTC time stamp time register,                             Address offset: 0x30 */
  __IO uint32_t TSDT;     /*!< ERTC time stamp date register,                             Address offset: 0x34 */
  __IO uint32_t TSSBS;    /*!< ERTC time-stamp sub second register,                       Address offset: 0x38 */
  __IO uint32_t CCR;      /*!< ERTC calibration register,                                 Address offset: 0x3C */
  __IO uint32_t TPAF;     /*!< ERTC tamper and alternate function configuration register, Address offset: 0x40 */
  __IO uint32_t ALASBS;   /*!< ERTC alarm A sub second register,                          Address offset: 0x44 */
  __IO uint32_t ALBSBS;   /*!< ERTC alarm B sub second register,                          Address offset: 0x48 */
  uint32_t RESERVED7;     /*!< Reserved, 0x4C                                                                 */
  __IO uint32_t BKP0DT;   /*!< ERTC backup register 1,                                    Address offset: 0x50 */
  __IO uint32_t BKP1DT;   /*!< ERTC backup register 1,                                    Address offset: 0x54 */
  __IO uint32_t BKP2DT;   /*!< ERTC backup register 2,                                    Address offset: 0x58 */
  __IO uint32_t BKP3DT;   /*!< ERTC backup register 3,                                    Address offset: 0x5C */
  __IO uint32_t BKP4DT;   /*!< ERTC backup register 4,                                    Address offset: 0x60 */
  __IO uint32_t BKP5DT;   /*!< ERTC backup register 5,                                    Address offset: 0x64 */
  __IO uint32_t BKP6DT;   /*!< ERTC backup register 6,                                    Address offset: 0x68 */
  __IO uint32_t BKP7DT;   /*!< ERTC backup register 7,                                    Address offset: 0x6C */
  __IO uint32_t BKP8DT;   /*!< ERTC backup register 8,                                    Address offset: 0x70 */
  __IO uint32_t BKP9DT;   /*!< ERTC backup register 9,                                    Address offset: 0x74 */
  __IO uint32_t BKP10DT;  /*!< ERTC backup register 10,                                   Address offset: 0x78 */
  __IO uint32_t BKP11DT;  /*!< ERTC backup register 11,                                   Address offset: 0x7C */
  __IO uint32_t BKP12DT;  /*!< ERTC backup register 12,                                   Address offset: 0x80 */
  __IO uint32_t BKP13DT;  /*!< ERTC backup register 13,                                   Address offset: 0x84 */
  __IO uint32_t BKP14DT;  /*!< ERTC backup register 14,                                   Address offset: 0x88 */
  __IO uint32_t BKP15DT;  /*!< ERTC backup register 15,                                   Address offset: 0x8C */
  __IO uint32_t BKP16DT;  /*!< ERTC backup register 16,                                   Address offset: 0x90 */
  __IO uint32_t BKP17DT;  /*!< ERTC backup register 17,                                   Address offset: 0x94 */
  __IO uint32_t BKP18DT;  /*!< ERTC backup register 18,                                   Address offset: 0x98 */
  __IO uint32_t BKP19DT;  /*!< ERTC backup register 19,                                   Address offset: 0x9C */
} ERTC_Type;
#else
typedef struct
{
    __IO uint16_t CTRLH;
    uint16_t  RESERVED0;
    __IO uint16_t CTRLL;
    uint16_t  RESERVED1;
    __IO uint16_t DIVH;
    uint16_t  RESERVED2;
    __IO uint16_t DIVL;
    uint16_t  RESERVED3;
    __IO uint16_t DIVCNTH;
    uint16_t  RESERVED4;
    __IO uint16_t DIVCNTL;
    uint16_t  RESERVED5;
    __IO uint16_t CNTH;
    uint16_t  RESERVED6;
    __IO uint16_t CNTL;
    uint16_t  RESERVED7;
    __IO uint16_t ALAH;
    uint16_t  RESERVED8;
    __IO uint16_t ALAL;
    uint16_t  RESERVED9;
} RTC_Type;
#endif
/**
  * @brief SD host Interface
  */
typedef struct
{
    __IO uint32_t POWER;
    __IO uint32_t CLKCTRL;
    __IO uint32_t ARG;
    __IO uint32_t CMD;
    __I uint32_t RSPCMD;
    __I uint32_t RSP1;
    __I uint32_t RSP2;
    __I uint32_t RSP3;
    __I uint32_t RSP4;
    __IO uint32_t DTTMR;
    __IO uint32_t DTLEN;
    __IO uint32_t DTCTRL;
    __I uint32_t DTCNTR;
    __I uint32_t STS;
    __IO uint32_t INTCLR;
    __IO uint32_t INTEN;
    uint32_t  RESERVED0[2];
    __I uint32_t BUFCNTR;
    uint32_t  RESERVED1[13];
    __IO uint32_t BUF;
} SDIO_Type;

/**
  * @brief Serial Peripheral Interface
  */
typedef struct
{
    __IO uint16_t CTRL1;
    uint16_t  RESERVED0;
    __IO uint16_t CTRL2;
    uint16_t  RESERVED1;
    __IO uint16_t STS;
    uint16_t  RESERVED2;
    __IO uint16_t DT;
    uint16_t  RESERVED3;
    __IO uint16_t CPOLY;
    uint16_t  RESERVED4;
    __IO uint16_t RCRC;
    uint16_t  RESERVED5;
    __IO uint16_t TCRC;
    uint16_t  RESERVED6;
    __IO uint16_t I2SCTRL;
    uint16_t  RESERVED7;
    __IO uint16_t I2SCLKP;
    uint16_t  RESERVED8;
} SPI_Type;

/**
  * @brief TIMER
  */
typedef struct
{
    __IO uint16_t CTRL1;
    uint16_t  RESERVED0;
    __IO uint16_t CTRL2;
    uint16_t  RESERVED1;
    __IO uint16_t SMC;
    uint16_t  RESERVED2;
    __IO uint16_t DIE;
    uint16_t  RESERVED3;
    __IO uint16_t STS;
    uint16_t  RESERVED4;
    __IO uint16_t EVEG;
    uint16_t  RESERVED5;
    __IO uint16_t CCM1;
    uint16_t  RESERVED6;
    __IO uint16_t CCM2;
    uint16_t  RESERVED7;
    __IO uint16_t CCE;
    uint16_t  RESERVED8;
    __IO uint32_t CNT;
    __IO uint16_t DIV;
    uint16_t  RESERVED10;
    __IO uint32_t AR;
    __IO uint16_t RC;
    uint16_t  RESERVED12;
    __IO uint32_t CC1;
    __IO uint32_t CC2;
    __IO uint32_t CC3;
    __IO uint32_t CC4;
    __IO uint16_t BRKDT;
    uint16_t  RESERVED17;
    __IO uint16_t DMAC;
    uint16_t  RESERVED18;
    __IO uint16_t DMABA;
    uint16_t  RESERVED19;
} TMR_Type;

/**
  * @brief Universal Synchronous Asynchronous Receiver Transmitter
  */
typedef struct
{
    __IO uint16_t STS;
    uint16_t  RESERVED0;
    __IO uint16_t DT;
    uint16_t  RESERVED1;
    __IO uint16_t BAUDR;
    uint16_t  RESERVED2;
    __IO uint16_t CTRL1;
    uint16_t  RESERVED3;
    __IO uint16_t CTRL2;
    uint16_t  RESERVED4;
    __IO uint16_t CTRL3;
    uint16_t  RESERVED5;
    __IO uint16_t GTP;
    uint16_t  RESERVED6;
} USART_Type;

/**
  * @brief Window WATCHDOG
  */
typedef struct
{
    __IO uint32_t CTRL;
    __IO uint32_t CFG;
    __IO uint32_t STS;
} WWDG_Type;

/**
  * @brief Ethernet MAC
  */

typedef struct
{
  __IO uint32_t MACCTRL;
  __IO uint32_t MACFRMF;
  __IO uint32_t MACHTH;
  __IO uint32_t MACHTL;
  __IO uint32_t MACMIIADDR;
  __IO uint32_t MACMIIDT;
  __IO uint32_t MACFCTRL;
  __IO uint32_t MACVLT;             /*    8 */
       uint32_t RESERVED0[2];
  __IO uint32_t MACRWFF;             /*   11 */
  __IO uint32_t MACPMTCTRLSTS;
       uint32_t RESERVED1[2];
  __IO uint32_t MACISTS;                 /*   15 */
  __IO uint32_t MACIM;
  __IO uint32_t MACA0H;
  __IO uint32_t MACA0L;
  __IO uint32_t MACA1H;
  __IO uint32_t MACA1L;
  __IO uint32_t MACA2H;
  __IO uint32_t MACA2L;
  __IO uint32_t MACA3H;
  __IO uint32_t MACA3L;               /*   24 */
       uint32_t RESERVED2[40];
  __IO uint32_t MMCCTRL;                 /*   65 */
  __IO uint32_t MMCRI;
  __IO uint32_t MMCTI;
  __IO uint32_t MMCRIM;
  __IO uint32_t MMCTIM;               /*   69 */
       uint32_t RESERVED3[14];
  __IO uint32_t MMCTFSCC;            /*   84 */
  __IO uint32_t MMCTFMSCC;
       uint32_t RESERVED4[5];
  __IO uint32_t MMCTFCNT;
       uint32_t RESERVED5[10];
  __IO uint32_t MMCRFCECNT;
  __IO uint32_t MMCRFAECNT;
       uint32_t RESERVED6[10];
  __IO uint32_t MMCRGUFCNT;
       uint32_t RESERVED7[334];
  __IO uint32_t PTPTSCTRL;
  __IO uint32_t PTPSSINC;
  __IO uint32_t PTPTSH;
  __IO uint32_t PTPTSL;
  __IO uint32_t PTPTSHUD;
  __IO uint32_t PTPTSLUD;
  __IO uint32_t PTPTSAD;
  __IO uint32_t PTPTTH;
  __IO uint32_t PTPTTL;
       uint32_t RESERVED8[567];
  __IO uint32_t DMABM;
  __IO uint32_t DMATPD;
  __IO uint32_t DMARPD;
  __IO uint32_t DMARDLADDR;
  __IO uint32_t DMATDLADDR;
  __IO uint32_t DMASTS;
  __IO uint32_t DMAOPM;
  __IO uint32_t DMAIE;
  __IO uint32_t DMAMFBOCNT;
       uint32_t RESERVED9[9];
  __IO uint32_t DMACTD;
  __IO uint32_t DMACRD;
  __IO uint32_t DMACTBADDR;
  __IO uint32_t DMACRBADDR;
} ETH_Type;

/**
  * @}
  */

/** @addtogroup Peripheral_memory_map
  * @{
  */

