RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#define FLASH_BASE            ((uint32_t)0x08000000) /*!< FLASH base address in the alias region */
#define EXT_FLASH_BASE        ((uint32_t)0x08400000) /*!< External FLASH base address in the alias region */
#define SRAM_BASE             ((uint32_t)0x20000000) /*!< SRAM base address in the alias region */
#define PERIPH_BASE           ((uint32_t)0x40000000) /*!< Peripheral base address in the alias region */

#define SRAM_BB_BASE          ((uint32_t)0x22000000) /*!< SRAM base address in the bit-band region */
#define PERIPH_BB_BASE        ((uint32_t)0x42000000) /*!< Peripheral base address in the bit-band region */

#if defined (AT32F403xx) || defined (AT32F403Axx) || defined (AT32F407xx)
 #define XMC_R_BASE           ((uint32_t)0xA0000000) /*!< XMC registers base address */
#endif

#define UOB_BASE              ((uint32_t)0x1FFFF800) /*!< Flash Option Bytes base address */

#define DBGMCU_BASE           ((uint32_t)0xE0042000) /*!< Debug MCU registers base address */

/** Peripheral memory map */
#define APB1PERIPH_BASE       (PERIPH_BASE)
#define APB2PERIPH_BASE       (PERIPH_BASE + 0x10000)
#define AHBPERIPH_BASE        (PERIPH_BASE + 0x20000)

#define TMR2_BASE             (APB1PERIPH_BASE + 0x0000)
#define TMR3_BASE             (APB1PERIPH_BASE + 0x0400)
#define TMR4_BASE             (APB1PERIPH_BASE + 0x0800)
#define TMR5_BASE             (APB1PERIPH_BASE + 0x0C00)
#if !defined (AT32F415xx)
 #define RTC_BASE             (APB1PERIPH_BASE + 0x2800)
#else
 #define ERTC_BASE            (APB1PERIPH_BASE + 0x2800)
#endif
#define WWDG_BASE             (APB1PERIPH_BASE + 0x2C00)
#define IWDG_BASE             (APB1PERIPH_BASE + 0x3000)
#define SPI2_BASE             (APB1PERIPH_BASE + 0x3800)
#define USART2_BASE           (APB1PERIPH_BASE + 0x4400)
#define USART3_BASE           (APB1PERIPH_BASE + 0x4800)
#define UART4_BASE            (APB1PERIPH_BASE + 0x4C00)
#define UART5_BASE            (APB1PERIPH_BASE + 0x5000)
#define I2C1_BASE             (APB1PERIPH_BASE + 0x5400)
#define I2C2_BASE             (APB1PERIPH_BASE + 0x5800)
#define CAN1_BASE             (APB1PERIPH_BASE + 0x6400)

#if !defined (AT32F415xx)
 #define BKP_BASE             (APB1PERIPH_BASE + 0x6C00)
#endif

#define PWR_BASE              (APB1PERIPH_BASE + 0x7000)

#define AFIO_BASE             (APB2PERIPH_BASE + 0x0000)
#define EXTI_BASE             (APB2PERIPH_BASE + 0x0400)

#if defined (AT32F413xx) || defined (AT32F415xx)
 #define GPIOA_BASE           (PERIPH_BASE + 0x10800)
 #define GPIOB_BASE           (PERIPH_BASE + 0x10C00)
 #define GPIOC_BASE           (PERIPH_BASE + 0x11000)
 #define GPIOD_BASE           (PERIPH_BASE + 0x11400)
 #define GPIOF_BASE           (PERIPH_BASE + 0x11C00)
#elif defined (AT32F403xx)
 #define GPIOA_BASE           (APB2PERIPH_BASE + 0x0800)
 #define GPIOB_BASE           (APB2PERIPH_BASE + 0x0C00)
 #define GPIOC_BASE           (APB2PERIPH_BASE + 0x1000)
 #define GPIOD_BASE           (APB2PERIPH_BASE + 0x1400)
 #define GPIOE_BASE           (APB2PERIPH_BASE + 0x1800)
 #define GPIOF_BASE           (APB2PERIPH_BASE + 0x1C00)
 #define GPIOG_BASE           (APB2PERIPH_BASE + 0x2000)
#elif defined (AT32F403Axx) || defined (AT32F407xx)
 #define GPIOA_BASE           (APB2PERIPH_BASE + 0x0800)
 #define GPIOB_BASE           (APB2PERIPH_BASE + 0x0C00)
 #define GPIOC_BASE           (APB2PERIPH_BASE + 0x1000)
 #define GPIOD_BASE           (APB2PERIPH_BASE + 0x1400)
 #define GPIOE_BASE           (APB2PERIPH_BASE + 0x1800)
#endif

#define ADC1_BASE             (APB2PERIPH_BASE + 0x2400)
#define ADC2_BASE             (APB2PERIPH_BASE + 0x2800)
#define TMR1_BASE             (APB2PERIPH_BASE + 0x2C00)
#define SPI1_BASE             (APB2PERIPH_BASE + 0x3000)
#if !defined (AT32F415xx)
 #define TMR8_BASE            (APB2PERIPH_BASE + 0x3400)
#endif

#define USART1_BASE           (APB2PERIPH_BASE + 0x3800)
#define TMR9_BASE             (APB2PERIPH_BASE + 0x4C00)
#define TMR10_BASE            (APB2PERIPH_BASE + 0x5000)
#define TMR11_BASE            (APB2PERIPH_BASE + 0x5400)

#define DMA1_BASE             (AHBPERIPH_BASE + 0x0000)
#define DMA1_Channel1_BASE    (AHBPERIPH_BASE + 0x0008)
#define DMA1_Channel2_BASE    (AHBPERIPH_BASE + 0x001C)
#define DMA1_Channel3_BASE    (AHBPERIPH_BASE + 0x0030)
#define DMA1_Channel4_BASE    (AHBPERIPH_BASE + 0x0044)
#define DMA1_Channel5_BASE    (AHBPERIPH_BASE + 0x0058)
#define DMA1_Channel6_BASE    (AHBPERIPH_BASE + 0x006C)
#define DMA1_Channel7_BASE    (AHBPERIPH_BASE + 0x0080)
#define DMA2_BASE             (AHBPERIPH_BASE + 0x0400)
#define DMA2_Channel1_BASE    (AHBPERIPH_BASE + 0x0408)
#define DMA2_Channel2_BASE    (AHBPERIPH_BASE + 0x041C)
#define DMA2_Channel3_BASE    (AHBPERIPH_BASE + 0x0430)
#define DMA2_Channel4_BASE    (AHBPERIPH_BASE + 0x0444)
#define DMA2_Channel5_BASE    (AHBPERIPH_BASE + 0x0458)

#define RCC_BASE              (AHBPERIPH_BASE + 0x1000)
#define FLASH_R_BASE          (AHBPERIPH_BASE + 0x2000) /*!< Flash registers base address */
#define CRC_BASE              (AHBPERIPH_BASE + 0x3000)

#if defined (AT32F415xx)
 #define ACC_BASE             (APB2PERIPH_BASE + 0x5800)
 #define SDIO_BASE            (PERIPH_BASE + 0x18000)
 #define USBOTG_BASE          (PERIPH_BASE + 0x10000000)
 #define COMP_BASE            (APB1PERIPH_BASE + 0x2400)
 #define DMA2_Channel6_BASE   (AHBPERIPH_BASE + 0x046C)
 #define DMA2_Channel7_BASE   (AHBPERIPH_BASE + 0x0480)
#elif defined (AT32F413xx)
 #if !defined (AT32FEBKCx_MD)
  #define CAN2_BASE           (APB1PERIPH_BASE + 0x6800)
  #define ACC_BASE            (APB2PERIPH_BASE + 0x5800)
  #define SDIO_BASE           (PERIPH_BASE + 0x18000)
 #endif
 #define DMA2_Channel6_BASE   (AHBPERIPH_BASE + 0x046C)
 #define DMA2_Channel7_BASE   (AHBPERIPH_BASE + 0x0480)
#elif defined (AT32F403xx)
 #define TMR6_BASE            (APB1PERIPH_BASE + 0x1000)
 #define TMR7_BASE            (APB1PERIPH_BASE + 0x1400)
 #define TMR12_BASE           (APB1PERIPH_BASE + 0x1800)
 #define TMR13_BASE           (APB1PERIPH_BASE + 0x1C00)
 #define TMR14_BASE           (APB1PERIPH_BASE + 0x2000)
 #define SPI3_BASE            (APB1PERIPH_BASE + 0x3C00)
 #define SPI4_BASE            (APB1PERIPH_BASE + 0x4000)
 #define I2C3_BASE            (APB1PERIPH_BASE + 0x6800)
 #define DAC_BASE             (APB1PERIPH_BASE + 0x7400)
 #define ADC3_BASE            (APB2PERIPH_BASE + 0x3C00)
 #define TMR15_BASE           (APB2PERIPH_BASE + 0x4000)
 #define SDIO1_BASE           (PERIPH_BASE + 0x18000)
 #define SDIO2_BASE           (AHBPERIPH_BASE + 0x3400)
 #define XMC_Bank1_R_BASE     (XMC_R_BASE + 0x0000) /*!< XMC Bank1 registers base address */
 #define XMC_Bank1E_R_BASE    (XMC_R_BASE + 0x0104) /*!< XMC Bank1E registers base address */
 #define XMC_Bank1E_H_BASE    (XMC_R_BASE + 0x0220) /*!< XMC Bank1H registers base address */
 #define XMC_Bank2_R_BASE     (XMC_R_BASE + 0x0060) /*!< XMC Bank2 registers base address */
 #define XMC_Bank3_R_BASE     (XMC_R_BASE + 0x0080) /*!< XMC Bank3 registers base address */
 #define XMC_Bank4_R_BASE     (XMC_R_BASE + 0x00A0) /*!< XMC Bank4 registers base address */
#elif defined (AT32F403Axx) || defined (AT32F407xx)
 #define TMR6_BASE            (APB1PERIPH_BASE + 0x1000)
 #define TMR7_BASE            (APB1PERIPH_BASE + 0x1400)
 #define TMR12_BASE           (APB1PERIPH_BASE + 0x1800)
 #define TMR13_BASE           (APB1PERIPH_BASE + 0x1C00)
 #define TMR14_BASE           (APB1PERIPH_BASE + 0x2000)
 #define SPI3_BASE            (APB1PERIPH_BASE + 0x3C00)
 #define SPI4_BASE            (APB1PERIPH_BASE + 0x4000)
 #define CAN2_BASE            (APB1PERIPH_BASE + 0x6800)
 #define DAC_BASE             (APB1PERIPH_BASE + 0x7400)
 #define ADC3_BASE            (APB2PERIPH_BASE + 0x3C00)
 #define ACC_BASE             (APB2PERIPH_BASE + 0x5800)
 #define I2C3_BASE            (APB2PERIPH_BASE + 0x5C00)
 #define USART6_BASE          (APB2PERIPH_BASE + 0x6000)
 #define UART7_BASE           (APB2PERIPH_BASE + 0x6400)
 #define UART8_BASE           (APB2PERIPH_BASE + 0x6800)
 #define I2S2EXT_BASE         (APB2PERIPH_BASE + 0x6C00)
 #define I2S3EXT_BASE         (APB2PERIPH_BASE + 0x7000)
 #define SDIO1_BASE           (PERIPH_BASE + 0x18000)
 #define SDIO2_BASE           (AHBPERIPH_BASE + 0x3400)
 #define DMA2_Channel6_BASE   (AHBPERIPH_BASE + 0x046C)
 #define DMA2_Channel7_BASE   (AHBPERIPH_BASE + 0x0480)
 #define XMC_Bank1_R_BASE     (XMC_R_BASE + 0x0000) /*!< XMC Bank1 registers base address */
 #define XMC_Bank1E_R_BASE    (XMC_R_BASE + 0x0104) /*!< XMC Bank1E registers base address */
 #define XMC_Bank1E_H_BASE    (XMC_R_BASE + 0x0220) /*!< XMC Bank1H registers base address */
 #define XMC_Bank2_R_BASE     (XMC_R_BASE + 0x0060) /*!< XMC Bank2 registers base address */
 #define XMC_Bank3_R_BASE     (XMC_R_BASE + 0x0080) /*!< XMC Bank3 registers base address */
 #define XMC_Bank4_R_BASE     (XMC_R_BASE + 0x00A0) /*!< XMC Bank4 registers base address */
#endif

#if defined (AT32F407xx)
 #define ETH_BASE             (AHBPERIPH_BASE + 0x8000)
 #define ETH_MAC_BASE         (ETH_BASE)
 #define ETH_MMC_BASE         (ETH_BASE + 0x0100)
 #define ETH_PTP_BASE         (ETH_BASE + 0x0700)
 #define ETH_DMA_BASE         (ETH_BASE + 0x1000)
#endif

/**
  * @}
  */

/** @addtogroup Peripheral_declaration
  * @{
  */
#if defined (AT32F415xx)
 #define ACC                ((ACC_Type *) ACC_BASE)
 #define COMP               ((COMP_Type *)COMP_BASE)
 #define SDIO               ((SDIO_Type *) SDIO_BASE)
 #define USBOTG             ((USBOTG_Type *) USBOTG_BASE)
 #define DMA2_Channel6      ((DMA_Channel_Type *) DMA2_Channel6_BASE)
 #define DMA2_Channel7      ((DMA_Channel_Type *) DMA2_Channel7_BASE)
#elif defined (AT32F413xx)
 #if !defined (AT32FEBKCx_MD)
  #define CAN2              ((CAN_Type *) CAN2_BASE)
  #define SDIO              ((SDIO_Type *) SDIO_BASE)
  #define ACC               ((ACC_Type *) ACC_BASE)
 #endif
 #define DMA2_Channel6      ((DMA_Channel_Type *) DMA2_Channel6_BASE)
 #define DMA2_Channel7      ((DMA_Channel_Type *) DMA2_Channel7_BASE)
#elif defined (AT32F403xx)
 #define TMR6               ((TMR_Type *) TMR6_BASE)
 #define TMR7               ((TMR_Type *) TMR7_BASE)
 #define TMR12              ((TMR_Type *) TMR12_BASE)
 #define TMR13              ((TMR_Type *) TMR13_BASE)
 #define TMR14              ((TMR_Type *) TMR14_BASE)
 #define SPI3               ((SPI_Type *) SPI3_BASE)
 #define SPI4               ((SPI_Type *) SPI4_BASE)
 #define I2C3               ((I2C_Type *) I2C3_BASE)
 #define DAC                ((DAC_Type *) DAC_BASE)
 #define GPIOE              ((GPIO_Type *) GPIOE_BASE)
 #define GPIOG              ((GPIO_Type *) GPIOG_BASE)
 #define ADC3               ((ADC_Type *) ADC3_BASE)
 #define TMR15              ((TMR_Type *) TMR15_BASE)
 #define SDIO1              ((SDIO_Type *) SDIO1_BASE)
 #define SDIO2              ((SDIO_Type *) SDIO2_BASE)
 #define XMC_Bank1          ((XMC_Bank1_Type *) XMC_Bank1_R_BASE)
 #define XMC_Bank1E         ((XMC_Bank1Ext_Type *) XMC_Bank1E_R_BASE)
 #define XMC_Bank1H         ((XMC_Bank1Hide_Type *) XMC_Bank1E_H_BASE)
 #define XMC_Bank2          ((XMC_Bank2_Type *) XMC_Bank2_R_BASE)
 #define XMC_Bank3          ((XMC_Bank3_Type *) XMC_Bank3_R_BASE)
 #define XMC_Bank4          ((XMC_Bank4_Type *) XMC_Bank4_R_BASE)
#elif defined (AT32F403Axx) || defined (AT32F407xx)
 #define TMR6               ((TMR_Type *) TMR6_BASE)
 #define TMR7               ((TMR_Type *) TMR7_BASE)
 #define TMR12              ((TMR_Type *) TMR12_BASE)
 #define TMR13              ((TMR_Type *) TMR13_BASE)
 #define TMR14              ((TMR_Type *) TMR14_BASE)
 #define SPI3               ((SPI_Type *) SPI3_BASE)
 #define SPI4               ((SPI_Type *) SPI4_BASE)
 #define CAN2               ((CAN_Type *) CAN2_BASE)
 #define I2C3               ((I2C_Type *) I2C3_BASE)
 #define DAC                ((DAC_Type *) DAC_BASE)
 #define GPIOE              ((GPIO_Type *) GPIOE_BASE)
 #define ADC3               ((ADC_Type *) ADC3_BASE)
 #define ACC                ((ACC_Type *) ACC_BASE)
 #define USART6             ((USART_Type *) USART6_BASE)
 #define UART7              ((USART_Type *) UART7_BASE)
 #define UART8              ((USART_Type *) UART8_BASE)
 #define I2S2EXT            ((SPI_Type *) I2S2EXT_BASE)
 #define I2S3EXT            ((SPI_Type *) I2S3EXT_BASE)
 #define SDIO1              ((SDIO_Type *) SDIO1_BASE)
 #define SDIO2              ((SDIO_Type *) SDIO2_BASE)
 #define XMC_Bank1          ((XMC_Bank1_Type *) XMC_Bank1_R_BASE)
 #define XMC_Bank1E         ((XMC_Bank1Ext_Type *) XMC_Bank1E_R_BASE)
 #define XMC_Bank1H         ((XMC_Bank1Hide_Type *) XMC_Bank1E_H_BASE)
 #define XMC_Bank2          ((XMC_Bank2_Type *) XMC_Bank2_R_BASE)
 #define XMC_Bank3          ((XMC_Bank3_Type *) XMC_Bank3_R_BASE)
 #define XMC_Bank4          ((XMC_Bank4_Type *) XMC_Bank4_R_BASE)
 #define DMA2_Channel6      ((DMA_Channel_Type *) DMA2_Channel6_BASE)
 #define DMA2_Channel7      ((DMA_Channel_Type *) DMA2_Channel7_BASE)
#endif

#if !defined (AT32F415xx)
 #define TMR8               ((TMR_Type *) TMR8_BASE)
#endif

#define TMR2                ((TMR_Type *) TMR2_BASE)
#define TMR3                ((TMR_Type *) TMR3_BASE)
#define TMR4                ((TMR_Type *) TMR4_BASE)
#define TMR5                ((TMR_Type *) TMR5_BASE)
#if !defined (AT32F415xx)
 #define RTC                ((RTC_Type *) RTC_BASE)
#else
 #define ERTC               ((ERTC_Type *) ERTC_BASE)
#endif
#define WWDG                ((WWDG_Type *) WWDG_BASE)
#define IWDG                ((IWDG_Type *) IWDG_BASE)
#define SPI2                ((SPI_Type *) SPI2_BASE)
#define USART2              ((USART_Type *) USART2_BASE)
#define USART3              ((USART_Type *) USART3_BASE)
#define UART4               ((USART_Type *) UART4_BASE)
#define UART5               ((USART_Type *) UART5_BASE)
#define I2C1                ((I2C_Type *) I2C1_BASE)
#define I2C2                ((I2C_Type *) I2C2_BASE)
#define CAN1                ((CAN_Type *) CAN1_BASE)
#define BKP                 ((BKP_Type *) BKP_BASE)
#define PWR                 ((PWR_Type *) PWR_BASE)
#define AFIO                ((AFIO_Type *) AFIO_BASE)
#define EXTI                ((EXTI_Type *) EXTI_BASE)
#define GPIOA               ((GPIO_Type *) GPIOA_BASE)
#define GPIOB               ((GPIO_Type *) GPIOB_BASE)
#define GPIOC               ((GPIO_Type *) GPIOC_BASE)
#define GPIOD               ((GPIO_Type *) GPIOD_BASE)
#if !defined (AT32F403Axx) && !defined (AT32F407xx)
 #define GPIOF              ((GPIO_Type *) GPIOF_BASE)
#endif
#define ADC1                ((ADC_Type *) ADC1_BASE)
#define ADC2                ((ADC_Type *) ADC2_BASE)
#define TMR1                ((TMR_Type *) TMR1_BASE)
#define SPI1                ((SPI_Type *) SPI1_BASE)
#define USART1              ((USART_Type *) USART1_BASE)
#define TMR9                ((TMR_Type *) TMR9_BASE)
#define TMR10               ((TMR_Type *) TMR10_BASE)
#define TMR11               ((TMR_Type *) TMR11_BASE)
#define DMA1                ((DMA_Type *) DMA1_BASE)
#define DMA2                ((DMA_Type *) DMA2_BASE)
#define DMA1_Channel1       ((DMA_Channel_Type *) DMA1_Channel1_BASE)
#define DMA1_Channel2       ((DMA_Channel_Type *) DMA1_Channel2_BASE)
#define DMA1_Channel3       ((DMA_Channel_Type *) DMA1_Channel3_BASE)
#define DMA1_Channel4       ((DMA_Channel_Type *) DMA1_Channel4_BASE)
#define DMA1_Channel5       ((DMA_Channel_Type *) DMA1_Channel5_BASE)
#define DMA1_Channel6       ((DMA_Channel_Type *) DMA1_Channel6_BASE)
#define DMA1_Channel7       ((DMA_Channel_Type *) DMA1_Channel7_BASE)
#define DMA2_Channel1       ((DMA_Channel_Type *) DMA2_Channel1_BASE)
#define DMA2_Channel2       ((DMA_Channel_Type *) DMA2_Channel2_BASE)
#define DMA2_Channel3       ((DMA_Channel_Type *) DMA2_Channel3_BASE)
#define DMA2_Channel4       ((DMA_Channel_Type *) DMA2_Channel4_BASE)
#define DMA2_Channel5       ((DMA_Channel_Type *) DMA2_Channel5_BASE)
#define RCC                 ((RCC_Type *) RCC_BASE)
#define CRC                 ((CRC_Type *) CRC_BASE)
#define FLASH               ((FLASH_Type *) FLASH_R_BASE)
#define UOPTB               ((UOB_Type *) UOB_BASE)
#define DBGMCU              ((MCUDBG_Type *) DBGMCU_BASE)

#if defined (AT32F407xx)
 #define ETH                ((ETH_Type *) ETH_BASE)
#endif

/**
  * @}
  */

/** @addtogroup Exported_constants
  * @{
  */

/** @addtogroup Peripheral_Registers_Bits_Definition
* @{
*/

/******************************************************************************/
/*                         Peripheral Registers_Bits_Definition               */
/******************************************************************************/

/******************************************************************************/
/*                                                                            */
/*                          CRC calculation unit                              */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for CRC_DT register  *********************/
#define  CRC_DT_DR                              ((uint32_t)0xFFFFFFFF) /*!< Data register bits */


