RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/*******************  Bit definition for CRC_IDT register  ********************/
#define  CRC_IDT_IDR                            ((uint8_t)0xFF)        /*!< General-purpose 8-bit data register bits */


/********************  Bit definition for CRC_CTRL register  ********************/
#define  CRC_CTRL_RST                           ((uint8_t)0x01)        /*!< RESET bit */

/******************************************************************************/
/*                                                                            */
/*                      Analog Comparators (COMP)                             */
/*                                                                            */
/******************************************************************************/

/*********************  Bit definition for COMP_CTRLSTS register  *************/
/* COMP1 bits definition */
#define COMP_CTRLSTS_COMP1EN                    ((uint32_t)0x00000001)        /*!< COMP1 enable */
#define COMP_CTRLSTS_COMP1SW1                   ((uint32_t)0x00000002)        /*!< SW1 switch control */
#define COMP_CTRLSTS_COMP1MDE                   ((uint32_t)0x0000000C)        /*!< COMP1 power mode */
#define COMP_CTRLSTS_COMP1MDE_0                 ((uint32_t)0x00000004)        /*!< COMP1 power mode bit 0 */
#define COMP_CTRLSTS_COMP1MDE_1                 ((uint32_t)0x00000008)        /*!< COMP1 power mode bit 1 */
#define COMP_CTRLSTS_COMP1INSEL                 ((uint32_t)0x00000070)        /*!< COMP1 inverting input select */
#define COMP_CTRLSTS_COMP1INSEL_0               ((uint32_t)0x00000010)        /*!< COMP1 inverting input select bit 0 */
#define COMP_CTRLSTS_COMP1INSEL_1               ((uint32_t)0x00000020)        /*!< COMP1 inverting input select bit 1 */
#define COMP_CTRLSTS_COMP1INSEL_2               ((uint32_t)0x00000040)        /*!< COMP1 inverting input select bit 2 */
#define COMP_CTRLSTS_COMP1OUTSEL                ((uint32_t)0x00000700)        /*!< COMP1 output select */
#define COMP_CTRLSTS_COMP1OUTSEL_0              ((uint32_t)0x00000100)        /*!< COMP1 output select bit 0 */
#define COMP_CTRLSTS_COMP1OUTSEL_1              ((uint32_t)0x00000200)        /*!< COMP1 output select bit 1 */
#define COMP_CTRLSTS_COMP1OUTSEL_2              ((uint32_t)0x00000400)        /*!< COMP1 output select bit 2 */
#define COMP_CTRLSTS_COMP1POL                   ((uint32_t)0x00000800)        /*!< COMP1 output polarity */
#define COMP_CTRLSTS_COMP1HYST                  ((uint32_t)0x00003000)        /*!< COMP1 hysteresis */
#define COMP_CTRLSTS_COMP1HYST_0                ((uint32_t)0x00001000)        /*!< COMP1 hysteresis bit 0 */
#define COMP_CTRLSTS_COMP1HYST_1                ((uint32_t)0x00002000)        /*!< COMP1 hysteresis bit 1 */
#define COMP_CTRLSTS_COMP1OUT                   ((uint32_t)0x00004000)        /*!< COMP1 output level */
#define COMP_CTRLSTS_COMP1LOCK                  ((uint32_t)0x00008000)        /*!< COMP1 lock */
/* COMP2 bits definition */
#define COMP_CTRLSTS_COMP2EN                    ((uint32_t)0x00010000)        /*!< COMP2 enable */
#define COMP_CTRLSTS_COMP2MDE                   ((uint32_t)0x000C0000)        /*!< COMP2 power mode */
#define COMP_CTRLSTS_COMP2MDE_0                 ((uint32_t)0x00040000)        /*!< COMP2 power mode bit 0 */
#define COMP_CTRLSTS_COMP2MDE_1                 ((uint32_t)0x00080000)        /*!< COMP2 power mode bit 1 */
#define COMP_CTRLSTS_COMP2INSEL                 ((uint32_t)0x00700000)        /*!< COMP2 inverting input select */
#define COMP_CTRLSTS_COMP2INSEL_0               ((uint32_t)0x00100000)        /*!< COMP2 inverting input select bit 0 */
#define COMP_CTRLSTS_COMP2INSEL_1               ((uint32_t)0x00200000)        /*!< COMP2 inverting input select bit 1 */
#define COMP_CTRLSTS_COMP2INSEL_2               ((uint32_t)0x00400000)        /*!< COMP2 inverting input select bit 2 */
#define COMP_CTRLSTS_WNDWEN                     ((uint32_t)0x00800000)        /*!< Comparators window mode enable */
#define COMP_CTRLSTS_COMP2OUTSEL                ((uint32_t)0x07000000)        /*!< COMP2 output select */
#define COMP_CTRLSTS_COMP2OUTSEL_0              ((uint32_t)0x01000000)        /*!< COMP2 output select bit 0 */
#define COMP_CTRLSTS_COMP2OUTSEL_1              ((uint32_t)0x02000000)        /*!< COMP2 output select bit 1 */
#define COMP_CTRLSTS_COMP2OUTSEL_2              ((uint32_t)0x04000000)        /*!< COMP2 output select bit 2 */
#define COMP_CTRLSTS_COMP2POL                   ((uint32_t)0x08000000)        /*!< COMP2 output polarity */
#define COMP_CTRLSTS_COMP2HYST                  ((uint32_t)0x30000000)        /*!< COMP2 hysteresis */
#define COMP_CTRLSTS_COMP2HYST_0                ((uint32_t)0x10000000)        /*!< COMP2 hysteresis bit 0 */
#define COMP_CTRLSTS_COMP2HYST_1                ((uint32_t)0x20000000)        /*!< COMP2 hysteresis bit 1 */
#define COMP_CTRLSTS_COMP2OUT                   ((uint32_t)0x40000000)        /*!< COMP2 output level */
#define COMP_CTRLSTS_COMP2LOCK                  ((uint32_t)0x80000000)        /*!< COMP2 lock */

/***************  Bit definition for COMP_G_FILTER_EN register  ***************/
#define COMP_G_FILTER_EN_GFE                    ((uint16_t)0x0001)            /*!< Comparators Glitch filter enable */

/******************************************************************************/
/*                                                                            */
/*                             Power Control                                  */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for PWR_CTRL register  ********************/
#define  PWR_CTRL_PDDS                          ((uint16_t)0x0002)            /*!< Power Down Deepsleep */
#define  PWR_CTRL_CLWUF                         ((uint16_t)0x0004)            /*!< Clear Wakeup Flag */
#define  PWR_CTRL_CLSBF                         ((uint16_t)0x0008)            /*!< Clear Standby Flag */
#define  PWR_CTRL_PVDEN                         ((uint16_t)0x0010)            /*!< Power Voltage Detector Enable */

