RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#define  PWR_CTRL_PVDS                          ((uint16_t)0x00E0)            /*!< PLS[2:0] bits (PVD Level Selection) */
#define  PWR_CTRL_PVDS_0                        ((uint16_t)0x0020)            /*!< Bit 0 */
#define  PWR_CTRL_PVDS_1                        ((uint16_t)0x0040)            /*!< Bit 1 */
#define  PWR_CTRL_PVDS_2                        ((uint16_t)0x0080)            /*!< Bit 2 */

/** PVD level configuration */
#define  PWR_CTRL_PVDS_2V2                      ((uint16_t)0x0000)            /*!< PVD level 2.2V */
#define  PWR_CTRL_PVDS_2V3                      ((uint16_t)0x0020)            /*!< PVD level 2.3V */
#define  PWR_CTRL_PVDS_2V4                      ((uint16_t)0x0040)            /*!< PVD level 2.4V */
#define  PWR_CTRL_PVDS_2V5                      ((uint16_t)0x0060)            /*!< PVD level 2.5V */
#define  PWR_CTRL_PVDS_2V6                      ((uint16_t)0x0080)            /*!< PVD level 2.6V */
#define  PWR_CTRL_PVDS_2V7                      ((uint16_t)0x00A0)            /*!< PVD level 2.7V */
#define  PWR_CTRL_PVDS_2V8                      ((uint16_t)0x00C0)            /*!< PVD level 2.8V */
#define  PWR_CTRL_PVDS_2V9                      ((uint16_t)0x00E0)            /*!< PVD level 2.9V */

#define  PWR_CTRL_DBP                           ((uint16_t)0x0100)            /*!< Disable Backup Domain write protection */

/*******************  Bit definition for PWR_CTRLSTS register  ********************/
#define  PWR_CTRLSTS_WUF                        ((uint16_t)0x0001)            /*!< Wakeup Flag */
#define  PWR_CTRLSTS_SBF                        ((uint16_t)0x0002)            /*!< Standby Flag */
#define  PWR_CTRLSTS_PVD                        ((uint16_t)0x0004)            /*!< PVD Output */
#define  PWR_CTRLSTS_WUPEN                      ((uint16_t)0x0100)            /*!< Enable WKUP pin */

/******************************************************************************/
/*                                                                            */
/*                            Backup registers                                */
/*                                                                            */
/******************************************************************************/
#if !defined (AT32F415xx)
/*******************  Bit definition for BKP_DT1 register  ********************/
#define  BKP_DT1_D                              ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT2 register  ********************/
#define  BKP_DT2_D                              ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT3 register  ********************/
#define  BKP_DT3_D                              ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT4 register  ********************/
#define  BKP_DT4_D                              ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT5 register  ********************/
#define  BKP_DT5_D                              ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT6 register  ********************/
#define  BKP_DT6_D                              ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT7 register  ********************/
#define  BKP_DT7_D                              ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT8 register  ********************/
#define  BKP_DT8_D                              ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT9 register  ********************/
#define  BKP_DT9_D                              ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT10 register  *******************/
#define  BKP_DT10_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT11 register  *******************/
#define  BKP_DT11_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT12 register  *******************/
#define  BKP_DT12_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT13 register  *******************/
#define  BKP_DT13_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT14 register  *******************/
#define  BKP_DT14_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT15 register  *******************/
#define  BKP_DT15_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT16 register  *******************/
#define  BKP_DT16_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT17 register  *******************/
#define  BKP_DT17_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/******************  Bit definition for BKP_DT18 register  ********************/
#define  BKP_DT18_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT19 register  *******************/
#define  BKP_DT19_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT20 register  *******************/
#define  BKP_DT20_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT21 register  *******************/
#define  BKP_DT21_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT22 register  *******************/
#define  BKP_DT22_D                             ((uint16_t)0xFFFF)           /*!< Backup data */

/*******************  Bit definition for BKP_DT23 register  *******************/
#define  BKP_DT23_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

