RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/*******************  Bit definition for BKP_DT24 register  *******************/
#define  BKP_DT24_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT25 register  *******************/
#define  BKP_DT25_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT26 register  *******************/
#define  BKP_DT26_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT27 register  *******************/
#define  BKP_DT27_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT28 register  *******************/
#define  BKP_DT28_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT29 register  *******************/
#define  BKP_DT29_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT30 register  *******************/
#define  BKP_DT30_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT31 register  *******************/
#define  BKP_DT31_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT32 register  *******************/
#define  BKP_DT32_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT33 register  *******************/
#define  BKP_DT33_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT34 register  *******************/
#define  BKP_DT34_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT35 register  *******************/
#define  BKP_DT35_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT36 register  *******************/
#define  BKP_DT36_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT37 register  *******************/
#define  BKP_DT37_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT38 register  *******************/
#define  BKP_DT38_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT39 register  *******************/
#define  BKP_DT39_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT40 register  *******************/
#define  BKP_DT40_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT41 register  *******************/
#define  BKP_DT41_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/*******************  Bit definition for BKP_DT42 register  *******************/
#define  BKP_DT42_D                             ((uint16_t)0xFFFF)            /*!< Backup data */

/******************  Bit definition for BKP_RTCCAL register  *******************/
#define  BKP_RTCCAL_CAL                         ((uint16_t)0x007F)            /*!< Calibration value */
#define  BKP_RTCCAL_OT1CAL                      ((uint16_t)0x0080)            /*!< Calibration Clock Output */
#define  BKP_RTCCAL_OT2EN                       ((uint16_t)0x0100)            /*!< Alarm or Second Output Enable */
#define  BKP_RTCCAL_OT2SEL                      ((uint16_t)0x0200)            /*!< Alarm or Second Output Selection */

/********************  Bit definition for BKP_CTRL register  ********************/
#define  BKP_CTRL_TPEN                          ((uint8_t)0x01)               /*!< TAMPER pin enable */
#define  BKP_CTRL_TPALV                         ((uint8_t)0x02)               /*!< TAMPER pin active level */

/*******************  Bit definition for BKP_CTRLSTS register  ********************/
#define  BKP_CTRLSTS_CTPEF                      ((uint16_t)0x0001)            /*!< Clear Tamper event */
#define  BKP_CTRLSTS_CTPIF                      ((uint16_t)0x0002)            /*!< Clear Tamper Interrupt */
#define  BKP_CTRLSTS_TPIEN                      ((uint16_t)0x0004)            /*!< TAMPER Pin interrupt enable */
#define  BKP_CTRLSTS_TPEF                       ((uint16_t)0x0100)            /*!< Tamper Event Flag */
#define  BKP_CTRLSTS_TPIF                       ((uint16_t)0x0200)            /*!< Tamper Interrupt Flag */
#endif
/******************************************************************************/
/*                                                                            */
/*                         Reset and Clock Control                            */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for RCC_CTRL register  ********************/
#define  RCC_CTRL_HSIEN                         ((uint32_t)0x00000001)        /*!< Internal High Speed clock enable */
#define  RCC_CTRL_HSISTBL                       ((uint32_t)0x00000002)        /*!< Internal High Speed clock ready flag */
#if defined (AT32F403xx)
 #define  RCC_CTRL_HSITWK                       ((uint32_t)0x000000F8)        /*!< Internal High Speed clock trimming */
#else
 #define  RCC_CTRL_HSITWK                       ((uint32_t)0x000000FE)        /*!< Internal High Speed clock trimming */
#endif
#define  RCC_CTRL_HSICAL                        ((uint32_t)0x0000FF00)        /*!< Internal High Speed clock Calibration */
#define  RCC_CTRL_HSEEN                         ((uint32_t)0x00010000)        /*!< External High Speed clock enable */
#define  RCC_CTRL_HSESTBL                       ((uint32_t)0x00020000)        /*!< External High Speed clock ready flag */
#define  RCC_CTRL_HSEBYPS                       ((uint32_t)0x00040000)        /*!< External High Speed clock Bypass */
#define  RCC_CTRL_HSECFDEN                      ((uint32_t)0x00080000)        /*!< Clock Security System enable */
#define  RCC_CTRL_PLLEN                         ((uint32_t)0x01000000)        /*!< PLL enable */
#define  RCC_CTRL_PLLSTBL                       ((uint32_t)0x02000000)        /*!< PLL clock ready flag */

/*******************  Bit definition for RCC_CFG register  *******************/
/** SYSCLKSEL configuration */
#define  RCC_CFG_SYSCLKSEL                      ((uint32_t)0x00000003)        /*!< SYSCLKSEL[1:0] bits (System clock Switch) */
#define  RCC_CFG_SYSCLKSEL_0                    ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  RCC_CFG_SYSCLKSEL_1                    ((uint32_t)0x00000002)        /*!< Bit 1 */

