RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#if defined (AT32F415xx)
 #define  RCC_APB2RST_EFCBRST                   ((uint32_t)0x00800000)         /*!< EFCB reset */
#endif
/*****************  Bit definition for RCC_APB1RST register  *****************/
#define  RCC_APB1RST_TMR2RST                    ((uint32_t)0x00000001)        /*!< Timer 2 reset */
#define  RCC_APB1RST_TMR3RST                    ((uint32_t)0x00000002)        /*!< Timer 3 reset */
#define  RCC_APB1RST_WWDGRST                    ((uint32_t)0x00000800)        /*!< Window Watchdog reset */
#define  RCC_APB1RST_USART2RST                  ((uint32_t)0x00020000)        /*!< USART 2 reset */
#define  RCC_APB1RST_I2C1RST                    ((uint32_t)0x00200000)        /*!< I2C 1 reset */
#define  RCC_APB1RST_CAN1RST                    ((uint32_t)0x02000000)        /*!< CAN1 reset */
#define  RCC_APB1RST_PWRRST                     ((uint32_t)0x10000000)        /*!< Power interface reset */
#define  RCC_APB1RST_TMR4RST                    ((uint32_t)0x00000004)        /*!< Timer 4 reset */
#define  RCC_APB1RST_SPI2RST                    ((uint32_t)0x00004000)        /*!< SPI 2 reset */
#define  RCC_APB1RST_I2C2RST                    ((uint32_t)0x00400000)        /*!< I2C 2 reset */
#define  RCC_APB1RST_TMR5RST                    ((uint32_t)0x00000008)        /*!< Timer 5 reset */

#if !defined (AT32F415xx)
 #define  RCC_APB1RST_BKPRST                    ((uint32_t)0x08000000)        /*!< Backup interface reset */
 #define  RCC_APB1RST_USBRST                    ((uint32_t)0x00800000)        /*!< USB Device reset */
#endif

#if defined (AT32F415xx)
 #define  RCC_APB1RST_COMPRST                   ((uint32_t)0x00000200)        /*!< Compare reset */
#endif

#if defined (AT32F403Vx_HD) || defined (AT32F403Zx_HD) || \
    defined (AT32F403Vx_XL) || defined (AT32F403Zx_XL) || \
    defined (AT32F403Axx)   || defined (AT32F407xx)
 #define  RCC_APB1RST_SPI4RST                   ((uint32_t)0x00010000)        /*!< SPI 4 reset */
#endif /* AT32F403Vx_HD || AT32F403Zx_HD || AT32F403Vx_XL || AT32F403Zx_XL
          AT32F403Axx   || AT32F407xx */

#if !defined (AT32F413Kx_MD) && !defined (AT32F413Kx_HD) && \
    !defined (AT32F415K8U7_4)&& !defined (AT32F415KBU7_4)&& \
    !defined (AT32F415KCU7_4)
 #define  RCC_APB1RST_USART3RST                 ((uint32_t)0x00040000)        /*!< USART 3 reset */
#endif

#if !defined (AT32F413Kx_MD) && !defined (AT32F413Kx_HD) && \
    !defined (AT32F413Cx_MD) && !defined (AT32F413Cx_HD) && \
    !defined (AT32FEBKCx_MD) && !defined (TS32F401CBU7)  && \
    !defined (AT32F415K8U7_4)&& !defined (AT32F415KBU7_4)&& \
    !defined (AT32F415KCU7_4)&& !defined (AT32F415C8T7)  && \
    !defined (AT32F415CBT7)  && !defined (AT32F415CCT7)  && \
    !defined (AT32F415CBU7)  && !defined (AT32F415CCU7)
 #define  RCC_APB1RST_UART4RST                  ((uint32_t)0x00080000)        /*!< UART 4 reset */
 #define  RCC_APB1RST_UART5RST                  ((uint32_t)0x00100000)        /*!< UART 5 reset */
#endif

#if defined (AT32F413Cx_HD) || defined (AT32F413Cx_MD) || \
    defined (AT32F413Rx_HD) || defined (AT32F413Rx_MD) || \
    defined (TS32F401CBU7)
 #define  RCC_APB1RST_CAN2RST                   ((uint32_t)0x80000000)        /*!< CAN2 reset */
#elif defined (AT32F403Axx) || defined (AT32F407xx)
 #define  RCC_APB1RST_CAN2RST                   ((uint32_t)0x04000000)        /*!< CAN2 reset */
#endif

#if defined (AT32F403xx) || defined (AT32F403Axx) || \
    defined (AT32F407xx)
 #define  RCC_APB1RST_TMR6RST                   ((uint32_t)0x00000010)        /*!< Timer 6 reset */
 #define  RCC_APB1RST_TMR7RST                   ((uint32_t)0x00000020)        /*!< Timer 7 reset */
 #define  RCC_APB1RST_SPI3RST                   ((uint32_t)0x00008000)        /*!< SPI 3 reset */
 #define  RCC_APB1RST_I2C3RST                   ((uint32_t)0x04000000)        /*!< I2C 3 reset */
 #define  RCC_APB1RST_TMR12RST                  ((uint32_t)0x00000040)        /*!< TMR12 Timer reset */
 #define  RCC_APB1RST_TMR13RST                  ((uint32_t)0x00000080)        /*!< TMR13 Timer reset */
 #define  RCC_APB1RST_TMR14RST                  ((uint32_t)0x00000100)        /*!< TMR14 Timer reset */
 #define  RCC_APB1RST_DACRST                    ((uint32_t)0x20000000)        /*!< DAC interface reset */
#endif

/******************  Bit definition for RCC_AHBEN register  ******************/
#define  RCC_AHBEN_DMA1EN                       ((uint16_t)0x0001)            /*!< DMA1 clock enable */
#define  RCC_AHBEN_DMA2EN                       ((uint16_t)0x0002)            /*!< DMA2 clock enable */
#define  RCC_AHBEN_SRAMEN                       ((uint16_t)0x0004)            /*!< SRAM interface clock enable */
#define  RCC_AHBEN_FLASHEN                      ((uint16_t)0x0010)            /*!< FLITF clock enable */
#define  RCC_AHBEN_CRCEN                        ((uint16_t)0x0040)            /*!< CRC clock enable */

#if !defined (AT32FEBKCx_MD) && !defined (AT32F403Cx_HD) && \
    !defined (AT32F403Cx_MD) && !defined (AT32F403Cx_XL) && \
    !defined (AT32F403ACCT7) && !defined (AT32F403ACCU7) && \
    !defined (AT32F403ACET7) && !defined (AT32F403ACEU7) && \
    !defined (AT32F403ACGT7) && !defined (AT32F403ACGU7)
 #define  RCC_AHBEN_SDIO1EN                     ((uint16_t)0x0400)            /*!< SDIO1 clock enable */
#endif

#if defined (AT32F403Vx_HD) || defined (AT32F403Zx_HD) || \
    defined (AT32F403Vx_XL) || defined (AT32F403Zx_XL) || \
    defined (AT32F403ARCT7) || defined (AT32F403ARGT7) || \
    defined (AT32F403ARET7) || defined (AT32F403AVET7) || \
    defined (AT32F403AVCT7) || defined (AT32F403AVGT7) || \
    defined (AT32F407xx)
 #define  RCC_AHBEN_XMCEN                       ((uint16_t)0x0100)            /*!< XMC clock enable */
#endif /* AT32F403Vx_HD || AT32F403Zx_HD || AT32F403Vx_XL ||
          AT32F403Zx_XL || AT32F403ARCT7 || AT32F403ARGT7 ||
          AT32F403AVCT7 || AT32F403AVGT7 || AT32F403ARET7 ||
          AT32F403AVET7 || AT32F407xx */

#if defined (AT32F403Vx_HD) || defined (AT32F403Vx_XL) || \
    defined (AT32F403Zx_HD) || defined (AT32F403Zx_XL) || \
    defined (AT32F403Rx_HD) || defined (AT32F403Rx_XL) || \
    defined (AT32F403Axx)   || defined (AT32F407xx)
 #define  RCC_AHBEN_SDIO2EN                     ((uint16_t)0x0800)            /*!< SDIO2 clock enable */
#endif

