RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#if defined (AT32F415xx)
 #define  RCC_AHBEN_USBEN                       ((uint16_t)0x1000)            /*!< USB clock enable */
#endif

#if defined (AT32F403Axx) || defined (AT32F407xx)
 #define  RCC_AHBEN_ETHMACEN                    ((uint16_t)0x00004000)        /*!< ETHMAC clock enable */
 #define  RCC_AHBEN_ETHMACTXEN                  ((uint16_t)0x00008000)        /*!< ETHMACTX clock enable */
 #define  RCC_AHBEN_ETHMACRXEN                  ((uint16_t)0x00010000)        /*!< ETHMACRX clock enable */
 #define  RCC_AHBEN_ETHMACPTPEN                 ((uint16_t)0x10000000)        /*!< ETHMACPTP clock enable */
#endif

/******************  Bit definition for RCC_APB2EN register  *****************/
#define  RCC_APB2EN_AFIOEN                      ((uint32_t)0x00000001)        /*!< Alternate Function I/O clock enable */
#define  RCC_APB2EN_GPIOAEN                     ((uint32_t)0x00000004)        /*!< I/O port A clock enable */
#define  RCC_APB2EN_GPIOBEN                     ((uint32_t)0x00000008)        /*!< I/O port B clock enable */
#define  RCC_APB2EN_GPIOCEN                     ((uint32_t)0x00000010)        /*!< I/O port C clock enable */
#define  RCC_APB2EN_GPIODEN                     ((uint32_t)0x00000020)        /*!< I/O port D clock enable */
#define  RCC_APB2EN_ADC1EN                      ((uint32_t)0x00000200)        /*!< ADC 1 interface clock enable */
#define  RCC_APB2EN_TMR1EN                      ((uint32_t)0x00000800)        /*!< TMR1 Timer clock enable */
#define  RCC_APB2EN_SPI1EN                      ((uint32_t)0x00001000)        /*!< SPI 1 clock enable */
#define  RCC_APB2EN_USART1EN                    ((uint32_t)0x00004000)        /*!< USART1 clock enable */

#if !defined (AT32F415xx)
 #define  RCC_APB2EN_ADC2EN                     ((uint32_t)0x00000400)        /*!< ADC 2 interface clock enable */
#endif

#if !defined (AT32F413Kx_MD) && !defined (AT32F413Kx_HD) && \
    !defined (AT32F413Cx_MD) && !defined (AT32F413Rx_MD) && \
    !defined (AT32FEBKCx_MD) && !defined (TS32F401CBU7)  && \
    !defined (AT32F415xx)
 #define  RCC_APB2EN_TMR8EN                     ((uint32_t)0x00002000)        /*!< TMR8 Timer clock enable */
#endif

#define  RCC_APB2EN_GPIOFEN                     ((uint32_t)0x00000080)        /*!< I/O port F clock enable */

#if !defined (AT32FEBKCx_MD)
 #define  RCC_APB2EN_TMR9EN                     ((uint32_t)0x00080000)        /*!< TMR9 Timer clock enable  */
 #define  RCC_APB2EN_TMR10EN                    ((uint32_t)0x00100000)        /*!< TMR10 Timer clock enable  */
 #define  RCC_APB2EN_TMR11EN                    ((uint32_t)0x00200000)        /*!< TMR11 Timer clock enable */
#endif

#if defined (AT32F403xx)
 #define  RCC_APB2EN_GPIOEEN                    ((uint32_t)0x00000040)        /*!< I/O port E clock enable */
 #define  RCC_APB2EN_GPIOGEN                    ((uint32_t)0x00000100)        /*!< I/O port G clock enable */
 #define  RCC_APB2EN_ADC3EN                     ((uint32_t)0x00008000)        /*!< DMA1 clock enable */
 #define  RCC_APB2EN_TMR15EN                    ((uint32_t)0x00010000)        /*!< TMR15 Timer clock enable */
#elif defined (AT32F403Axx) || defined (AT32F407xx)
 #define  RCC_APB2EN_GPIOEEN                    ((uint32_t)0x00000040)        /*!< I/O port E clock enable */
 #define  RCC_APB2EN_ADC3EN                     ((uint32_t)0x00008000)        /*!< ADC3 interface clock enable */
 #define  RCC_APB2EN_I2C3EN                     ((uint32_t)0x00800000)        /*!< I2C3 interface clock enable */
 #define  RCC_APB2EN_USART6EN                   ((uint32_t)0x01000000)        /*!< USART6 interface clock enable */
 #define  RCC_APB2EN_UART7EN                    ((uint32_t)0x02000000)        /*!< UART7 interface clock enable */
 #define  RCC_APB2EN_UART8EN                    ((uint32_t)0x04000000)        /*!< UART8 interface clock enable */
#endif

#if !defined (AT32F403xx)
 #if !defined (AT32FEBKCx_MD)
  #define  RCC_APB2EN_ACCEN                     ((uint32_t)0x00400000)        /*!< ACC enable */
 #endif
#endif

#if defined (AT32F415xx)
 #define  RCC_APB2EN_EFCBEN                     ((uint32_t)0x00800000)        /*!< EFCB enable */
#endif

/*****************  Bit definition for RCC_APB1EN register  ******************/
#define  RCC_APB1EN_TMR2EN                      ((uint32_t)0x00000001)        /*!< Timer 2 clock enabled*/
#define  RCC_APB1EN_TMR3EN                      ((uint32_t)0x00000002)        /*!< Timer 3 clock enable */
#define  RCC_APB1EN_WWDGEN                      ((uint32_t)0x00000800)        /*!< Window Watchdog clock enable */
#define  RCC_APB1EN_USART2EN                    ((uint32_t)0x00020000)        /*!< USART 2 clock enable */
#define  RCC_APB1EN_I2C1EN                      ((uint32_t)0x00200000)        /*!< I2C 1 clock enable */
#define  RCC_APB1EN_CAN1EN                      ((uint32_t)0x02000000)        /*!< CAN1 clock enable */
#define  RCC_APB1EN_PWREN                       ((uint32_t)0x10000000)        /*!< Power interface clock enable */
#define  RCC_APB1EN_TMR4EN                      ((uint32_t)0x00000004)        /*!< Timer 4 clock enable */
#define  RCC_APB1EN_SPI2EN                      ((uint32_t)0x00004000)        /*!< SPI 2 clock enable */
#define  RCC_APB1EN_I2C2EN                      ((uint32_t)0x00400000)        /*!< I2C 2 clock enable */
#define  RCC_APB1EN_TMR5EN                      ((uint32_t)0x00000008)        /*!< Timer 5 clock enable */

#if !defined (AT32F415xx)
 #define  RCC_APB1EN_BKPEN                      ((uint32_t)0x08000000)        /*!< Backup interface clock enable */
 #define  RCC_APB1EN_USBEN                      ((uint32_t)0x00800000)        /*!< USB Device clock enable */
#endif

#if defined (AT32F415xx)
 #define  RCC_APB1EN_COMPEN                     ((uint32_t)0x00000200)        /*!< Compare enable */
#endif

#if defined (AT32F403Vx_HD) || defined (AT32F403Zx_HD) || \
    defined (AT32F403Vx_XL) || defined (AT32F403Zx_XL) || \
    defined (AT32F403Axx)   || defined (AT32F407xx)
 #define  RCC_APB1EN_SPI4EN                     ((uint32_t)0x00010000)        /*!< SPI 4 clock enable */
#endif /* AT32F403Vx_HD || AT32F403Zx_HD || AT32F403Vx_XL || AT32F403Zx_XL
          AT32F403Axx   || AT32F407xx */

#if !defined (AT32F413Kx_MD) && !defined (AT32F413Kx_HD) && \
    !defined (AT32F415K8U7_4)&& !defined (AT32F415KBU7_4)&& \
    !defined (AT32F415KCU7_4)
 #define  RCC_APB1EN_USART3EN                   ((uint32_t)0x00040000)        /*!< USART 3 clock enable */
#endif

#if !defined (AT32F413Kx_MD) && !defined (AT32F413Kx_HD) && \
    !defined (AT32F413Cx_MD) && !defined (AT32F413Cx_HD) && \
    !defined (AT32FEBKCx_MD) && !defined (TS32F401CBU7)  && \
    !defined (AT32F415K8U7_4)&& !defined (AT32F415KBU7_4)&& \
    !defined (AT32F415KCU7_4)&& !defined (AT32F415C8T7)  && \
    !defined (AT32F415CBT7)  && !defined (AT32F415CCT7)  && \
    !defined (AT32F415CBU7)  && !defined (AT32F415CCU7)
 #define  RCC_APB1EN_UART4EN                    ((uint32_t)0x00080000)        /*!< UART 4 clock enable */
 #define  RCC_APB1EN_UART5EN                    ((uint32_t)0x00100000)        /*!< UART 5 clock enable */
#endif

