RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#if defined (AT32F413Cx_HD) || defined (AT32F413Cx_MD) || \
    defined (AT32F413Rx_HD) || defined (AT32F413Rx_MD) || \
    defined (TS32F401CBU7)
 #define  RCC_APB1EN_CAN2EN                     ((uint32_t)0x80000000)        /*!< CAN2 enable */
#elif defined (AT32F403Axx) || defined (AT32F407xx)
 #define  RCC_APB1EN_CAN2EN                     ((uint32_t)0x04000000)        /*!< CAN2 enable */
#endif

#if defined (AT32F403xx) || defined (AT32F403Axx) || \
    defined (AT32F407xx)
 #define  RCC_APB1EN_TMR6EN                     ((uint32_t)0x00000010)        /*!< Timer 6 clock enable */
 #define  RCC_APB1EN_TMR7EN                     ((uint32_t)0x00000020)        /*!< Timer 7 clock enable */
 #define  RCC_APB1EN_SPI3EN                     ((uint32_t)0x00008000)        /*!< SPI 3 clock enable */
 #define  RCC_APB1EN_I2C3EN                     ((uint32_t)0x04000000)        /*!< I2C 3 clock enable */
 #define  RCC_APB1EN_TMR12EN                    ((uint32_t)0x00000040)        /*!< TMR12 Timer clock enable  */
 #define  RCC_APB1EN_TMR13EN                    ((uint32_t)0x00000080)        /*!< TMR13 Timer clock enable  */
 #define  RCC_APB1EN_TMR14EN                    ((uint32_t)0x00000100)        /*!< TMR14 Timer clock enable */
 #define  RCC_APB1EN_DACEN                      ((uint32_t)0x20000000)        /*!< DAC interface clock enable */
#endif

/*******************  Bit definition for RCC_BDC register  *******************/
#if !defined (AT32F415xx)
 #define  RCC_BDC_LSEEN                         ((uint32_t)0x00000001)        /*!< External Low Speed oscillator enable */
 #define  RCC_BDC_LSESTBL                       ((uint32_t)0x00000002)        /*!< External Low Speed oscillator Ready */
 #define  RCC_BDC_LSEBYPS                       ((uint32_t)0x00000004)        /*!< External Low Speed oscillator Bypass */

 #define  RCC_BDC_RTCSEL                        ((uint32_t)0x00000300)        /*!< RTCSEL[1:0] bits (RTC clock source selection) */
 #define  RCC_BDC_RTCSEL_0                      ((uint32_t)0x00000100)        /*!< Bit 0 */
 #define  RCC_BDC_RTCSEL_1                      ((uint32_t)0x00000200)        /*!< Bit 1 */

 /** RTC congiguration */
 #define  RCC_BDC_RTCSEL_NOCLK                  ((uint32_t)0x00000000)        /*!< No clock */
 #define  RCC_BDC_RTCSEL_LSE                    ((uint32_t)0x00000100)        /*!< LSE oscillator clock used as RTC clock */
 #define  RCC_BDC_RTCSEL_LSI                    ((uint32_t)0x00000200)        /*!< LSI oscillator clock used as RTC clock */
 #define  RCC_BDC_RTCSEL_HSE_DIV128             ((uint32_t)0x00000300)        /*!< HSE oscillator clock divided by 128 used as RTC clock */

 #define  RCC_BDC_RTCEN                         ((uint32_t)0x00008000)        /*!< RTC clock enable */
 #define  RCC_BDC_BDRST                         ((uint32_t)0x00010000)        /*!< Backup domain software reset  */
#else
 #define  RCC_BDC_LSEEN                         ((uint32_t)0x00000001)        /*!< External Low Speed oscillator enable */
 #define  RCC_BDC_LSESTBL                       ((uint32_t)0x00000002)        /*!< External Low Speed oscillator Ready */
 #define  RCC_BDC_LSEBYPS                       ((uint32_t)0x00000004)        /*!< External Low Speed oscillator Bypass */

 #define  RCC_BDC_ERTCSEL                       ((uint32_t)0x00000300)        /*!< ERTCSEL[1:0] bits (ERTC clock source selection) */
 #define  RCC_BDC_ERTCSEL_0                     ((uint32_t)0x00000100)        /*!< Bit 0 */
 #define  RCC_BDC_ERTCSEL_1                     ((uint32_t)0x00000200)        /*!< Bit 1 */

 /** ERTC congiguration */
 #define  RCC_BDC_ERTCSEL_NOCLK                 ((uint32_t)0x00000000)        /*!< No clock */
 #define  RCC_BDC_ERTCSEL_LSE                   ((uint32_t)0x00000100)        /*!< LSE oscillator clock used as ERTC clock */
 #define  RCC_BDC_ERTCSEL_LSI                   ((uint32_t)0x00000200)        /*!< LSI oscillator clock used as ERTC clock */
 #define  RCC_BDC_ERTCSEL_HSE_DIV128            ((uint32_t)0x00000300)        /*!< HSE oscillator clock divided by 128 used as ERTC clock */

 #define  RCC_BDC_ERTCEN                        ((uint32_t)0x00008000)        /*!< ERTC clock enable */
 #define  RCC_BDC_BDRST                         ((uint32_t)0x00010000)        /*!< Backup domain software reset  */
#endif
/*******************  Bit definition for RCC_CTRLSTS register  ********************/
#define  RCC_CTRLSTS_LSIEN                      ((uint32_t)0x00000001)        /*!< Internal Low Speed oscillator enable */
#define  RCC_CTRLSTS_LSISTBL                    ((uint32_t)0x00000002)        /*!< Internal Low Speed oscillator Ready */
#define  RCC_CTRLSTS_RSTFC                      ((uint32_t)0x01000000)        /*!< Remove reset flag */
#define  RCC_CTRLSTS_PINRSTF                    ((uint32_t)0x04000000)        /*!< PIN reset flag */
#define  RCC_CTRLSTS_PORSTF                     ((uint32_t)0x08000000)        /*!< POR/PDR reset flag */
#define  RCC_CTRLSTS_SWRSTF                     ((uint32_t)0x10000000)        /*!< Software Reset flag */
#define  RCC_CTRLSTS_IWDGRSTF                   ((uint32_t)0x20000000)        /*!< Independent Watchdog reset flag */
#define  RCC_CTRLSTS_WWDGRSTF                   ((uint32_t)0x40000000)        /*!< Window watchdog reset flag */
#define  RCC_CTRLSTS_LPRSTF                     ((uint32_t)0x80000000)        /*!< Low-Power reset flag */

/*******************  Bit definition for RCC_AHBRST register  ********************/
#if defined (AT32F415xx)
 #define  RCC_AHBRST_USBRST                     ((uint32_t)0x00001000)        /*!< USB reset */
#endif /* AT32F415xx */

#if defined (AT32F403Axx) || defined (AT32F407xx)
 #define  RCC_AHBRST_ETHMACRST                  ((uint32_t)0x00004000)        /*!< ETHMAC reset */
#endif /* AT32F43Axx || AT32F407 */

/*******************  Bit definition for RCC_PLL register  ********************/
#if defined (AT32F415xx)
 #define  RCC_PLL_PLLFR                         ((uint32_t)0x00000007)        /*!< PLL FR Configuration Value */
 #define  RCC_PLL_PLLFR_0                       ((uint32_t)0x00000000)        /*!< PLL FR Configuration VCO */
 #define  RCC_PLL_PLLFR_2                       ((uint32_t)0x00000001)        /*!< PLL FR Configuration VCO/2 */
 #define  RCC_PLL_PLLFR_4                       ((uint32_t)0x00000002)        /*!< PLL FR Configuration VCO/4 */
 #define  RCC_PLL_PLLFR_8                       ((uint32_t)0x00000003)        /*!< PLL FR Configuration VCO/8 */
 #define  RCC_PLL_PLLFR_16                      ((uint32_t)0x00000004)        /*!< PLL FR Configuration VCO/16 */
 #define  RCC_PLL_PLLFR_32                      ((uint32_t)0x00000005)        /*!< PLL FR Configuration VCO/32 */
 #define  RCC_PLL_PLLMS                         ((uint32_t)0x000000F0)        /*!< PLL MS Configuration Value */
 #define  RCC_PLL_PLLNS                         ((uint32_t)0x0001FF00)        /*!< PLL NS Configuration Value */
 #define  RCC_PLL_PLLFREF                       ((uint32_t)0x07000000)        /*!< PLL FREF Configuration Table */
 #define  RCC_PLL_PLLFREF_4M                    ((uint32_t)0x00000000)        /*!< PLL FREF Configuration Table */
 #define  RCC_PLL_PLLFREF_6M                    ((uint32_t)0x01000000)        /*!< PLL FREF Configuration Table */
 #define  RCC_PLL_PLLFREF_8M                    ((uint32_t)0x02000000)        /*!< PLL FREF Configuration Table */
 #define  RCC_PLL_PLLFREF_12M                   ((uint32_t)0x03000000)        /*!< PLL FREF Configuration Table */
 #define  RCC_PLL_PLLFREF_16M                   ((uint32_t)0x04000000)        /*!< PLL FREF Configuration Table */
 #define  RCC_PLL_PLLFREF_25M                   ((uint32_t)0x05000000)        /*!< PLL FREF Configuration Table */
 #define  RCC_PLL_PLLCFGEN                      ((uint32_t)0x80000000)        /*!< PLL CFGEN Configuration enable */
#endif /* AT32F415xx */

/*******************  Bit definition for RCC_MISC register  ********************/
#define  RCC_MISC_HSICAL_KEY                    ((uint32_t)0x000000FF)        /*!< HSICAL KEY */
#define  RCC_MISC_CLKOUT_3                      ((uint32_t)0x00010000)        /*!< CLKOUT Bit 3 */

#if defined (AT32F403xx) || defined (AT32F413xx)  || \
    defined (AT32F403Axx)|| defined (AT32F407xx)
 #define  RCC_MISC_USB768B                      ((uint32_t)0x01000000)        /*!< USB SRAM size */
#endif /* AT32F403xx | AT32F413xx | AT32F403Axx | AT32F407xx */

