RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#if defined (AT32F413xx) || defined (AT32F403Axx) || \
    defined (AT32F407xx)
#define  RCC_MISC_DIV_EN                        ((uint32_t)0x20000000)        /*!< HSI48 Div 6 enable */
#endif /* AT32F413xx | AT32F403Axx | AT32F407xx */

#if !defined (AT32F403xx)
 #define  RCC_MISC_HSI_DIV_EN                   ((uint32_t)0x02000000)        /*!< HSI DIV enable */
 #define  RCC_MISC_MCOPRE_MASK                  ((uint32_t)0xF0000000)        /*!< MCO Divider Mask Value */
 #define  RCC_MISC_MCOPRE_1                     ((uint32_t)0x10000000)        /*!< MCO Div 1 Configure */
 #define  RCC_MISC_MCOPRE_2                     ((uint32_t)0x80000000)        /*!< MCO Div 2 Configure */
 #define  RCC_MISC_MCOPRE_4                     ((uint32_t)0x90000000)        /*!< MCO Div 4 Configure */
 #define  RCC_MISC_MCOPRE_8                     ((uint32_t)0xA0000000)        /*!< MCO Div 8 Configure */
 #define  RCC_MISC_MCOPRE_16                    ((uint32_t)0xB0000000)        /*!< MCO Div 16 Configure */
 #define  RCC_MISC_MCOPRE_64                    ((uint32_t)0xC0000000)        /*!< MCO Div 64 Configure */
 #define  RCC_MISC_MCOPRE_128                   ((uint32_t)0xD0000000)        /*!< MCO Div 128 Configure */
 #define  RCC_MISC_MCOPRE_256                   ((uint32_t)0xE0000000)        /*!< MCO Div 256 Configure */
 #define  RCC_MISC_MCOPRE_512                   ((uint32_t)0xF0000000)        /*!< MCO Div 512 Configure */
#endif /* !AT32F403xx */

/*******************  Bit definition for RCC_TEST register  ********************/
#define  RCC_TEST_MCO2TMR_EN                    ((uint32_t)0x00010000)        /*!< CLKOUT to TMR10 Ch 0 */

/*******************  Bit definition for RCC_MISC2 register  *******************/
#define  RCC_MISC2_AUTO_STEP_EN                 ((uint32_t)0x00000030)        /*!< Auto Step Mode */
#define  RCC_MISC2_HSI_FOR_USB                  ((uint32_t)0x00000100)        /*!< HSI48 for USB */
#define  RCC_MISC2_HSI_SYS_CTRL                 ((uint32_t)0x00000200)        /*!< HSI48 for SYSCLK */

#define  RCC_MISC2_HSE_DIV_CTRL                 ((uint32_t)0x00003000)        /*!< HSE Div */
#define  RCC_MISC2_HSE_DIV_CTRL_2               ((uint32_t)0x00000000)        /*!< HSE Div 2 */
#define  RCC_MISC2_HSE_DIV_CTRL_3               ((uint32_t)0x00001000)        /*!< HSE Div 3 */
#define  RCC_MISC2_HSE_DIV_CTRL_4               ((uint32_t)0x00002000)        /*!< HSE Div 4 */
#define  RCC_MISC2_HSE_DIV_CTRL_5               ((uint32_t)0x00003000)        /*!< HSE Div 5 */

/*****************  Bit definition for RCC_INTCTRL register  *******************/
#define  RCC_INTCTRL_USB_INT_CTRL               ((uint32_t)0x00000001)        /*!< USB interrupt remap */

/******************************************************************************/
/*                                                                            */
/*                General Purpose and Alternate Function I/O                  */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for GPIO_CTRLL register  *******************/
#define  GPIO_CTRLL_MDE                         ((uint32_t)0x33333333)        /*!< Port x mode bits */

#define  GPIO_CTRLL_MDE0                        ((uint32_t)0x00000003)        /*!< MODE0[1:0] bits (Port x mode bits, pin 0) */
#define  GPIO_CTRLL_MDE0_0                      ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  GPIO_CTRLL_MDE0_1                      ((uint32_t)0x00000002)        /*!< Bit 1 */

#define  GPIO_CTRLL_MDE1                        ((uint32_t)0x00000030)        /*!< MODE1[1:0] bits (Port x mode bits, pin 1) */
#define  GPIO_CTRLL_MDE1_0                      ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  GPIO_CTRLL_MDE1_1                      ((uint32_t)0x00000020)        /*!< Bit 1 */

#define  GPIO_CTRLL_MDE2                        ((uint32_t)0x00000300)        /*!< MODE2[1:0] bits (Port x mode bits, pin 2) */
#define  GPIO_CTRLL_MDE2_0                      ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  GPIO_CTRLL_MDE2_1                      ((uint32_t)0x00000200)        /*!< Bit 1 */

#define  GPIO_CTRLL_MDE3                        ((uint32_t)0x00003000)        /*!< MODE3[1:0] bits (Port x mode bits, pin 3) */
#define  GPIO_CTRLL_MDE3_0                      ((uint32_t)0x00001000)        /*!< Bit 0 */
#define  GPIO_CTRLL_MDE3_1                      ((uint32_t)0x00002000)        /*!< Bit 1 */

#define  GPIO_CTRLL_MDE4                        ((uint32_t)0x00030000)        /*!< MODE4[1:0] bits (Port x mode bits, pin 4) */
#define  GPIO_CTRLL_MDE4_0                      ((uint32_t)0x00010000)        /*!< Bit 0 */
#define  GPIO_CTRLL_MDE4_1                      ((uint32_t)0x00020000)        /*!< Bit 1 */

#define  GPIO_CTRLL_MDE5                        ((uint32_t)0x00300000)        /*!< MODE5[1:0] bits (Port x mode bits, pin 5) */
#define  GPIO_CTRLL_MDE5_0                      ((uint32_t)0x00100000)        /*!< Bit 0 */
#define  GPIO_CTRLL_MDE5_1                      ((uint32_t)0x00200000)        /*!< Bit 1 */

#define  GPIO_CTRLL_MDE6                        ((uint32_t)0x03000000)        /*!< MODE6[1:0] bits (Port x mode bits, pin 6) */
#define  GPIO_CTRLL_MDE6_0                      ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  GPIO_CTRLL_MDE6_1                      ((uint32_t)0x02000000)        /*!< Bit 1 */

#define  GPIO_CTRLL_MDE7                        ((uint32_t)0x30000000)        /*!< MODE7[1:0] bits (Port x mode bits, pin 7) */
#define  GPIO_CTRLL_MDE7_0                      ((uint32_t)0x10000000)        /*!< Bit 0 */
#define  GPIO_CTRLL_MDE7_1                      ((uint32_t)0x20000000)        /*!< Bit 1 */

#define  GPIO_CTRLL_CONF                        ((uint32_t)0xCCCCCCCC)        /*!< Port x configuration bits */

#define  GPIO_CTRLL_CONF0                       ((uint32_t)0x0000000C)        /*!< CNF0[1:0] bits (Port x configuration bits, pin 0) */
#define  GPIO_CTRLL_CONF0_0                     ((uint32_t)0x00000004)        /*!< Bit 0 */
#define  GPIO_CTRLL_CONF0_1                     ((uint32_t)0x00000008)        /*!< Bit 1 */

