RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/******************  Bit definition for AFIO_MAP4 register  ******************/
#define AFIO_MAP4_TMR1_GRMP                     ((uint32_t)0x00000001)        /*!< TMR1 Alternate Function mapping */
#define AFIO_MAP4_TMR2_GRMP_01                  ((uint32_t)0x00000010)        /*!< TMR2 Alternate Function mapping 0001*/
#define AFIO_MAP4_TMR2_GRMP_10                  ((uint32_t)0x00000020)        /*!< TMR2 Alternate Function mapping 0010*/
#define AFIO_MAP4_TMR2_GRMP_11                  ((uint32_t)0x00000030)        /*!< TMR2 Alternate Function mapping 0011*/
#define AFIO_MAP4_TMR3_GRMP_10                  ((uint32_t)0x00000200)        /*!< TMR3 Alternate Function mapping 0010*/
#define AFIO_MAP4_TMR3_GRMP_11                  ((uint32_t)0x00000300)        /*!< TMR3 Alternate Function mapping 0011*/
#define AFIO_MAP4_TMR5_GRMP                     ((uint32_t)0x00010000)        /*!< TMR5 Alternate Function mapping : CH1/CH2*/
#define AFIO_MAP4_TMR5CH4_INTLRE                ((uint32_t)0x00080000)        /*!< TMR5 Channel4 Internal Remap */

/******************  Bit definition for AFIO_MAP5 register  ******************/
#define AFIO_MAP5_I2C1_GRMP_01                  ((uint32_t)0x00000010)        /*!< I2C1 Alternate Function mapping 0001*/
#define AFIO_MAP5_I2C1_GRMP_11                  ((uint32_t)0x00000030)        /*!< I2C1 Alternate Function mapping 0011*/
#define AFIO_MAP5_I2C2_GRMP_01                  ((uint32_t)0x00000100)        /*!< I2C2 Alternate Function mapping 0001*/
#define AFIO_MAP5_I2C2_GRMP_10                  ((uint32_t)0x00000200)        /*!< I2C2 Alternate Function mapping 0010*/
#define AFIO_MAP5_I2C2_GRMP_11                  ((uint32_t)0x00000300)        /*!< I2C2 Alternate Function mapping 0011*/
#define AFIO_MAP5_SPI1_GRMP                     ((uint32_t)0x00010000)        /*!< SPI1 Alternate Function mapping */
#define AFIO_MAP5_SPI2_GRMP                     ((uint32_t)0x00100000)        /*!< SPI2 Alternate Function mapping */

/******************  Bit definition for AFIO_MAP6 register  ******************/
#define AFIO_MAP6_CAN1_GRMP                     ((uint32_t)0x00000002)        /*!< CAN1 Alternate Function mapping */
#define AFIO_MAP6_CAN2_GRMP                     ((uint32_t)0x00000010)        /*!< CAN2 Alternate Function mapping */
#define AFIO_MAP6_SDIO_GRMP_100                 ((uint32_t)0x00000400)        /*!< SDIO Alternate Function mapping 100 */
#define AFIO_MAP6_SDIO_GRMP_101                 ((uint32_t)0x00000500)        /*!< SDIO Alternate Function mapping 101 */
#define AFIO_MAP6_SDIO_GRMP_110                 ((uint32_t)0x00000600)        /*!< SDIO Alternate Function mapping 110 */
#define AFIO_MAP6_SDIO_GRMP_111                 ((uint32_t)0x00000700)        /*!< SDIO Alternate Function mapping 111 */
#define AFIO_MAP6_USART1_GRMP                   ((uint32_t)0x00010000)        /*!< USART1 Alternate Function mapping */
#define AFIO_MAP6_USART3_GRMP                   ((uint32_t)0x01000000)        /*!< USART3 Partial Alternate Function mapping */
#define AFIO_MAP6_UART4_GRMP                    ((uint32_t)0x10000000)        /*!< UART4 Alternate Function mapping */

/******************  Bit definition for AFIO_MAP7 register  ******************/
#define AFIO_MAP7_SPIF_GRMP_1000                ((uint32_t)0x00000008)        /*!< EXT_FLASH Alternate Function mapping */
#define AFIO_MAP7_SPIF_GRMP_1001                ((uint32_t)0x00000009)        /*!< EXT_FLASH Alternate Function enable */
#define AFIO_MAP7_ADC1_GRMP_01                  ((uint32_t)0x00000010)        /*!< ADC1 External Trigger Injected Conversion remapping */
#define AFIO_MAP7_ADC1_GRMP_10                  ((uint32_t)0x00000020)        /*!< ADC1 External Trigger Regular Conversion remapping */
#define AFIO_MAP7_ADC1_GRMP_11                  ((uint32_t)0x00000030)        /*!< ADC1 External Trigger Regular & Injected Conversion remapping */
#define AFIO_MAP7_ADC2_GRMP_01                  ((uint32_t)0x00000100)        /*!< ADC2 External Trigger Injected Conversion remapping */
#define AFIO_MAP7_ADC2_GRMP_10                  ((uint32_t)0x00000200)        /*!< ADC2 External Trigger Regular Conversion remapping */
#define AFIO_MAP7_ADC2_GRMP_11                  ((uint32_t)0x00000300)        /*!< ADC2 External Trigger Regular & Injected Conversion remapping */
#define AFIO_MAP7_SWJTAG_GRMP_001               ((uint32_t)0x00010000)        /*!< Full SWJ Enabled (JTAG-DP + SW-DP) but without JTRST */
#define AFIO_MAP7_SWJTAG_GRMP_010               ((uint32_t)0x00020000)        /*!< JTAG-DP Disabled and SW-DP Enabled */
#define AFIO_MAP7_SWJTAG_GRMP_100               ((uint32_t)0x00040000)        /*!< Full SWJ Disabled (JTAG-DP + SW-DP) */
#define AFIO_MAP7_PD01_GRMP                     ((uint32_t)0x00100000)        /*!< PD01 Alternate Function mapping */


/******************************************************************************/
/*                                                                            */
/*                               SystemTick                                   */
/*                                                                            */
/******************************************************************************/

/*****************  Bit definition for SysTick_CTRL register  *****************/
#define  SysTick_CTRL_ENABLE                    ((uint32_t)0x00000001)        /*!< Counter enable */
#define  SysTick_CTRL_TICKINT                   ((uint32_t)0x00000002)        /*!< Counting down to 0 pends the SysTick handler */
#define  SysTick_CTRL_CLKSOURCE                 ((uint32_t)0x00000004)        /*!< Clock source */
#define  SysTick_CTRL_COUNTFLAG                 ((uint32_t)0x00010000)        /*!< Count Flag */

/*****************  Bit definition for SysTick_LOAD register  *****************/
#define  SysTick_LOAD_RELOAD                    ((uint32_t)0x00FFFFFF)        /*!< Value to load into the SysTick Current Value Register when the counter reaches 0 */

/*****************  Bit definition for SysTick_VAL register  ******************/
#define  SysTick_VAL_CURRENT                    ((uint32_t)0x00FFFFFF)        /*!< Current value at the time the register is accessed */

/*****************  Bit definition for SysTick_CALIB register  ****************/
#define  SysTick_CALIB_TENMS                    ((uint32_t)0x00FFFFFF)        /*!< Reload value to use for 10ms timing */
#define  SysTick_CALIB_SKEW                     ((uint32_t)0x40000000)        /*!< Calibration value is not exactly 10 ms */
#define  SysTick_CALIB_NOREF                    ((uint32_t)0x80000000)        /*!< The reference clock is not provided */

/******************************************************************************/
/*                                                                            */
/*                  Nested Vectored Interrupt Controller                      */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for NVIC_ISER register  *******************/
#define  NVIC_ISER_SETENA                       ((uint32_t)0xFFFFFFFF)        /*!< Interrupt set enable bits */
#define  NVIC_ISER_SETENA_0                     ((uint32_t)0x00000001)        /*!< bit 0 */
#define  NVIC_ISER_SETENA_1                     ((uint32_t)0x00000002)        /*!< bit 1 */
#define  NVIC_ISER_SETENA_2                     ((uint32_t)0x00000004)        /*!< bit 2 */
#define  NVIC_ISER_SETENA_3                     ((uint32_t)0x00000008)        /*!< bit 3 */
#define  NVIC_ISER_SETENA_4                     ((uint32_t)0x00000010)        /*!< bit 4 */
#define  NVIC_ISER_SETENA_5                     ((uint32_t)0x00000020)        /*!< bit 5 */
#define  NVIC_ISER_SETENA_6                     ((uint32_t)0x00000040)        /*!< bit 6 */
#define  NVIC_ISER_SETENA_7                     ((uint32_t)0x00000080)        /*!< bit 7 */
#define  NVIC_ISER_SETENA_8                     ((uint32_t)0x00000100)        /*!< bit 8 */
#define  NVIC_ISER_SETENA_9                     ((uint32_t)0x00000200)        /*!< bit 9 */
#define  NVIC_ISER_SETENA_10                    ((uint32_t)0x00000400)        /*!< bit 10 */
#define  NVIC_ISER_SETENA_11                    ((uint32_t)0x00000800)        /*!< bit 11 */
#define  NVIC_ISER_SETENA_12                    ((uint32_t)0x00001000)        /*!< bit 12 */
#define  NVIC_ISER_SETENA_13                    ((uint32_t)0x00002000)        /*!< bit 13 */
#define  NVIC_ISER_SETENA_14                    ((uint32_t)0x00004000)        /*!< bit 14 */
#define  NVIC_ISER_SETENA_15                    ((uint32_t)0x00008000)        /*!< bit 15 */
#define  NVIC_ISER_SETENA_16                    ((uint32_t)0x00010000)        /*!< bit 16 */
#define  NVIC_ISER_SETENA_17                    ((uint32_t)0x00020000)        /*!< bit 17 */
#define  NVIC_ISER_SETENA_18                    ((uint32_t)0x00040000)        /*!< bit 18 */
#define  NVIC_ISER_SETENA_19                    ((uint32_t)0x00080000)        /*!< bit 19 */
#define  NVIC_ISER_SETENA_20                    ((uint32_t)0x00100000)        /*!< bit 20 */
#define  NVIC_ISER_SETENA_21                    ((uint32_t)0x00200000)        /*!< bit 21 */
#define  NVIC_ISER_SETENA_22                    ((uint32_t)0x00400000)        /*!< bit 22 */
#define  NVIC_ISER_SETENA_23                    ((uint32_t)0x00800000)        /*!< bit 23 */
#define  NVIC_ISER_SETENA_24                    ((uint32_t)0x01000000)        /*!< bit 24 */
#define  NVIC_ISER_SETENA_25                    ((uint32_t)0x02000000)        /*!< bit 25 */
#define  NVIC_ISER_SETENA_26                    ((uint32_t)0x04000000)        /*!< bit 26 */
#define  NVIC_ISER_SETENA_27                    ((uint32_t)0x08000000)        /*!< bit 27 */
#define  NVIC_ISER_SETENA_28                    ((uint32_t)0x10000000)        /*!< bit 28 */
#define  NVIC_ISER_SETENA_29                    ((uint32_t)0x20000000)        /*!< bit 29 */
#define  NVIC_ISER_SETENA_30                    ((uint32_t)0x40000000)        /*!< bit 30 */
#define  NVIC_ISER_SETENA_31                    ((uint32_t)0x80000000)        /*!< bit 31 */

