RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/*******************  Bit definition for EXTI_INTEN register  *******************/
#define  EXTI_INTEN_LN0                         ((uint32_t)0x00000001)        /*!< Interrupt Mask on line 0 */
#define  EXTI_INTEN_LN1                         ((uint32_t)0x00000002)        /*!< Interrupt Mask on line 1 */
#define  EXTI_INTEN_LN2                         ((uint32_t)0x00000004)        /*!< Interrupt Mask on line 2 */
#define  EXTI_INTEN_LN3                         ((uint32_t)0x00000008)        /*!< Interrupt Mask on line 3 */
#define  EXTI_INTEN_LN4                         ((uint32_t)0x00000010)        /*!< Interrupt Mask on line 4 */
#define  EXTI_INTEN_LN5                         ((uint32_t)0x00000020)        /*!< Interrupt Mask on line 5 */
#define  EXTI_INTEN_LN6                         ((uint32_t)0x00000040)        /*!< Interrupt Mask on line 6 */
#define  EXTI_INTEN_LN7                         ((uint32_t)0x00000080)        /*!< Interrupt Mask on line 7 */
#define  EXTI_INTEN_LN8                         ((uint32_t)0x00000100)        /*!< Interrupt Mask on line 8 */
#define  EXTI_INTEN_LN9                         ((uint32_t)0x00000200)        /*!< Interrupt Mask on line 9 */
#define  EXTI_INTEN_LN10                        ((uint32_t)0x00000400)        /*!< Interrupt Mask on line 10 */
#define  EXTI_INTEN_LN11                        ((uint32_t)0x00000800)        /*!< Interrupt Mask on line 11 */
#define  EXTI_INTEN_LN12                        ((uint32_t)0x00001000)        /*!< Interrupt Mask on line 12 */
#define  EXTI_INTEN_LN13                        ((uint32_t)0x00002000)        /*!< Interrupt Mask on line 13 */
#define  EXTI_INTEN_LN14                        ((uint32_t)0x00004000)        /*!< Interrupt Mask on line 14 */
#define  EXTI_INTEN_LN15                        ((uint32_t)0x00008000)        /*!< Interrupt Mask on line 15 */
#define  EXTI_INTEN_LN16                        ((uint32_t)0x00010000)        /*!< Interrupt Mask on line 16 */
#define  EXTI_INTEN_LN17                        ((uint32_t)0x00020000)        /*!< Interrupt Mask on line 17 */
#define  EXTI_INTEN_LN18                        ((uint32_t)0x00040000)        /*!< Interrupt Mask on line 18 */
#define  EXTI_INTEN_LN19                        ((uint32_t)0x00080000)        /*!< Interrupt Mask on line 19 */

/*******************  Bit definition for EXTI_EVTEN register  *******************/
#define  EXTI_EVTEN_LN0                         ((uint32_t)0x00000001)        /*!< Event Mask on line 0 */
#define  EXTI_EVTEN_LN1                         ((uint32_t)0x00000002)        /*!< Event Mask on line 1 */
#define  EXTI_EVTEN_LN2                         ((uint32_t)0x00000004)        /*!< Event Mask on line 2 */
#define  EXTI_EVTEN_LN3                         ((uint32_t)0x00000008)        /*!< Event Mask on line 3 */
#define  EXTI_EVTEN_LN4                         ((uint32_t)0x00000010)        /*!< Event Mask on line 4 */
#define  EXTI_EVTEN_LN5                         ((uint32_t)0x00000020)        /*!< Event Mask on line 5 */
#define  EXTI_EVTEN_LN6                         ((uint32_t)0x00000040)        /*!< Event Mask on line 6 */
#define  EXTI_EVTEN_LN7                         ((uint32_t)0x00000080)        /*!< Event Mask on line 7 */
#define  EXTI_EVTEN_LN8                         ((uint32_t)0x00000100)        /*!< Event Mask on line 8 */
#define  EXTI_EVTEN_LN9                         ((uint32_t)0x00000200)        /*!< Event Mask on line 9 */
#define  EXTI_EVTEN_LN10                        ((uint32_t)0x00000400)        /*!< Event Mask on line 10 */
#define  EXTI_EVTEN_LN11                        ((uint32_t)0x00000800)        /*!< Event Mask on line 11 */
#define  EXTI_EVTEN_LN12                        ((uint32_t)0x00001000)        /*!< Event Mask on line 12 */
#define  EXTI_EVTEN_LN13                        ((uint32_t)0x00002000)        /*!< Event Mask on line 13 */
#define  EXTI_EVTEN_LN14                        ((uint32_t)0x00004000)        /*!< Event Mask on line 14 */
#define  EXTI_EVTEN_LN15                        ((uint32_t)0x00008000)        /*!< Event Mask on line 15 */
#define  EXTI_EVTEN_LN16                        ((uint32_t)0x00010000)        /*!< Event Mask on line 16 */
#define  EXTI_EVTEN_LN17                        ((uint32_t)0x00020000)        /*!< Event Mask on line 17 */
#define  EXTI_EVTEN_LN18                        ((uint32_t)0x00040000)        /*!< Event Mask on line 18 */
#define  EXTI_EVTEN_LN19                        ((uint32_t)0x00080000)        /*!< Event Mask on line 19 */

/******************  Bit definition for EXTI_RTRSEL register  *******************/
#define  EXTI_RTRSEL_LN0                        ((uint32_t)0x00000001)        /*!< Rising trigger event configuration bit of line 0 */
#define  EXTI_RTRSEL_LN1                        ((uint32_t)0x00000002)        /*!< Rising trigger event configuration bit of line 1 */
#define  EXTI_RTRSEL_LN2                        ((uint32_t)0x00000004)        /*!< Rising trigger event configuration bit of line 2 */
#define  EXTI_RTRSEL_LN3                        ((uint32_t)0x00000008)        /*!< Rising trigger event configuration bit of line 3 */
#define  EXTI_RTRSEL_LN4                        ((uint32_t)0x00000010)        /*!< Rising trigger event configuration bit of line 4 */
#define  EXTI_RTRSEL_LN5                        ((uint32_t)0x00000020)        /*!< Rising trigger event configuration bit of line 5 */
#define  EXTI_RTRSEL_LN6                        ((uint32_t)0x00000040)        /*!< Rising trigger event configuration bit of line 6 */
#define  EXTI_RTRSEL_LN7                        ((uint32_t)0x00000080)        /*!< Rising trigger event configuration bit of line 7 */
#define  EXTI_RTRSEL_LN8                        ((uint32_t)0x00000100)        /*!< Rising trigger event configuration bit of line 8 */
#define  EXTI_RTRSEL_LN9                        ((uint32_t)0x00000200)        /*!< Rising trigger event configuration bit of line 9 */
#define  EXTI_RTRSEL_LN10                       ((uint32_t)0x00000400)        /*!< Rising trigger event configuration bit of line 10 */
#define  EXTI_RTRSEL_LN11                       ((uint32_t)0x00000800)        /*!< Rising trigger event configuration bit of line 11 */
#define  EXTI_RTRSEL_LN12                       ((uint32_t)0x00001000)        /*!< Rising trigger event configuration bit of line 12 */
#define  EXTI_RTRSEL_LN13                       ((uint32_t)0x00002000)        /*!< Rising trigger event configuration bit of line 13 */
#define  EXTI_RTRSEL_LN14                       ((uint32_t)0x00004000)        /*!< Rising trigger event configuration bit of line 14 */
#define  EXTI_RTRSEL_LN15                       ((uint32_t)0x00008000)        /*!< Rising trigger event configuration bit of line 15 */
#define  EXTI_RTRSEL_LN16                       ((uint32_t)0x00010000)        /*!< Rising trigger event configuration bit of line 16 */
#define  EXTI_RTRSEL_LN17                       ((uint32_t)0x00020000)        /*!< Rising trigger event configuration bit of line 17 */
#define  EXTI_RTRSEL_LN18                       ((uint32_t)0x00040000)        /*!< Rising trigger event configuration bit of line 18 */
#define  EXTI_RTRSEL_LN19                       ((uint32_t)0x00080000)        /*!< Rising trigger event configuration bit of line 19 */

/******************  Bit definition for EXTI_FTRSEL register  *******************/
#define  EXTI_FTRSEL_LN0                        ((uint32_t)0x00000001)        /*!< Falling trigger event configuration bit of line 0 */
#define  EXTI_FTRSEL_LN1                        ((uint32_t)0x00000002)        /*!< Falling trigger event configuration bit of line 1 */
#define  EXTI_FTRSEL_LN2                        ((uint32_t)0x00000004)        /*!< Falling trigger event configuration bit of line 2 */
#define  EXTI_FTRSEL_LN3                        ((uint32_t)0x00000008)        /*!< Falling trigger event configuration bit of line 3 */
#define  EXTI_FTRSEL_LN4                        ((uint32_t)0x00000010)        /*!< Falling trigger event configuration bit of line 4 */
#define  EXTI_FTRSEL_LN5                        ((uint32_t)0x00000020)        /*!< Falling trigger event configuration bit of line 5 */
#define  EXTI_FTRSEL_LN6                        ((uint32_t)0x00000040)        /*!< Falling trigger event configuration bit of line 6 */
#define  EXTI_FTRSEL_LN7                        ((uint32_t)0x00000080)        /*!< Falling trigger event configuration bit of line 7 */
#define  EXTI_FTRSEL_LN8                        ((uint32_t)0x00000100)        /*!< Falling trigger event configuration bit of line 8 */
#define  EXTI_FTRSEL_LN9                        ((uint32_t)0x00000200)        /*!< Falling trigger event configuration bit of line 9 */
#define  EXTI_FTRSEL_LN10                       ((uint32_t)0x00000400)        /*!< Falling trigger event configuration bit of line 10 */
#define  EXTI_FTRSEL_LN11                       ((uint32_t)0x00000800)        /*!< Falling trigger event configuration bit of line 11 */
#define  EXTI_FTRSEL_LN12                       ((uint32_t)0x00001000)        /*!< Falling trigger event configuration bit of line 12 */
#define  EXTI_FTRSEL_LN13                       ((uint32_t)0x00002000)        /*!< Falling trigger event configuration bit of line 13 */
#define  EXTI_FTRSEL_LN14                       ((uint32_t)0x00004000)        /*!< Falling trigger event configuration bit of line 14 */
#define  EXTI_FTRSEL_LN15                       ((uint32_t)0x00008000)        /*!< Falling trigger event configuration bit of line 15 */
#define  EXTI_FTRSEL_LN16                       ((uint32_t)0x00010000)        /*!< Falling trigger event configuration bit of line 16 */
#define  EXTI_FTRSEL_LN17                       ((uint32_t)0x00020000)        /*!< Falling trigger event configuration bit of line 17 */
#define  EXTI_FTRSEL_LN18                       ((uint32_t)0x00040000)        /*!< Falling trigger event configuration bit of line 18 */
#define  EXTI_FTRSEL_LN19                       ((uint32_t)0x00080000)        /*!< Falling trigger event configuration bit of line 19 */

