RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/******************  Bit definition for EXTI_SWIE register  ******************/
#define  EXTI_SWIE_LN0                          ((uint32_t)0x00000001)        /*!< Software Interrupt on line 0 */
#define  EXTI_SWIE_LN1                          ((uint32_t)0x00000002)        /*!< Software Interrupt on line 1 */
#define  EXTI_SWIE_LN2                          ((uint32_t)0x00000004)        /*!< Software Interrupt on line 2 */
#define  EXTI_SWIE_LN3                          ((uint32_t)0x00000008)        /*!< Software Interrupt on line 3 */
#define  EXTI_SWIE_LN4                          ((uint32_t)0x00000010)        /*!< Software Interrupt on line 4 */
#define  EXTI_SWIE_LN5                          ((uint32_t)0x00000020)        /*!< Software Interrupt on line 5 */
#define  EXTI_SWIE_LN6                          ((uint32_t)0x00000040)        /*!< Software Interrupt on line 6 */
#define  EXTI_SWIE_LN7                          ((uint32_t)0x00000080)        /*!< Software Interrupt on line 7 */
#define  EXTI_SWIE_LN8                          ((uint32_t)0x00000100)        /*!< Software Interrupt on line 8 */
#define  EXTI_SWIE_LN9                          ((uint32_t)0x00000200)        /*!< Software Interrupt on line 9 */
#define  EXTI_SWIE_LN10                         ((uint32_t)0x00000400)        /*!< Software Interrupt on line 10 */
#define  EXTI_SWIE_LN11                         ((uint32_t)0x00000800)        /*!< Software Interrupt on line 11 */
#define  EXTI_SWIE_LN12                         ((uint32_t)0x00001000)        /*!< Software Interrupt on line 12 */
#define  EXTI_SWIE_LN13                         ((uint32_t)0x00002000)        /*!< Software Interrupt on line 13 */
#define  EXTI_SWIE_LN14                         ((uint32_t)0x00004000)        /*!< Software Interrupt on line 14 */
#define  EXTI_SWIE_LN15                         ((uint32_t)0x00008000)        /*!< Software Interrupt on line 15 */
#define  EXTI_SWIE_LN16                         ((uint32_t)0x00010000)        /*!< Software Interrupt on line 16 */
#define  EXTI_SWIE_LN17                         ((uint32_t)0x00020000)        /*!< Software Interrupt on line 17 */
#define  EXTI_SWIE_LN18                         ((uint32_t)0x00040000)        /*!< Software Interrupt on line 18 */
#define  EXTI_SWIE_LN19                         ((uint32_t)0x00080000)        /*!< Software Interrupt on line 19 */

/*******************  Bit definition for EXTI_PND register  ********************/
#define  EXTI_PND_LN0                           ((uint32_t)0x00000001)        /*!< Pending bit for line 0 */
#define  EXTI_PND_LN1                           ((uint32_t)0x00000002)        /*!< Pending bit for line 1 */
#define  EXTI_PND_LN2                           ((uint32_t)0x00000004)        /*!< Pending bit for line 2 */
#define  EXTI_PND_LN3                           ((uint32_t)0x00000008)        /*!< Pending bit for line 3 */
#define  EXTI_PND_LN4                           ((uint32_t)0x00000010)        /*!< Pending bit for line 4 */
#define  EXTI_PND_LN5                           ((uint32_t)0x00000020)        /*!< Pending bit for line 5 */
#define  EXTI_PND_LN6                           ((uint32_t)0x00000040)        /*!< Pending bit for line 6 */
#define  EXTI_PND_LN7                           ((uint32_t)0x00000080)        /*!< Pending bit for line 7 */
#define  EXTI_PND_LN8                           ((uint32_t)0x00000100)        /*!< Pending bit for line 8 */
#define  EXTI_PND_LN9                           ((uint32_t)0x00000200)        /*!< Pending bit for line 9 */
#define  EXTI_PND_LN10                          ((uint32_t)0x00000400)        /*!< Pending bit for line 10 */
#define  EXTI_PND_LN11                          ((uint32_t)0x00000800)        /*!< Pending bit for line 11 */
#define  EXTI_PND_LN12                          ((uint32_t)0x00001000)        /*!< Pending bit for line 12 */
#define  EXTI_PND_LN13                          ((uint32_t)0x00002000)        /*!< Pending bit for line 13 */
#define  EXTI_PND_LN14                          ((uint32_t)0x00004000)        /*!< Pending bit for line 14 */
#define  EXTI_PND_LN15                          ((uint32_t)0x00008000)        /*!< Pending bit for line 15 */
#define  EXTI_PND_LN16                          ((uint32_t)0x00010000)        /*!< Pending bit for line 16 */
#define  EXTI_PND_LN17                          ((uint32_t)0x00020000)        /*!< Pending bit for line 17 */
#define  EXTI_PND_LN18                          ((uint32_t)0x00040000)        /*!< Pending bit for line 18 */
#define  EXTI_PND_LN19                          ((uint32_t)0x00080000)        /*!< Pending bit for line 19 */

/******************************************************************************/
/*                                                                            */
/*                             DMA Controller                                 */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for DMA_ISTS register  ********************/
#define  DMA_ISTS_GIF1                          ((uint32_t)0x00000001)        /*!< Channel 1 Global interrupt flag */
#define  DMA_ISTS_TCIF1                         ((uint32_t)0x00000002)        /*!< Channel 1 Transfer Complete flag */
#define  DMA_ISTS_HTIF1                         ((uint32_t)0x00000004)        /*!< Channel 1 Half Transfer flag */
#define  DMA_ISTS_ERRIF1                        ((uint32_t)0x00000008)        /*!< Channel 1 Transfer Error flag */
#define  DMA_ISTS_GIF2                          ((uint32_t)0x00000010)        /*!< Channel 2 Global interrupt flag */
#define  DMA_ISTS_TCIF2                         ((uint32_t)0x00000020)        /*!< Channel 2 Transfer Complete flag */
#define  DMA_ISTS_HTIF2                         ((uint32_t)0x00000040)        /*!< Channel 2 Half Transfer flag */
#define  DMA_ISTS_ERRIF2                        ((uint32_t)0x00000080)        /*!< Channel 2 Transfer Error flag */
#define  DMA_ISTS_GIF3                          ((uint32_t)0x00000100)        /*!< Channel 3 Global interrupt flag */
#define  DMA_ISTS_TCIF3                         ((uint32_t)0x00000200)        /*!< Channel 3 Transfer Complete flag */
#define  DMA_ISTS_HTIF3                         ((uint32_t)0x00000400)        /*!< Channel 3 Half Transfer flag */
#define  DMA_ISTS_ERRIF3                        ((uint32_t)0x00000800)        /*!< Channel 3 Transfer Error flag */
#define  DMA_ISTS_GIF4                          ((uint32_t)0x00001000)        /*!< Channel 4 Global interrupt flag */
#define  DMA_ISTS_TCIF4                         ((uint32_t)0x00002000)        /*!< Channel 4 Transfer Complete flag */
#define  DMA_ISTS_HTIF4                         ((uint32_t)0x00004000)        /*!< Channel 4 Half Transfer flag */
#define  DMA_ISTS_ERRIF4                        ((uint32_t)0x00008000)        /*!< Channel 4 Transfer Error flag */
#define  DMA_ISTS_GIF5                          ((uint32_t)0x00010000)        /*!< Channel 5 Global interrupt flag */
#define  DMA_ISTS_TCIF5                         ((uint32_t)0x00020000)        /*!< Channel 5 Transfer Complete flag */
#define  DMA_ISTS_HTIF5                         ((uint32_t)0x00040000)        /*!< Channel 5 Half Transfer flag */
#define  DMA_ISTS_ERRIF5                        ((uint32_t)0x00080000)        /*!< Channel 5 Transfer Error flag */
#define  DMA_ISTS_GIF6                          ((uint32_t)0x00100000)        /*!< Channel 6 Global interrupt flag */
#define  DMA_ISTS_TCIF6                         ((uint32_t)0x00200000)        /*!< Channel 6 Transfer Complete flag */
#define  DMA_ISTS_HTIF6                         ((uint32_t)0x00400000)        /*!< Channel 6 Half Transfer flag */
#define  DMA_ISTS_ERRIF6                        ((uint32_t)0x00800000)        /*!< Channel 6 Transfer Error flag */
#define  DMA_ISTS_GIF7                          ((uint32_t)0x01000000)        /*!< Channel 7 Global interrupt flag */
#define  DMA_ISTS_TCIF7                         ((uint32_t)0x02000000)        /*!< Channel 7 Transfer Complete flag */
#define  DMA_ISTS_HTIF7                         ((uint32_t)0x04000000)        /*!< Channel 7 Half Transfer flag */
#define  DMA_ISTS_ERRIF7                        ((uint32_t)0x08000000)        /*!< Channel 7 Transfer Error flag */

/*******************  Bit definition for DMA_ICLR register  *******************/
#define  DMA_ICLR_CGIF1                          ((uint32_t)0x00000001)        /*!< Channel 1 Global interrupt clear */
#define  DMA_ICLR_CTCIF1                         ((uint32_t)0x00000002)        /*!< Channel 1 Transfer Complete clear */
#define  DMA_ICLR_CHTIF1                         ((uint32_t)0x00000004)        /*!< Channel 1 Half Transfer clear */
#define  DMA_ICLR_CERRIF1                        ((uint32_t)0x00000008)        /*!< Channel 1 Transfer Error clear */
#define  DMA_ICLR_CGIF2                          ((uint32_t)0x00000010)        /*!< Channel 2 Global interrupt clear */
#define  DMA_ICLR_CTCIF2                         ((uint32_t)0x00000020)        /*!< Channel 2 Transfer Complete clear */
#define  DMA_ICLR_CHTIF2                         ((uint32_t)0x00000040)        /*!< Channel 2 Half Transfer clear */
#define  DMA_ICLR_CERRIF2                        ((uint32_t)0x00000080)        /*!< Channel 2 Transfer Error clear */
#define  DMA_ICLR_CGIF3                          ((uint32_t)0x00000100)        /*!< Channel 3 Global interrupt clear */
#define  DMA_ICLR_CTCIF3                         ((uint32_t)0x00000200)        /*!< Channel 3 Transfer Complete clear */
#define  DMA_ICLR_CHTIF3                         ((uint32_t)0x00000400)        /*!< Channel 3 Half Transfer clear */
#define  DMA_ICLR_CERRIF3                        ((uint32_t)0x00000800)        /*!< Channel 3 Transfer Error clear */
#define  DMA_ICLR_CGIF4                          ((uint32_t)0x00001000)        /*!< Channel 4 Global interrupt clear */
#define  DMA_ICLR_CTCIF4                         ((uint32_t)0x00002000)        /*!< Channel 4 Transfer Complete clear */
#define  DMA_ICLR_CHTIF4                         ((uint32_t)0x00004000)        /*!< Channel 4 Half Transfer clear */
#define  DMA_ICLR_CERRIF4                        ((uint32_t)0x00008000)        /*!< Channel 4 Transfer Error clear */
#define  DMA_ICLR_CGIF5                          ((uint32_t)0x00010000)        /*!< Channel 5 Global interrupt clear */
#define  DMA_ICLR_CTCIF5                         ((uint32_t)0x00020000)        /*!< Channel 5 Transfer Complete clear */
#define  DMA_ICLR_CHTIF5                         ((uint32_t)0x00040000)        /*!< Channel 5 Half Transfer clear */
#define  DMA_ICLR_CERRIF5                        ((uint32_t)0x00080000)        /*!< Channel 5 Transfer Error clear */
#define  DMA_ICLR_CGIF6                          ((uint32_t)0x00100000)        /*!< Channel 6 Global interrupt clear */
#define  DMA_ICLR_CTCIF6                         ((uint32_t)0x00200000)        /*!< Channel 6 Transfer Complete clear */
#define  DMA_ICLR_CHTIF6                         ((uint32_t)0x00400000)        /*!< Channel 6 Half Transfer clear */
#define  DMA_ICLR_CERRIF6                        ((uint32_t)0x00800000)        /*!< Channel 6 Transfer Error clear */
#define  DMA_ICLR_CGIF7                          ((uint32_t)0x01000000)        /*!< Channel 7 Global interrupt clear */
#define  DMA_ICLR_CTCIF7                         ((uint32_t)0x02000000)        /*!< Channel 7 Transfer Complete clear */
#define  DMA_ICLR_CHTIF7                         ((uint32_t)0x04000000)        /*!< Channel 7 Half Transfer clear */
#define  DMA_ICLR_CERRIF7                        ((uint32_t)0x08000000)        /*!< Channel 7 Transfer Error clear */

