RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/*******************  Bit definition for DMA_CHCTRL1 register  *******************/
#define  DMA_CHCTRL1_CHEN                       ((uint16_t)0x0001)            /*!< Channel enable*/
#define  DMA_CHCTRL1_TCIE                       ((uint16_t)0x0002)            /*!< Transfer complete interrupt enable */
#define  DMA_CHCTRL1_HTIE                       ((uint16_t)0x0004)            /*!< Half Transfer interrupt enable */
#define  DMA_CHCTRL1_ERRIE                      ((uint16_t)0x0008)            /*!< Transfer error interrupt enable */
#define  DMA_CHCTRL1_DIR                        ((uint16_t)0x0010)            /*!< Data transfer direction */
#define  DMA_CHCTRL1_CIRM                       ((uint16_t)0x0020)            /*!< Circular mode */
#define  DMA_CHCTRL1_PINC                       ((uint16_t)0x0040)            /*!< Peripheral increment mode */
#define  DMA_CHCTRL1_MINC                       ((uint16_t)0x0080)            /*!< Memory increment mode */

#define  DMA_CHCTRL1_PWIDTH                     ((uint16_t)0x0300)            /*!< PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CHCTRL1_PWIDTH_0                   ((uint16_t)0x0100)            /*!< Bit 0 */
#define  DMA_CHCTRL1_PWIDTH_1                   ((uint16_t)0x0200)            /*!< Bit 1 */

#define  DMA_CHCTRL1_MWIDTH                     ((uint16_t)0x0C00)            /*!< MSIZE[1:0] bits (Memory size) */
#define  DMA_CHCTRL1_MWIDTH_0                   ((uint16_t)0x0400)            /*!< Bit 0 */
#define  DMA_CHCTRL1_MWIDTH_1                   ((uint16_t)0x0800)            /*!< Bit 1 */

#define  DMA_CHCTRL1_CHPL                       ((uint16_t)0x3000)            /*!< PL[1:0] bits(Channel Priority level) */
#define  DMA_CHCTRL1_CHPL_0                     ((uint16_t)0x1000)            /*!< Bit 0 */
#define  DMA_CHCTRL1_CHPL_1                     ((uint16_t)0x2000)            /*!< Bit 1 */

#define  DMA_CHCTRL1_MEMTOMEM                   ((uint16_t)0x4000)            /*!< Memory to memory mode */

/*******************  Bit definition for DMA_CHCTRL2 register  *******************/
#define  DMA_CHCTRL2_CHEN                       ((uint16_t)0x0001)            /*!< Channel enable */
#define  DMA_CHCTRL2_TCIE                       ((uint16_t)0x0002)            /*!< Transfer complete interrupt enable */
#define  DMA_CHCTRL2_HTIE                       ((uint16_t)0x0004)            /*!< Half Transfer interrupt enable */
#define  DMA_CHCTRL2_ERRIE                      ((uint16_t)0x0008)            /*!< Transfer error interrupt enable */
#define  DMA_CHCTRL2_DIR                        ((uint16_t)0x0010)            /*!< Data transfer direction */
#define  DMA_CHCTRL2_CIRM                       ((uint16_t)0x0020)            /*!< Circular mode */
#define  DMA_CHCTRL2_PINC                       ((uint16_t)0x0040)            /*!< Peripheral increment mode */
#define  DMA_CHCTRL2_MINC                       ((uint16_t)0x0080)            /*!< Memory increment mode */

#define  DMA_CHCTRL2_PWIDTH                     ((uint16_t)0x0300)            /*!< PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CHCTRL2_PWIDTH_0                   ((uint16_t)0x0100)            /*!< Bit 0 */
#define  DMA_CHCTRL2_PWIDTH_1                   ((uint16_t)0x0200)            /*!< Bit 1 */

#define  DMA_CHCTRL2_MWIDTH                     ((uint16_t)0x0C00)            /*!< MSIZE[1:0] bits (Memory size) */
#define  DMA_CHCTRL2_MWIDTH_0                   ((uint16_t)0x0400)            /*!< Bit 0 */
#define  DMA_CHCTRL2_MWIDTH_1                   ((uint16_t)0x0800)            /*!< Bit 1 */

#define  DMA_CHCTRL2_CHPL                       ((uint16_t)0x3000)            /*!< PL[1:0] bits (Channel Priority level) */
#define  DMA_CHCTRL2_CHPL_0                     ((uint16_t)0x1000)            /*!< Bit 0 */
#define  DMA_CHCTRL2_CHPL_1                     ((uint16_t)0x2000)            /*!< Bit 1 */

#define  DMA_CHCTRL2_MEMTOMEM                   ((uint16_t)0x4000)            /*!< Memory to memory mode */

/*******************  Bit definition for DMA_CHCTRL3 register  *******************/
#define  DMA_CHCTRL3_CHEN                       ((uint16_t)0x0001)            /*!< Channel enable */
#define  DMA_CHCTRL3_TCIE                       ((uint16_t)0x0002)            /*!< Transfer complete interrupt enable */
#define  DMA_CHCTRL3_HTIE                       ((uint16_t)0x0004)            /*!< Half Transfer interrupt enable */
#define  DMA_CHCTRL3_ERRIE                      ((uint16_t)0x0008)            /*!< Transfer error interrupt enable */
#define  DMA_CHCTRL3_DIR                        ((uint16_t)0x0010)            /*!< Data transfer direction */
#define  DMA_CHCTRL3_CIRM                       ((uint16_t)0x0020)            /*!< Circular mode */
#define  DMA_CHCTRL3_PINC                       ((uint16_t)0x0040)            /*!< Peripheral increment mode */
#define  DMA_CHCTRL3_MINC                       ((uint16_t)0x0080)            /*!< Memory increment mode */

#define  DMA_CHCTRL3_PWIDTH                     ((uint16_t)0x0300)            /*!< PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CHCTRL3_PWIDTH_0                   ((uint16_t)0x0100)            /*!< Bit 0 */
#define  DMA_CHCTRL3_PWIDTH_1                   ((uint16_t)0x0200)            /*!< Bit 1 */

#define  DMA_CHCTRL3_MWIDTH                     ((uint16_t)0x0C00)            /*!< MSIZE[1:0] bits (Memory size) */
#define  DMA_CHCTRL3_MWIDTH_0                   ((uint16_t)0x0400)            /*!< Bit 0 */
#define  DMA_CHCTRL3_MWIDTH_1                   ((uint16_t)0x0800)            /*!< Bit 1 */

#define  DMA_CHCTRL3_CHPL                       ((uint16_t)0x3000)            /*!< PL[1:0] bits (Channel Priority level) */
#define  DMA_CHCTRL3_CHPL_0                     ((uint16_t)0x1000)            /*!< Bit 0 */
#define  DMA_CHCTRL3_CHPL_1                     ((uint16_t)0x2000)            /*!< Bit 1 */

#define  DMA_CHCTRL3_MEMTOMEM                   ((uint16_t)0x4000)            /*!< Memory to memory mode */

/********************  Bit definition for DMA_CHCTRL4 register  *******************/
#define  DMA_CHCTRL4_CHEN                       ((uint16_t)0x0001)            /*!< Channel enable */
#define  DMA_CHCTRL4_TCIE                       ((uint16_t)0x0002)            /*!< Transfer complete interrupt enable */
#define  DMA_CHCTRL4_HTIE                       ((uint16_t)0x0004)            /*!< Half Transfer interrupt enable */
#define  DMA_CHCTRL4_ERRIE                      ((uint16_t)0x0008)            /*!< Transfer error interrupt enable */
#define  DMA_CHCTRL4_DIR                        ((uint16_t)0x0010)            /*!< Data transfer direction */
#define  DMA_CHCTRL4_CIRM                       ((uint16_t)0x0020)            /*!< Circular mode */
#define  DMA_CHCTRL4_PINC                       ((uint16_t)0x0040)            /*!< Peripheral increment mode */
#define  DMA_CHCTRL4_MINC                       ((uint16_t)0x0080)            /*!< Memory increment mode */

