RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#define  DMA_CHCTRL4_PWIDTH                     ((uint16_t)0x0300)            /*!< PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CHCTRL4_PWIDTH_0                   ((uint16_t)0x0100)            /*!< Bit 0 */
#define  DMA_CHCTRL4_PWIDTH_1                   ((uint16_t)0x0200)            /*!< Bit 1 */

#define  DMA_CHCTRL4_MWIDTH                     ((uint16_t)0x0C00)            /*!< MSIZE[1:0] bits (Memory size) */
#define  DMA_CHCTRL4_MWIDTH_0                   ((uint16_t)0x0400)            /*!< Bit 0 */
#define  DMA_CHCTRL4_MWIDTH_1                   ((uint16_t)0x0800)            /*!< Bit 1 */

#define  DMA_CHCTRL4_CHPL                       ((uint16_t)0x3000)            /*!< PL[1:0] bits (Channel Priority level) */
#define  DMA_CHCTRL4_CHPL_0                     ((uint16_t)0x1000)            /*!< Bit 0 */
#define  DMA_CHCTRL4_CHPL_1                     ((uint16_t)0x2000)            /*!< Bit 1 */

#define  DMA_CHCTRL4_MEMTOMEM                   ((uint16_t)0x4000)            /*!< Memory to memory mode */

/******************  Bit definition for DMA_CHCTRL5 register  *******************/
#define  DMA_CHCTRL5_CHEN                       ((uint16_t)0x0001)            /*!< Channel enable */
#define  DMA_CHCTRL5_TCIE                       ((uint16_t)0x0002)            /*!< Transfer complete interrupt enable */
#define  DMA_CHCTRL5_HTIE                       ((uint16_t)0x0004)            /*!< Half Transfer interrupt enable */
#define  DMA_CHCTRL5_ERRIE                      ((uint16_t)0x0008)            /*!< Transfer error interrupt enable */
#define  DMA_CHCTRL5_DIR                        ((uint16_t)0x0010)            /*!< Data transfer direction */
#define  DMA_CHCTRL5_CIRM                       ((uint16_t)0x0020)            /*!< Circular mode */
#define  DMA_CHCTRL5_PINC                       ((uint16_t)0x0040)            /*!< Peripheral increment mode */
#define  DMA_CHCTRL5_MINC                       ((uint16_t)0x0080)            /*!< Memory increment mode */

#define  DMA_CHCTRL5_PWIDTH                     ((uint16_t)0x0300)            /*!< PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CHCTRL5_PWIDTH_0                   ((uint16_t)0x0100)            /*!< Bit 0 */
#define  DMA_CHCTRL5_PWIDTH_1                   ((uint16_t)0x0200)            /*!< Bit 1 */

#define  DMA_CHCTRL5_MWIDTH                     ((uint16_t)0x0C00)            /*!< MSIZE[1:0] bits (Memory size) */
#define  DMA_CHCTRL5_MWIDTH_0                   ((uint16_t)0x0400)            /*!< Bit 0 */
#define  DMA_CHCTRL5_MWIDTH_1                   ((uint16_t)0x0800)            /*!< Bit 1 */

#define  DMA_CHCTRL5_CHPL                       ((uint16_t)0x3000)            /*!< PL[1:0] bits (Channel Priority level) */
#define  DMA_CHCTRL5_CHPL_0                     ((uint16_t)0x1000)            /*!< Bit 0 */
#define  DMA_CHCTRL5_CHPL_1                     ((uint16_t)0x2000)            /*!< Bit 1 */

#define  DMA_CHCTRL5_MEMTOMEM                   ((uint16_t)0x4000)            /*!< Memory to memory mode enable */

/*******************  Bit definition for DMA_CHCTRL6 register  *******************/
#define  DMA_CHCTRL6_CHEN                       ((uint16_t)0x0001)            /*!< Channel enable */
#define  DMA_CHCTRL6_TCIE                       ((uint16_t)0x0002)            /*!< Transfer complete interrupt enable */
#define  DMA_CHCTRL6_HTIE                       ((uint16_t)0x0004)            /*!< Half Transfer interrupt enable */
#define  DMA_CHCTRL6_ERRIE                      ((uint16_t)0x0008)            /*!< Transfer error interrupt enable */
#define  DMA_CHCTRL6_DIR                        ((uint16_t)0x0010)            /*!< Data transfer direction */
#define  DMA_CHCTRL6_CIRM                       ((uint16_t)0x0020)            /*!< Circular mode */
#define  DMA_CHCTRL6_PINC                       ((uint16_t)0x0040)            /*!< Peripheral increment mode */
#define  DMA_CHCTRL6_MINC                       ((uint16_t)0x0080)            /*!< Memory increment mode */

#define  DMA_CHCTRL6_PWIDTH                     ((uint16_t)0x0300)            /*!< PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CHCTRL6_PWIDTH_0                   ((uint16_t)0x0100)            /*!< Bit 0 */
#define  DMA_CHCTRL6_PWIDTH_1                   ((uint16_t)0x0200)            /*!< Bit 1 */

#define  DMA_CHCTRL6_MWIDTH                     ((uint16_t)0x0C00)            /*!< MSIZE[1:0] bits (Memory size) */
#define  DMA_CHCTRL6_MWIDTH_0                   ((uint16_t)0x0400)            /*!< Bit 0 */
#define  DMA_CHCTRL6_MWIDTH_1                   ((uint16_t)0x0800)            /*!< Bit 1 */

#define  DMA_CHCTRL6_CHPL                       ((uint16_t)0x3000)            /*!< PL[1:0] bits (Channel Priority level) */
#define  DMA_CHCTRL6_CHPL_0                     ((uint16_t)0x1000)            /*!< Bit 0 */
#define  DMA_CHCTRL6_CHPL_1                     ((uint16_t)0x2000)            /*!< Bit 1 */

#define  DMA_CHCTRL6_MEMTOMEM                   ((uint16_t)0x4000)            /*!< Memory to memory mode */

/*******************  Bit definition for DMA_CHCTRL7 register  *******************/
#define  DMA_CHCTRL7_CHEN                       ((uint16_t)0x0001)            /*!< Channel enable */
#define  DMA_CHCTRL7_TCIE                       ((uint16_t)0x0002)            /*!< Transfer complete interrupt enable */
#define  DMA_CHCTRL7_HTIE                       ((uint16_t)0x0004)            /*!< Half Transfer interrupt enable */
#define  DMA_CHCTRL7_ERRIE                      ((uint16_t)0x0008)            /*!< Transfer error interrupt enable */
#define  DMA_CHCTRL7_DIR                        ((uint16_t)0x0010)            /*!< Data transfer direction */
#define  DMA_CHCTRL7_CIRM                       ((uint16_t)0x0020)            /*!< Circular mode */
#define  DMA_CHCTRL7_PINC                       ((uint16_t)0x0040)            /*!< Peripheral increment mode */
#define  DMA_CHCTRL7_MINC                       ((uint16_t)0x0080)            /*!< Memory increment mode */

#define  DMA_CHCTRL7_PWIDTH                ,    ((uint16_t)0x0300)            /*!< PSIZE[1:0] bits (Peripheral size) */
#define  DMA_CHCTRL7_PWIDTH_0                   ((uint16_t)0x0100)            /*!< Bit 0 */
#define  DMA_CHCTRL7_PWIDTH_1                   ((uint16_t)0x0200)            /*!< Bit 1 */

