RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#define  DMA_CHCTRL7_MWIDTH                     ((uint16_t)0x0C00)            /*!< MSIZE[1:0] bits (Memory size) */
#define  DMA_CHCTRL7_MWIDTH_0                   ((uint16_t)0x0400)            /*!< Bit 0 */
#define  DMA_CHCTRL7_MWIDTH_1                   ((uint16_t)0x0800)            /*!< Bit 1 */

#define  DMA_CHCTRL7_CHPL                       ((uint16_t)0x3000)            /*!< PL[1:0] bits (Channel Priority level) */
#define  DMA_CHCTRL7_CHPL_0                     ((uint16_t)0x1000)            /*!< Bit 0 */
#define  DMA_CHCTRL7_CHPL_1                     ((uint16_t)0x2000)            /*!< Bit 1 */

#define  DMA_CHCTRL7_MEMTOMEM                   ((uint16_t)0x4000)            /*!< Memory to memory mode enable */

/******************  Bit definition for DMA_TCNT1 register  ******************/
#define  DMA_TCNT1_CNT                          ((uint16_t)0xFFFF)            /*!< Number of data to Transfer */

/******************  Bit definition for DMA_TCNT2 register  ******************/
#define  DMA_TCNT2_CNT                          ((uint16_t)0xFFFF)            /*!< Number of data to Transfer */

/******************  Bit definition for DMA_TCNT3 register  ******************/
#define  DMA_TCNT3_CNT                          ((uint16_t)0xFFFF)            /*!< Number of data to Transfer */

/******************  Bit definition for DMA_TCNT4 register  ******************/
#define  DMA_TCNT4_CNT                          ((uint16_t)0xFFFF)            /*!< Number of data to Transfer */

/******************  Bit definition for DMA_TCNT5 register  ******************/
#define  DMA_TCNT5_CNT                          ((uint16_t)0xFFFF)            /*!< Number of data to Transfer */

/******************  Bit definition for DMA_TCNT6 register  ******************/
#define  DMA_TCNT6_CNT                          ((uint16_t)0xFFFF)            /*!< Number of data to Transfer */

/******************  Bit definition for DMA_TCNT7 register  ******************/
#define  DMA_TCNT7_CNT                          ((uint16_t)0xFFFF)            /*!< Number of data to Transfer */

/******************  Bit definition for DMA_CPBA1 register  *******************/
#define  DMA_CPBA1_PA                           ((uint32_t)0xFFFFFFFF)        /*!< Peripheral Address */

/******************  Bit definition for DMA_CPBA2 register  *******************/
#define  DMA_CPBA2_PA                           ((uint32_t)0xFFFFFFFF)        /*!< Peripheral Address */

/******************  Bit definition for DMA_CPBA3 register  *******************/
#define  DMA_CPBA3_PA                           ((uint32_t)0xFFFFFFFF)        /*!< Peripheral Address */


/******************  Bit definition for DMA_CPBA4 register  *******************/
#define  DMA_CPBA4_PA                           ((uint32_t)0xFFFFFFFF)        /*!< Peripheral Address */

/******************  Bit definition for DMA_CPBA5 register  *******************/
#define  DMA_CPBA5_PA                           ((uint32_t)0xFFFFFFFF)        /*!< Peripheral Address */

/******************  Bit definition for DMA_CPBA6 register  *******************/
#define  DMA_CPBA6_PA                           ((uint32_t)0xFFFFFFFF)        /*!< Peripheral Address */


/******************  Bit definition for DMA_CPBA7 register  *******************/
#define  DMA_CPBA7_PA                           ((uint32_t)0xFFFFFFFF)        /*!< Peripheral Address */

/******************  Bit definition for DMA_CMBA1 register  *******************/
#define  DMA_CMBA1_MA                           ((uint32_t)0xFFFFFFFF)        /*!< Memory Address */

/******************  Bit definition for DMA_CMBA2 register  *******************/
#define  DMA_CMBA2_MA                           ((uint32_t)0xFFFFFFFF)        /*!< Memory Address */

/******************  Bit definition for DMA_CMBA3 register  *******************/
#define  DMA_CMBA3_MA                           ((uint32_t)0xFFFFFFFF)        /*!< Memory Address */


/******************  Bit definition for DMA_CMBA4 register  *******************/
#define  DMA_CMBA4_MA                           ((uint32_t)0xFFFFFFFF)        /*!< Memory Address */

/******************  Bit definition for DMA_CMBA5 register  *******************/
#define  DMA_CMBA5_MA                           ((uint32_t)0xFFFFFFFF)        /*!< Memory Address */

/******************  Bit definition for DMA_CMBA6 register  *******************/
#define  DMA_CMBA6_MA                           ((uint32_t)0xFFFFFFFF)        /*!< Memory Address */

/******************  Bit definition for DMA_CMBA7 register  *******************/
#define  DMA_CMBA7_MA                           ((uint32_t)0xFFFFFFFF)        /*!< Memory Address */

/******************************************************************************/
/*                                                                            */
/*                        Analog to Digital Converter                         */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for ADC_STS register  ********************/
#define  ADC_STS_AWD                            ((uint8_t)0x01)               /*!< Analog watchdog flag */
#define  ADC_STS_EC                             ((uint8_t)0x02)               /*!< End of conversion */
#define  ADC_STS_JEC                            ((uint8_t)0x04)               /*!< Injected channel end of conversion */
#define  ADC_STS_JSTR                           ((uint8_t)0x08)               /*!< Injected channel Start flag */
#define  ADC_STS_RSTR                           ((uint8_t)0x10)               /*!< Regular channel Start flag */

/*******************  Bit definition for ADC_CTRL1 register  ********************/
#define  ADC_CTRL1_AWDCS                        ((uint32_t)0x0000001F)        /*!< AWDCH[4:0] bits (Analog watchdog channel select bits) */
#define  ADC_CTRL1_AWDCS_0                      ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  ADC_CTRL1_AWDCS_1                      ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  ADC_CTRL1_AWDCS_2                      ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  ADC_CTRL1_AWDCS_3                      ((uint32_t)0x00000008)        /*!< Bit 3 */
#define  ADC_CTRL1_AWDCS_4                      ((uint32_t)0x00000010)        /*!< Bit 4 */

#define  ADC_CTRL1_ECIEN                        ((uint32_t)0x00000020)        /*!< Interrupt enable for EOC */
#define  ADC_CTRL1_AWDIEN                       ((uint32_t)0x00000040)        /*!< Analog Watchdog interrupt enable */
#define  ADC_CTRL1_JECIEN                       ((uint32_t)0x00000080)        /*!< Interrupt enable for injected channels */
#define  ADC_CTRL1_SCN                          ((uint32_t)0x00000100)        /*!< Scan mode */
#define  ADC_CTRL1_AWDSGE                       ((uint32_t)0x00000200)        /*!< Enable the watchdog on a single channel in scan mode */
#define  ADC_CTRL1_JAUT                         ((uint32_t)0x00000400)        /*!< Automatic injected group conversion */
#define  ADC_CTRL1_RDISEN                       ((uint32_t)0x00000800)        /*!< Discontinuous mode on regular channels */
#define  ADC_CTRL1_JDISEN                       ((uint32_t)0x00001000)        /*!< Discontinuous mode on injected channels */

#define  ADC_CTRL1_DISN                         ((uint32_t)0x0000E000)        /*!< DISCNUM[2:0] bits (Discontinuous mode channel count) */
#define  ADC_CTRL1_DISN_0                       ((uint32_t)0x00002000)        /*!< Bit 0 */
#define  ADC_CTRL1_DISN_1                       ((uint32_t)0x00004000)        /*!< Bit 1 */
#define  ADC_CTRL1_DISN_2                       ((uint32_t)0x00008000)        /*!< Bit 2 */

#define  ADC_CTRL1_DUALM                        ((uint32_t)0x000F0000)        /*!< DUALMOD[3:0] bits (Dual mode selection) */
#define  ADC_CTRL1_DUALM_0                      ((uint32_t)0x00010000)        /*!< Bit 0 */
#define  ADC_CTRL1_DUALM_1                      ((uint32_t)0x00020000)        /*!< Bit 1 */
#define  ADC_CTRL1_DUALM_2                      ((uint32_t)0x00040000)        /*!< Bit 2 */
#define  ADC_CTRL1_DUALM_3                      ((uint32_t)0x00080000)        /*!< Bit 3 */

#define  ADC_CTRL1_JAWDEN                       ((uint32_t)0x00400000)        /*!< Analog watchdog enable on injected channels */
#define  ADC_CTRL1_AWDEN                        ((uint32_t)0x00800000)        /*!< Analog watchdog enable on regular channels */


/*******************  Bit definition for ADC_CTRL2 register  ********************/
#define  ADC_CTRL2_ADON                         ((uint32_t)0x00000001)        /*!< A/D Converter ON / OFF */
#define  ADC_CTRL2_CON                          ((uint32_t)0x00000002)        /*!< Continuous Conversion */
#define  ADC_CTRL2_CAL                          ((uint32_t)0x00000004)        /*!< A/D Calibration */
#define  ADC_CTRL2_RSTCAL                       ((uint32_t)0x00000008)        /*!< Reset Calibration */
#define  ADC_CTRL2_DMAEN                        ((uint32_t)0x00000100)        /*!< Direct Memory access mode */
#define  ADC_CTRL2_DALIGN                       ((uint32_t)0x00000800)        /*!< Data Alignment */

#define  ADC_CTRL2_JEXSEL                       ((uint32_t)0x01007000)        /*!< JEXTSEL[3:0] bits (External event select for injected group) */
#define  ADC_CTRL2_JEXSEL_0                     ((uint32_t)0x00001000)        /*!< Bit 0 */
#define  ADC_CTRL2_JEXSEL_1                     ((uint32_t)0x00002000)        /*!< Bit 1 */
#define  ADC_CTRL2_JEXSEL_2                     ((uint32_t)0x00004000)        /*!< Bit 2 */
#define  ADC_CTRL2_JEXSEL_3                     ((uint32_t)0x01000000)        /*!< Bit 3 */

#define  ADC_CTRL2_JEXTREN                      ((uint32_t)0x00008000)        /*!< External Trigger Conversion mode for injected channels */

#define  ADC_CTRL2_EXSEL                        ((uint32_t)0x020E0000)        /*!< EXTSEL[3:0] bits (External Event Select for regular group) */
#define  ADC_CTRL2_EXSEL_0                      ((uint32_t)0x00020000)        /*!< Bit 0 */
#define  ADC_CTRL2_EXSEL_1                      ((uint32_t)0x00040000)        /*!< Bit 1 */
#define  ADC_CTRL2_EXSEL_2                      ((uint32_t)0x00080000)        /*!< Bit 2 */
#define  ADC_CTRL2_EXSEL_3                      ((uint32_t)0x02000000)        /*!< Bit 3 */

