RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#define  ADC_CTRL2_EXTREN                       ((uint32_t)0x00100000)        /*!< External Trigger Conversion mode for regular channels */
#define  ADC_CTRL2_JSWSTR                       ((uint32_t)0x00200000)        /*!< Start Conversion of injected channels */
#define  ADC_CTRL2_SWSTR                        ((uint32_t)0x00400000)        /*!< Start Conversion of regular channels */
#define  ADC_CTRL2_TSREF                        ((uint32_t)0x00800000)        /*!< Temperature Sensor and VREFINT Enable */

/******************  Bit definition for ADC_SMPT1 register  *******************/
#define  ADC_SMPT1_SMP10                        ((uint32_t)0x00000007)        /*!< SMP10[2:0] bits (Channel 10 Sample time selection) */
#define  ADC_SMPT1_SMP10_0                      ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  ADC_SMPT1_SMP10_1                      ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  ADC_SMPT1_SMP10_2                      ((uint32_t)0x00000004)        /*!< Bit 2 */

#define  ADC_SMPT1_SMP11                        ((uint32_t)0x00000038)        /*!< SMP11[2:0] bits (Channel 11 Sample time selection) */
#define  ADC_SMPT1_SMP11_0                      ((uint32_t)0x00000008)        /*!< Bit 0 */
#define  ADC_SMPT1_SMP11_1                      ((uint32_t)0x00000010)        /*!< Bit 1 */
#define  ADC_SMPT1_SMP11_2                      ((uint32_t)0x00000020)        /*!< Bit 2 */

#define  ADC_SMPT1_SMP12                        ((uint32_t)0x000001C0)        /*!< SMP12[2:0] bits (Channel 12 Sample time selection) */
#define  ADC_SMPT1_SMP12_0                      ((uint32_t)0x00000040)        /*!< Bit 0 */
#define  ADC_SMPT1_SMP12_1                      ((uint32_t)0x00000080)        /*!< Bit 1 */
#define  ADC_SMPT1_SMP12_2                      ((uint32_t)0x00000100)        /*!< Bit 2 */

#define  ADC_SMPT1_SMP13                        ((uint32_t)0x00000E00)        /*!< SMP13[2:0] bits (Channel 13 Sample time selection) */
#define  ADC_SMPT1_SMP13_0                      ((uint32_t)0x00000200)        /*!< Bit 0 */
#define  ADC_SMPT1_SMP13_1                      ((uint32_t)0x00000400)        /*!< Bit 1 */
#define  ADC_SMPT1_SMP13_2                      ((uint32_t)0x00000800)        /*!< Bit 2 */

#define  ADC_SMPT1_SMP14                        ((uint32_t)0x00007000)        /*!< SMP14[2:0] bits (Channel 14 Sample time selection) */
#define  ADC_SMPT1_SMP14_0                      ((uint32_t)0x00001000)        /*!< Bit 0 */
#define  ADC_SMPT1_SMP14_1                      ((uint32_t)0x00002000)        /*!< Bit 1 */
#define  ADC_SMPT1_SMP14_2                      ((uint32_t)0x00004000)        /*!< Bit 2 */

#define  ADC_SMPT1_SMP15                        ((uint32_t)0x00038000)        /*!< SMP15[2:0] bits (Channel 15 Sample time selection) */
#define  ADC_SMPT1_SMP15_0                      ((uint32_t)0x00008000)        /*!< Bit 0 */
#define  ADC_SMPT1_SMP15_1                      ((uint32_t)0x00010000)        /*!< Bit 1 */
#define  ADC_SMPT1_SMP15_2                      ((uint32_t)0x00020000)        /*!< Bit 2 */

#define  ADC_SMPT1_SMP16                        ((uint32_t)0x001C0000)        /*!< SMP16[2:0] bits (Channel 16 Sample time selection) */
#define  ADC_SMPT1_SMP16_0                      ((uint32_t)0x00040000)        /*!< Bit 0 */
#define  ADC_SMPT1_SMP16_1                      ((uint32_t)0x00080000)        /*!< Bit 1 */
#define  ADC_SMPT1_SMP16_2                      ((uint32_t)0x00100000)        /*!< Bit 2 */

#define  ADC_SMPT1_SMP17                        ((uint32_t)0x00E00000)        /*!< SMP17[2:0] bits (Channel 17 Sample time selection) */
#define  ADC_SMPT1_SMP17_0                      ((uint32_t)0x00200000)        /*!< Bit 0 */
#define  ADC_SMPT1_SMP17_1                      ((uint32_t)0x00400000)        /*!< Bit 1 */
#define  ADC_SMPT1_SMP17_2                      ((uint32_t)0x00800000)        /*!< Bit 2 */

/******************  Bit definition for ADC_SMPT2 register  *******************/
#define  ADC_SMPT2_SMP0                         ((uint32_t)0x00000007)        /*!< SMP0[2:0] bits (Channel 0 Sample time selection) */
#define  ADC_SMPT2_SMP0_0                       ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  ADC_SMPT2_SMP0_1                       ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  ADC_SMPT2_SMP0_2                       ((uint32_t)0x00000004)        /*!< Bit 2 */

#define  ADC_SMPT2_SMP1                         ((uint32_t)0x00000038)        /*!< SMP1[2:0] bits (Channel 1 Sample time selection) */
#define  ADC_SMPT2_SMP1_0                       ((uint32_t)0x00000008)        /*!< Bit 0 */
#define  ADC_SMPT2_SMP1_1                       ((uint32_t)0x00000010)        /*!< Bit 1 */
#define  ADC_SMPT2_SMP1_2                       ((uint32_t)0x00000020)        /*!< Bit 2 */

#define  ADC_SMPT2_SMP2                         ((uint32_t)0x000001C0)        /*!< SMP2[2:0] bits (Channel 2 Sample time selection) */
#define  ADC_SMPT2_SMP2_0                       ((uint32_t)0x00000040)        /*!< Bit 0 */
#define  ADC_SMPT2_SMP2_1                       ((uint32_t)0x00000080)        /*!< Bit 1 */
#define  ADC_SMPT2_SMP2_2                       ((uint32_t)0x00000100)        /*!< Bit 2 */

#define  ADC_SMPT2_SMP3                         ((uint32_t)0x00000E00)        /*!< SMP3[2:0] bits (Channel 3 Sample time selection) */
#define  ADC_SMPT2_SMP3_0                       ((uint32_t)0x00000200)        /*!< Bit 0 */
#define  ADC_SMPT2_SMP3_1                       ((uint32_t)0x00000400)        /*!< Bit 1 */
#define  ADC_SMPT2_SMP3_2                       ((uint32_t)0x00000800)        /*!< Bit 2 */

#define  ADC_SMPT2_SMP4                         ((uint32_t)0x00007000)        /*!< SMP4[2:0] bits (Channel 4 Sample time selection) */
#define  ADC_SMPT2_SMP4_0                       ((uint32_t)0x00001000)        /*!< Bit 0 */
#define  ADC_SMPT2_SMP4_1                       ((uint32_t)0x00002000)        /*!< Bit 1 */
#define  ADC_SMPT2_SMP4_2                       ((uint32_t)0x00004000)        /*!< Bit 2 */

#define  ADC_SMPT2_SMP5                         ((uint32_t)0x00038000)        /*!< SMP5[2:0] bits (Channel 5 Sample time selection) */
#define  ADC_SMPT2_SMP5_0                       ((uint32_t)0x00008000)        /*!< Bit 0 */
#define  ADC_SMPT2_SMP5_1                       ((uint32_t)0x00010000)        /*!< Bit 1 */
#define  ADC_SMPT2_SMP5_2                       ((uint32_t)0x00020000)        /*!< Bit 2 */

#define  ADC_SMPT2_SMP6                         ((uint32_t)0x001C0000)        /*!< SMP6[2:0] bits (Channel 6 Sample time selection) */
#define  ADC_SMPT2_SMP6_0                       ((uint32_t)0x00040000)        /*!< Bit 0 */
#define  ADC_SMPT2_SMP6_1                       ((uint32_t)0x00080000)        /*!< Bit 1 */
#define  ADC_SMPT2_SMP6_2                       ((uint32_t)0x00100000)        /*!< Bit 2 */

