RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#define  ADC_SMPT2_SMP7                         ((uint32_t)0x00E00000)        /*!< SMP7[2:0] bits (Channel 7 Sample time selection) */
#define  ADC_SMPT2_SMP7_0                       ((uint32_t)0x00200000)        /*!< Bit 0 */
#define  ADC_SMPT2_SMP7_1                       ((uint32_t)0x00400000)        /*!< Bit 1 */
#define  ADC_SMPT2_SMP7_2                       ((uint32_t)0x00800000)        /*!< Bit 2 */

#define  ADC_SMPT2_SMP8                         ((uint32_t)0x07000000)        /*!< SMP8[2:0] bits (Channel 8 Sample time selection) */
#define  ADC_SMPT2_SMP8_0                       ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  ADC_SMPT2_SMP8_1                       ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  ADC_SMPT2_SMP8_2                       ((uint32_t)0x04000000)        /*!< Bit 2 */

#define  ADC_SMPT2_SMP9                         ((uint32_t)0x38000000)        /*!< SMP9[2:0] bits (Channel 9 Sample time selection) */
#define  ADC_SMPT2_SMP9_0                       ((uint32_t)0x08000000)        /*!< Bit 0 */
#define  ADC_SMPT2_SMP9_1                       ((uint32_t)0x10000000)        /*!< Bit 1 */
#define  ADC_SMPT2_SMP9_2                       ((uint32_t)0x20000000)        /*!< Bit 2 */

/******************  Bit definition for ADC_JOFS1 register  *******************/
#define  ADC_JOFS1_JOFST1                       ((uint16_t)0x0FFF)            /*!< Data offset for injected channel 1 */

/******************  Bit definition for ADC_JOFS2 register  *******************/
#define  ADC_JOFS2_JOFST2                       ((uint16_t)0x0FFF)            /*!< Data offset for injected channel 2 */

/******************  Bit definition for ADC_JOFS3 register  *******************/
#define  ADC_JOFS3_JOFST3                       ((uint16_t)0x0FFF)            /*!< Data offset for injected channel 3 */

/******************  Bit definition for ADC_JOFS4 register  *******************/
#define  ADC_JOFS4_JOFST4                       ((uint16_t)0x0FFF)            /*!< Data offset for injected channel 4 */

/*******************  Bit definition for ADC_WHTR register  ********************/
#define  ADC_WHTR_AWHT                          ((uint16_t)0x0FFF)            /*!< Analog watchdog high threshold */

/*******************  Bit definition for ADC_WLTR register  ********************/
#define  ADC_WLTR_AWLT                          ((uint16_t)0x0FFF)            /*!< Analog watchdog low threshold */

/*******************  Bit definition for ADC_RSQ1 register  *******************/
#define  ADC_RSQ1_SQ13                          ((uint32_t)0x0000001F)        /*!< SQ13[4:0] bits (13th conversion in regular sequence) */
#define  ADC_RSQ1_SQ13_0                        ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  ADC_RSQ1_SQ13_1                        ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  ADC_RSQ1_SQ13_2                        ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  ADC_RSQ1_SQ13_3                        ((uint32_t)0x00000008)        /*!< Bit 3 */
#define  ADC_RSQ1_SQ13_4                        ((uint32_t)0x00000010)        /*!< Bit 4 */

#define  ADC_RSQ1_SQ14                          ((uint32_t)0x000003E0)        /*!< SQ14[4:0] bits (14th conversion in regular sequence) */
#define  ADC_RSQ1_SQ14_0                        ((uint32_t)0x00000020)        /*!< Bit 0 */
#define  ADC_RSQ1_SQ14_1                        ((uint32_t)0x00000040)        /*!< Bit 1 */
#define  ADC_RSQ1_SQ14_2                        ((uint32_t)0x00000080)        /*!< Bit 2 */
#define  ADC_RSQ1_SQ14_3                        ((uint32_t)0x00000100)        /*!< Bit 3 */
#define  ADC_RSQ1_SQ14_4                        ((uint32_t)0x00000200)        /*!< Bit 4 */

#define  ADC_RSQ1_SQ15                          ((uint32_t)0x00007C00)        /*!< SQ15[4:0] bits (15th conversion in regular sequence) */
#define  ADC_RSQ1_SQ15_0                        ((uint32_t)0x00000400)        /*!< Bit 0 */
#define  ADC_RSQ1_SQ15_1                        ((uint32_t)0x00000800)        /*!< Bit 1 */
#define  ADC_RSQ1_SQ15_2                        ((uint32_t)0x00001000)        /*!< Bit 2 */
#define  ADC_RSQ1_SQ15_3                        ((uint32_t)0x00002000)        /*!< Bit 3 */
#define  ADC_RSQ1_SQ15_4                        ((uint32_t)0x00004000)        /*!< Bit 4 */

#define  ADC_RSQ1_SQ16                          ((uint32_t)0x000F8000)        /*!< SQ16[4:0] bits (16th conversion in regular sequence) */
#define  ADC_RSQ1_SQ16_0                        ((uint32_t)0x00008000)        /*!< Bit 0 */
#define  ADC_RSQ1_SQ16_1                        ((uint32_t)0x00010000)        /*!< Bit 1 */
#define  ADC_RSQ1_SQ16_2                        ((uint32_t)0x00020000)        /*!< Bit 2 */
#define  ADC_RSQ1_SQ16_3                        ((uint32_t)0x00040000)        /*!< Bit 3 */
#define  ADC_RSQ1_SQ16_4                        ((uint32_t)0x00080000)        /*!< Bit 4 */

#define  ADC_RSQ1_LEN                           ((uint32_t)0x00F00000)        /*!< L[3:0] bits (Regular channel sequence length) */
#define  ADC_RSQ1_LEN_0                         ((uint32_t)0x00100000)        /*!< Bit 0 */
#define  ADC_RSQ1_LEN_1                         ((uint32_t)0x00200000)        /*!< Bit 1 */
#define  ADC_RSQ1_LEN_2                         ((uint32_t)0x00400000)        /*!< Bit 2 */
#define  ADC_RSQ1_LEN_3                         ((uint32_t)0x00800000)        /*!< Bit 3 */

/*******************  Bit definition for ADC_RSQ2 register  *******************/
#define  ADC_RSQ2_SQ7                           ((uint32_t)0x0000001F)        /*!< SQ7[4:0] bits (7th conversion in regular sequence) */
#define  ADC_RSQ2_SQ7_0                         ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  ADC_RSQ2_SQ7_1                         ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  ADC_RSQ2_SQ7_2                         ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  ADC_RSQ2_SQ7_3                         ((uint32_t)0x00000008)        /*!< Bit 3 */
#define  ADC_RSQ2_SQ7_4                         ((uint32_t)0x00000010)        /*!< Bit 4 */

#define  ADC_RSQ2_SQ8                           ((uint32_t)0x000003E0)        /*!< SQ8[4:0] bits (8th conversion in regular sequence) */
#define  ADC_RSQ2_SQ8_0                         ((uint32_t)0x00000020)        /*!< Bit 0 */
#define  ADC_RSQ2_SQ8_1                         ((uint32_t)0x00000040)        /*!< Bit 1 */
#define  ADC_RSQ2_SQ8_2                         ((uint32_t)0x00000080)        /*!< Bit 2 */
#define  ADC_RSQ2_SQ8_3                         ((uint32_t)0x00000100)        /*!< Bit 3 */
#define  ADC_RSQ2_SQ8_4                         ((uint32_t)0x00000200)        /*!< Bit 4 */

#define  ADC_RSQ2_SQ9                           ((uint32_t)0x00007C00)        /*!< SQ9[4:0] bits (9th conversion in regular sequence) */
#define  ADC_RSQ2_SQ9_0                         ((uint32_t)0x00000400)        /*!< Bit 0 */
#define  ADC_RSQ2_SQ9_1                         ((uint32_t)0x00000800)        /*!< Bit 1 */
#define  ADC_RSQ2_SQ9_2                         ((uint32_t)0x00001000)        /*!< Bit 2 */
#define  ADC_RSQ2_SQ9_3                         ((uint32_t)0x00002000)        /*!< Bit 3 */
#define  ADC_RSQ2_SQ9_4                         ((uint32_t)0x00004000)        /*!< Bit 4 */

#define  ADC_RSQ2_SQ10                          ((uint32_t)0x000F8000)        /*!< SQ10[4:0] bits (10th conversion in regular sequence) */
#define  ADC_RSQ2_SQ10_0                        ((uint32_t)0x00008000)        /*!< Bit 0 */
#define  ADC_RSQ2_SQ10_1                        ((uint32_t)0x00010000)        /*!< Bit 1 */
#define  ADC_RSQ2_SQ10_2                        ((uint32_t)0x00020000)        /*!< Bit 2 */
#define  ADC_RSQ2_SQ10_3                        ((uint32_t)0x00040000)        /*!< Bit 3 */
#define  ADC_RSQ2_SQ10_4                        ((uint32_t)0x00080000)        /*!< Bit 4 */

#define  ADC_RSQ2_SQ11                          ((uint32_t)0x01F00000)        /*!< SQ11[4:0] bits (11th conversion in regular sequence) */
#define  ADC_RSQ2_SQ11_0                        ((uint32_t)0x00100000)        /*!< Bit 0 */
#define  ADC_RSQ2_SQ11_1                        ((uint32_t)0x00200000)        /*!< Bit 1 */
#define  ADC_RSQ2_SQ11_2                        ((uint32_t)0x00400000)        /*!< Bit 2 */
#define  ADC_RSQ2_SQ11_3                        ((uint32_t)0x00800000)        /*!< Bit 3 */
#define  ADC_RSQ2_SQ11_4                        ((uint32_t)0x01000000)        /*!< Bit 4 */

