RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#define  ADC_RSQ2_SQ12                          ((uint32_t)0x3E000000)        /*!< SQ12[4:0] bits (12th conversion in regular sequence) */
#define  ADC_RSQ2_SQ12_0                        ((uint32_t)0x02000000)        /*!< Bit 0 */
#define  ADC_RSQ2_SQ12_1                        ((uint32_t)0x04000000)        /*!< Bit 1 */
#define  ADC_RSQ2_SQ12_2                        ((uint32_t)0x08000000)        /*!< Bit 2 */
#define  ADC_RSQ2_SQ12_3                        ((uint32_t)0x10000000)        /*!< Bit 3 */
#define  ADC_RSQ2_SQ12_4                        ((uint32_t)0x20000000)        /*!< Bit 4 */

/*******************  Bit definition for ADC_RSQ3 register  *******************/
#define  ADC_RSQ3_SQ1                           ((uint32_t)0x0000001F)        /*!< SQ1[4:0] bits (1st conversion in regular sequence) */
#define  ADC_RSQ3_SQ1_0                         ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  ADC_RSQ3_SQ1_1                         ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  ADC_RSQ3_SQ1_2                         ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  ADC_RSQ3_SQ1_3                         ((uint32_t)0x00000008)        /*!< Bit 3 */
#define  ADC_RSQ3_SQ1_4                         ((uint32_t)0x00000010)        /*!< Bit 4 */

#define  ADC_RSQ3_SQ2                           ((uint32_t)0x000003E0)        /*!< SQ2[4:0] bits (2nd conversion in regular sequence) */
#define  ADC_RSQ3_SQ2_0                         ((uint32_t)0x00000020)        /*!< Bit 0 */
#define  ADC_RSQ3_SQ2_1                         ((uint32_t)0x00000040)        /*!< Bit 1 */
#define  ADC_RSQ3_SQ2_2                         ((uint32_t)0x00000080)        /*!< Bit 2 */
#define  ADC_RSQ3_SQ2_3                         ((uint32_t)0x00000100)        /*!< Bit 3 */
#define  ADC_RSQ3_SQ2_4                         ((uint32_t)0x00000200)        /*!< Bit 4 */

#define  ADC_RSQ3_SQ3                           ((uint32_t)0x00007C00)        /*!< SQ3[4:0] bits (3rd conversion in regular sequence) */
#define  ADC_RSQ3_SQ3_0                         ((uint32_t)0x00000400)        /*!< Bit 0 */
#define  ADC_RSQ3_SQ3_1                         ((uint32_t)0x00000800)        /*!< Bit 1 */
#define  ADC_RSQ3_SQ3_2                         ((uint32_t)0x00001000)        /*!< Bit 2 */
#define  ADC_RSQ3_SQ3_3                         ((uint32_t)0x00002000)        /*!< Bit 3 */
#define  ADC_RSQ3_SQ3_4                         ((uint32_t)0x00004000)        /*!< Bit 4 */

#define  ADC_RSQ3_SQ4                           ((uint32_t)0x000F8000)        /*!< SQ4[4:0] bits (4th conversion in regular sequence) */
#define  ADC_RSQ3_SQ4_0                         ((uint32_t)0x00008000)        /*!< Bit 0 */
#define  ADC_RSQ3_SQ4_1                         ((uint32_t)0x00010000)        /*!< Bit 1 */
#define  ADC_RSQ3_SQ4_2                         ((uint32_t)0x00020000)        /*!< Bit 2 */
#define  ADC_RSQ3_SQ4_3                         ((uint32_t)0x00040000)        /*!< Bit 3 */
#define  ADC_RSQ3_SQ4_4                         ((uint32_t)0x00080000)        /*!< Bit 4 */

#define  ADC_RSQ3_SQ5                           ((uint32_t)0x01F00000)        /*!< SQ5[4:0] bits (5th conversion in regular sequence) */
#define  ADC_RSQ3_SQ5_0                         ((uint32_t)0x00100000)        /*!< Bit 0 */
#define  ADC_RSQ3_SQ5_1                         ((uint32_t)0x00200000)        /*!< Bit 1 */
#define  ADC_RSQ3_SQ5_2                         ((uint32_t)0x00400000)        /*!< Bit 2 */
#define  ADC_RSQ3_SQ5_3                         ((uint32_t)0x00800000)        /*!< Bit 3 */
#define  ADC_RSQ3_SQ5_4                         ((uint32_t)0x01000000)        /*!< Bit 4 */

#define  ADC_RSQ3_SQ6                           ((uint32_t)0x3E000000)        /*!< SQ6[4:0] bits (6th conversion in regular sequence) */
#define  ADC_RSQ3_SQ6_0                         ((uint32_t)0x02000000)        /*!< Bit 0 */
#define  ADC_RSQ3_SQ6_1                         ((uint32_t)0x04000000)        /*!< Bit 1 */
#define  ADC_RSQ3_SQ6_2                         ((uint32_t)0x08000000)        /*!< Bit 2 */
#define  ADC_RSQ3_SQ6_3                         ((uint32_t)0x10000000)        /*!< Bit 3 */
#define  ADC_RSQ3_SQ6_4                         ((uint32_t)0x20000000)        /*!< Bit 4 */

/*******************  Bit definition for ADC_JSQ register  *******************/
#define  ADC_JSQ_JSQ1                           ((uint32_t)0x0000001F)        /*!< JSQ1[4:0] bits (1st conversion in injected sequence) */
#define  ADC_JSQ_JSQ1_0                         ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  ADC_JSQ_JSQ1_1                         ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  ADC_JSQ_JSQ1_2                         ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  ADC_JSQ_JSQ1_3                         ((uint32_t)0x00000008)        /*!< Bit 3 */
#define  ADC_JSQ_JSQ1_4                         ((uint32_t)0x00000010)        /*!< Bit 4 */

#define  ADC_JSQ_JSQ2                           ((uint32_t)0x000003E0)        /*!< JSQ2[4:0] bits (2nd conversion in injected sequence) */
#define  ADC_JSQ_JSQ2_0                         ((uint32_t)0x00000020)        /*!< Bit 0 */
#define  ADC_JSQ_JSQ2_1                         ((uint32_t)0x00000040)        /*!< Bit 1 */
#define  ADC_JSQ_JSQ2_2                         ((uint32_t)0x00000080)        /*!< Bit 2 */
#define  ADC_JSQ_JSQ2_3                         ((uint32_t)0x00000100)        /*!< Bit 3 */
#define  ADC_JSQ_JSQ2_4                         ((uint32_t)0x00000200)        /*!< Bit 4 */

#define  ADC_JSQ_JSQ3                           ((uint32_t)0x00007C00)        /*!< JSQ3[4:0] bits (3rd conversion in injected sequence) */
#define  ADC_JSQ_JSQ3_0                         ((uint32_t)0x00000400)        /*!< Bit 0 */
#define  ADC_JSQ_JSQ3_1                         ((uint32_t)0x00000800)        /*!< Bit 1 */
#define  ADC_JSQ_JSQ3_2                         ((uint32_t)0x00001000)        /*!< Bit 2 */
#define  ADC_JSQ_JSQ3_3                         ((uint32_t)0x00002000)        /*!< Bit 3 */
#define  ADC_JSQ_JSQ3_4                         ((uint32_t)0x00004000)        /*!< Bit 4 */

#define  ADC_JSQ_JSQ4                           ((uint32_t)0x000F8000)        /*!< JSQ4[4:0] bits (4th conversion in injected sequence) */
#define  ADC_JSQ_JSQ4_0                         ((uint32_t)0x00008000)        /*!< Bit 0 */
#define  ADC_JSQ_JSQ4_1                         ((uint32_t)0x00010000)        /*!< Bit 1 */
#define  ADC_JSQ_JSQ4_2                         ((uint32_t)0x00020000)        /*!< Bit 2 */
#define  ADC_JSQ_JSQ4_3                         ((uint32_t)0x00040000)        /*!< Bit 3 */
#define  ADC_JSQ_JSQ4_4                         ((uint32_t)0x00080000)        /*!< Bit 4 */

#define  ADC_JSQ_JLEN                           ((uint32_t)0x00300000)        /*!< JL[1:0] bits (Injected Sequence length) */
#define  ADC_JSQ_JLEN_0                         ((uint32_t)0x00100000)        /*!< Bit 0 */
#define  ADC_JSQ_JLEN_1                         ((uint32_t)0x00200000)        /*!< Bit 1 */

/*******************  Bit definition for ADC_JDOR1 register  *******************/
#define  ADC_JDOR1_JD                           ((uint16_t)0xFFFF)            /*!< Injected data */

/*******************  Bit definition for ADC_JDOR2 register  *******************/
#define  ADC_JDOR2_JD                           ((uint16_t)0xFFFF)            /*!< Injected data */

/*******************  Bit definition for ADC_JDOR3 register  *******************/
#define  ADC_JDOR3_JD                           ((uint16_t)0xFFFF)            /*!< Injected data */

/*******************  Bit definition for ADC_JDOR4 register  *******************/
#define  ADC_JDOR4_JD                           ((uint16_t)0xFFFF)            /*!< Injected data */

/********************  Bit definition for ADC_RDOR register  ********************/
#define  ADC_RDOR_D                             ((uint32_t)0x0000FFFF)        /*!< Regular data */
#define  ADC_RDOR_AD2D                          ((uint32_t)0xFFFF0000)        /*!< ADC2 data */

/******************************************************************************/
/*                                                                            */
/*                      Digital to Analog Converter                           */
/*                                                                            */
/******************************************************************************/

/********************  Bit definition for DAC_CTRL register  ********************/
#define  DAC_CTRL_EN1                           ((uint32_t)0x00000001)        /*!< DAC channel1 enable */
#define  DAC_CTRL_BF1                           ((uint32_t)0x00000002)        /*!< DAC channel1 output buffer disable */
#define  DAC_CTRL_TEN1                          ((uint32_t)0x00000004)        /*!< DAC channel1 Trigger enable */

#define  DAC_CTRL_TGSL1                         ((uint32_t)0x00000038)        /*!< TSEL1[2:0] (DAC channel1 Trigger selection) */
#define  DAC_CTRL_TGSL1_0                       ((uint32_t)0x00000008)        /*!< Bit 0 */
#define  DAC_CTRL_TGSL1_1                       ((uint32_t)0x00000010)        /*!< Bit 1 */
#define  DAC_CTRL_TGSL1_2                       ((uint32_t)0x00000020)        /*!< Bit 2 */

#define  DAC_CTRL_WAVE1                         ((uint32_t)0x000000C0)        /*!< WAVE1[1:0] (DAC channel1 noise/triangle wave generation enable) */
#define  DAC_CTRL_WAVE1_0                       ((uint32_t)0x00000040)        /*!< Bit 0 */
#define  DAC_CTRL_WAVE1_1                       ((uint32_t)0x00000080)        /*!< Bit 1 */

#define  DAC_CTRL_MAMS1                         ((uint32_t)0x00000F00)        /*!< MAMP1[3:0] (DAC channel1 Mask/Amplitude selector) */
#define  DAC_CTRL_MAMS1_0                       ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  DAC_CTRL_MAMS1_1                       ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  DAC_CTRL_MAMS1_2                       ((uint32_t)0x00000400)        /*!< Bit 2 */
#define  DAC_CTRL_MAMS1_3                       ((uint32_t)0x00000800)        /*!< Bit 3 */

#define  DAC_CTRL_DMAEN1                        ((uint32_t)0x00001000)        /*!< DAC channel1 DMA enable */
#define  DAC_CTRL_EN2                           ((uint32_t)0x00010000)        /*!< DAC channel2 enable */
#define  DAC_CTRL_BF2                           ((uint32_t)0x00020000)        /*!< DAC channel2 output buffer disable */
#define  DAC_CTRL_TEN2                          ((uint32_t)0x00040000)        /*!< DAC channel2 Trigger enable */

#define  DAC_CTRL_TGSL2                         ((uint32_t)0x00380000)        /*!< TSEL2[2:0] (DAC channel2 Trigger selection) */
#define  DAC_CTRL_TGSL2_0                       ((uint32_t)0x00080000)        /*!< Bit 0 */
#define  DAC_CTRL_TGSL2_1                       ((uint32_t)0x00100000)        /*!< Bit 1 */
#define  DAC_CTRL_TGSL2_2                       ((uint32_t)0x00200000)        /*!< Bit 2 */

#define  DAC_CTRL_WAVE2                         ((uint32_t)0x00C00000)        /*!< WAVE2[1:0] (DAC channel2 noise/triangle wave generation enable) */
#define  DAC_CTRL_WAVE2_0                       ((uint32_t)0x00400000)        /*!< Bit 0 */
#define  DAC_CTRL_WAVE2_1                       ((uint32_t)0x00800000)        /*!< Bit 1 */

#define  DAC_CTRL_MAMS2                         ((uint32_t)0x0F000000)        /*!< MAMP2[3:0] (DAC channel2 Mask/Amplitude selector) */
#define  DAC_CTRL_MAMS2_0                       ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  DAC_CTRL_MAMS2_1                       ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  DAC_CTRL_MAMS2_2                       ((uint32_t)0x04000000)        /*!< Bit 2 */
#define  DAC_CTRL_MAMS2_3                       ((uint32_t)0x08000000)        /*!< Bit 3 */

#define  DAC_CTRL_DMAEN2                        ((uint32_t)0x10000000)        /*!< DAC channel2 DMA enabled */

/*****************  Bit definition for DAC_SWTRG register  ******************/
#define  DAC_SWTRG_SWTRG1                       ((uint8_t)0x01)               /*!< DAC channel1 software trigger */
#define  DAC_SWTRG_SWTRG2                       ((uint8_t)0x02)               /*!< DAC channel2 software trigger */

/*****************  Bit definition for DAC_HDR12R1 register  ******************/
#define  DAC_HDR12R1_D1HDR                      ((uint16_t)0x0FFF)            /*!< DAC channel1 12-bit Right aligned data */

/*****************  Bit definition for DAC_HDR12L1register  ******************/
#define  DAC_HDR12L1_D1HDR                      ((uint16_t)0xFFF0)            /*!< DAC channel1 12-bit Left aligned data */

/******************  Bit definition for DAC_HDR8R1 register  ******************/
#define  DAC_HDR8R1_D1HDR                       ((uint8_t)0xFF)               /*!< DAC channel1 8-bit Right aligned data */

/*****************  Bit definition for DAC_HDR12R2 register  ******************/
#define  DAC_HDR12R2_D2HDR                      ((uint16_t)0x0FFF)            /*!< DAC channel2 12-bit Right aligned data */

