RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/*****************  Bit definition for DAC_HDR12L2 register  ******************/
#define  DAC_HDR12L2_D2HDR                      ((uint16_t)0xFFF0)            /*!< DAC channel2 12-bit Left aligned data */

/******************  Bit definition for DAC_HDR8R2 register  ******************/
#define  DAC_HDR8R2_D2HDR                       ((uint8_t)0xFF)               /*!< DAC channel2 8-bit Right aligned data */

/*****************  Bit definition for DAC_HDR12RD register  ******************/
#define  DAC_HDR12RD_D1HDR                      ((uint32_t)0x00000FFF)        /*!< DAC channel1 12-bit Right aligned data */
#define  DAC_HDR12RD_D2HDR                      ((uint32_t)0x0FFF0000)        /*!< DAC channel2 12-bit Right aligned data */

/*****************  Bit definition for DAC_HDR12LD register  ******************/
#define  DAC_HDR12LD_D1HDR                      ((uint32_t)0x0000FFF0)        /*!< DAC channel1 12-bit Left aligned data */
#define  DAC_HDR12LD_D2HDR                      ((uint32_t)0xFFF00000)        /*!< DAC channel2 12-bit Left aligned data */

/******************  Bit definition for DAC_HDR8RD register  ******************/
#define  DAC_HDR8RD_D1HDR                       ((uint16_t)0x00FF)            /*!< DAC channel1 8-bit Right aligned data */
#define  DAC_HDR8RD_D2HDR                       ((uint16_t)0xFF00)            /*!< DAC channel2 8-bit Right aligned data */

/*******************  Bit definition for DAC_ODT1 register  *******************/
#define  DAC_ODT1_D1ODT                         ((uint16_t)0x0FFF)            /*!< DAC channel1 data output */

/*******************  Bit definition for DAC_ODT2 register  *******************/
#define  DAC_ODT2_D2ODT                         ((uint16_t)0x0FFF)            /*!< DAC channel2 data output */

/********************  Bit definition for DAC_STS register  ********************/
#define  DAC_STS_DMAUDR1                        ((uint32_t)0x00002000)        /*!< DAC channel1 DMA underrun flag */
#define  DAC_STS_DMAUDR2                        ((uint32_t)0x20000000)        /*!< DAC channel2 DMA underrun flag */

/*****************************************************************************/
/*                                                                           */
/*                               Timers (TMR)                                */
/*                                                                           */
/*****************************************************************************/
/*******************  Bit definition for TMR_CTRL1 register  ********************/
#define  TMR_CTRL1_CNTEN                        ((uint16_t)0x0001)            /*!< Counter enable */
#define  TMR_CTRL1_UEVDIS                       ((uint16_t)0x0002)            /*!< Update disable */
#define  TMR_CTRL1_UVERS                        ((uint16_t)0x0004)            /*!< Update request source */
#define  TMR_CTRL1_OPMODE                       ((uint16_t)0x0008)            /*!< One pulse mode */
#define  TMR_CTRL1_DIR                          ((uint16_t)0x0010)            /*!< Direction */

#define  TMR_CTRL1_CMSEL                        ((uint16_t)0x0060)            /*!< CMS[1:0] bits (Center-aligned mode selection) */
#define  TMR_CTRL1_CMSEL_0                      ((uint16_t)0x0020)            /*!< Bit 0 */
#define  TMR_CTRL1_CMSEL_1                      ((uint16_t)0x0040)            /*!< Bit 1 */

#define  TMR_CTRL1_ARPEN                        ((uint16_t)0x0080)            /*!< Auto-reload preload enable */

#define  TMR_CTRL1_CLKDIV                       ((uint16_t)0x0300)            /*!< CKD[1:0] bits (clock division) */
#define  TMR_CTRL1_CLKDIV_0                     ((uint16_t)0x0100)            /*!< Bit 0 */
#define  TMR_CTRL1_CLKDIV_1                     ((uint16_t)0x0200)            /*!< Bit 1 */

#define  TMR_CTRL1_PMEN                         ((uint16_t)0x0400)            /*!< 32bit counter enable */

/*******************  Bit definition for TMR_CTRL2 register  ********************/
#define  TMR_CTRL2_CPC                          ((uint16_t)0x0001)            /*!< Capture/Compare Preloaded Control */
#define  TMR_CTRL2_CUSEL                        ((uint16_t)0x0004)            /*!< Capture/Compare Control Update Selection */
#define  TMR_CTRL2_CDSEL                        ((uint16_t)0x0008)            /*!< Capture/Compare DMA Selection */

#define  TMR_CTRL2_MMSEL                        ((uint16_t)0x0070)            /*!< MMS[2:0] bits (Master Mode Selection) */
#define  TMR_CTRL2_MMSEL_0                      ((uint16_t)0x0010)            /*!< Bit 0 */
#define  TMR_CTRL2_MMSEL_1                      ((uint16_t)0x0020)            /*!< Bit 1 */
#define  TMR_CTRL2_MMSEL_2                      ((uint16_t)0x0040)            /*!< Bit 2 */

#define  TMR_CTRL2_TI1SEL                       ((uint16_t)0x0080)            /*!< TI1 Selection */
#define  TMR_CTRL2_OC1IS                        ((uint16_t)0x0100)            /*!< Output Idle state 1 (OC1 output) */
#define  TMR_CTRL2_OC1NIS                       ((uint16_t)0x0200)            /*!< Output Idle state 1 (OC1N output) */
#define  TMR_CTRL2_OC2IS                        ((uint16_t)0x0400)            /*!< Output Idle state 2 (OC2 output) */
#define  TMR_CTRL2_OC2NIS                       ((uint16_t)0x0800)            /*!< Output Idle state 2 (OC2N output) */
#define  TMR_CTRL2_OC3IS                        ((uint16_t)0x1000)            /*!< Output Idle state 3 (OC3 output) */
#define  TMR_CTRL2_OC3NIS                       ((uint16_t)0x2000)            /*!< Output Idle state 3 (OC3N output) */
#define  TMR_CTRL2_OC4IS                        ((uint16_t)0x4000)            /*!< Output Idle state 4 (OC4 output) */

/*******************  Bit definition for TMR_SMC register  *******************/
#define  TMR_SMC_SMSEL                          ((uint16_t)0x0007)            /*!< SMS[2:0] bits (Slave mode selection) */
#define  TMR_SMC_SMSEL_0                        ((uint16_t)0x0001)            /*!< Bit 0 */
#define  TMR_SMC_SMSEL_1                        ((uint16_t)0x0002)            /*!< Bit 1 */
#define  TMR_SMC_SMSEL_2                        ((uint16_t)0x0004)            /*!< Bit 2 */

#define  TMR_SMC_TRGSEL                         ((uint16_t)0x0070)            /*!< TS[2:0] bits (Trigger selection) */
#define  TMR_SMC_TRGSEL_0                       ((uint16_t)0x0010)            /*!< Bit 0 */
#define  TMR_SMC_TRGSEL_1                       ((uint16_t)0x0020)            /*!< Bit 1 */
#define  TMR_SMC_TRGSEL_2                       ((uint16_t)0x0040)            /*!< Bit 2 */

#define  TMR_SMC_MSMODE                         ((uint16_t)0x0080)            /*!< Master/slave mode */

#define  TMR_SMC_ETDF                           ((uint16_t)0x0F00)            /*!< ETF[3:0] bits (External trigger filter) */
#define  TMR_SMC_ETDF_0                         ((uint16_t)0x0100)            /*!< Bit 0 */
#define  TMR_SMC_ETDF_1                         ((uint16_t)0x0200)            /*!< Bit 1 */
#define  TMR_SMC_ETDF_2                         ((uint16_t)0x0400)            /*!< Bit 2 */
#define  TMR_SMC_ETDF_3                         ((uint16_t)0x0800)            /*!< Bit 3 */

#define  TMR_SMC_ETD                            ((uint16_t)0x3000)            /*!< ETPS[1:0] bits (External trigger prescaler) */
#define  TMR_SMC_ETD_0                          ((uint16_t)0x1000)            /*!< Bit 0 */
#define  TMR_SMC_ETD_1                          ((uint16_t)0x2000)            /*!< Bit 1 */

#define  TMR_SMC_ECLKEN                         ((uint16_t)0x4000)            /*!< External clock enable */
#define  TMR_SMC_ETRGP                          ((uint16_t)0x8000)            /*!< External trigger polarity */

/*******************  Bit definition for TMR_DIE register  *******************/
#define  TMR_DIE_UEVIE                          ((uint16_t)0x0001)            /*!< Update interrupt enable */
#define  TMR_DIE_C1IE                           ((uint16_t)0x0002)            /*!< Capture/Compare 1 interrupt enable */
#define  TMR_DIE_C2IE                           ((uint16_t)0x0004)            /*!< Capture/Compare 2 interrupt enable */
#define  TMR_DIE_C3IE                           ((uint16_t)0x0008)            /*!< Capture/Compare 3 interrupt enable */
#define  TMR_DIE_C4IE                           ((uint16_t)0x0010)            /*!< Capture/Compare 4 interrupt enable */
#define  TMR_DIE_HALLIE                         ((uint16_t)0x0020)            /*!< COM interrupt enable */
#define  TMR_DIE_TRGIE                          ((uint16_t)0x0040)            /*!< Trigger interrupt enable */
#define  TMR_DIE_BRKIE                          ((uint16_t)0x0080)            /*!< Break interrupt enable */
#define  TMR_DIE_UEVDE                          ((uint16_t)0x0100)            /*!< Update DMA request enable */
#define  TMR_DIE_C1DE                           ((uint16_t)0x0200)            /*!< Capture/Compare 1 DMA request enable */
#define  TMR_DIE_C2DE                           ((uint16_t)0x0400)            /*!< Capture/Compare 2 DMA request enable */
#define  TMR_DIE_C3DE                           ((uint16_t)0x0800)            /*!< Capture/Compare 3 DMA request enable */
#define  TMR_DIE_C4DE                           ((uint16_t)0x1000)            /*!< Capture/Compare 4 DMA request enable */
#define  TMR_DIE_HALLDE                         ((uint16_t)0x2000)            /*!< COM DMA request enable */
#define  TMR_DIE_TRGDE                          ((uint16_t)0x4000)            /*!< Trigger DMA request enable */

/********************  Bit definition for TMR_STS register  ********************/
#define  TMR_STS_UEVIF                          ((uint16_t)0x0001)            /*!< Update interrupt Flag */
#define  TMR_STS_C1IF                           ((uint16_t)0x0002)            /*!< Capture/Compare 1 interrupt Flag */
#define  TMR_STS_C2IF                           ((uint16_t)0x0004)            /*!< Capture/Compare 2 interrupt Flag */
#define  TMR_STS_C3IF                           ((uint16_t)0x0008)            /*!< Capture/Compare 3 interrupt Flag */
#define  TMR_STS_C4IF                           ((uint16_t)0x0010)            /*!< Capture/Compare 4 interrupt Flag */
#define  TMR_STS_HALLIF                         ((uint16_t)0x0020)            /*!< COM interrupt Flag */
#define  TMR_STS_TRGIF                          ((uint16_t)0x0040)            /*!< Trigger interrupt Flag */
#define  TMR_STS_BRKIF                          ((uint16_t)0x0080)            /*!< Break interrupt Flag */
#define  TMR_STS_C1OF                           ((uint16_t)0x0200)            /*!< Capture/Compare 1 Overcapture Flag */
#define  TMR_STS_C2OF                           ((uint16_t)0x0400)            /*!< Capture/Compare 2 Overcapture Flag */
#define  TMR_STS_C3OF                           ((uint16_t)0x0800)            /*!< Capture/Compare 3 Overcapture Flag */
#define  TMR_STS_C4OF                           ((uint16_t)0x1000)            /*!< Capture/Compare 4 Overcapture Flag */

