RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/*******************  Bit definition for TMR_EVEG register  ********************/
#define  TMR_EVEG_UEVG                          ((uint8_t)0x01)               /*!< Update Generation */
#define  TMR_EVEG_C1G                           ((uint8_t)0x02)               /*!< Capture/Compare 1 Generation */
#define  TMR_EVEG_C2G                           ((uint8_t)0x04)               /*!< Capture/Compare 2 Generation */
#define  TMR_EVEG_C3G                           ((uint8_t)0x08)               /*!< Capture/Compare 3 Generation */
#define  TMR_EVEG_C4G                           ((uint8_t)0x10)               /*!< Capture/Compare 4 Generation */
#define  TMR_EVEG_HALLG                         ((uint8_t)0x20)               /*!< Capture/Compare Control Update Generation */
#define  TMR_EVEG_TRGG                          ((uint8_t)0x40)               /*!< Trigger Generation */
#define  TMR_EVEG_BRKG                          ((uint8_t)0x80)               /*!< Break Generation */

/******************  Bit definition for TMR_CCM1 register  *******************/
#define  TMR_CCM1_C1SEL                         ((uint16_t)0x0003)            /*!< CC1S[1:0] bits (Capture/Compare 1 Selection) */
#define  TMR_CCM1_C1SEL_0                       ((uint16_t)0x0001)            /*!< Bit 0 */
#define  TMR_CCM1_C1SEL_1                       ((uint16_t)0x0002)            /*!< Bit 1 */

#define  TMR_CCM1_OC1FEN                        ((uint16_t)0x0004)            /*!< Output Compare 1 Fast enable */
#define  TMR_CCM1_OC1PEN                        ((uint16_t)0x0008)            /*!< Output Compare 1 Preload enable */

#define  TMR_CCM1_OC1MODE                       ((uint16_t)0x0070)            /*!< OC1M[2:0] bits (Output Compare 1 Mode) */
#define  TMR_CCM1_OC1MODE_0                     ((uint16_t)0x0010)            /*!< Bit 0 */
#define  TMR_CCM1_OC1MODE_1                     ((uint16_t)0x0020)            /*!< Bit 1 */
#define  TMR_CCM1_OC1MODE_2                     ((uint16_t)0x0040)            /*!< Bit 2 */

#define  TMR_CCM1_C1CDIS                        ((uint16_t)0x0080)            /*!< Output Compare 1Clear Enable */

#define  TMR_CCM1_C2SEL                         ((uint16_t)0x0300)            /*!< CC2S[1:0] bits (Capture/Compare 2 Selection) */
#define  TMR_CCM1_C2SEL_0                       ((uint16_t)0x0100)            /*!< Bit 0 */
#define  TMR_CCM1_C2SEL_1                       ((uint16_t)0x0200)            /*!< Bit 1 */

#define  TMR_CCM1_OC2FNE                        ((uint16_t)0x0400)            /*!< Output Compare 2 Fast enable */
#define  TMR_CCM1_OC2PEN                        ((uint16_t)0x0800)            /*!< Output Compare 2 Preload enable */

#define  TMR_CCM1_OC2MODE                       ((uint16_t)0x7000)            /*!< OC2M[2:0] bits (Output Compare 2 Mode) */
#define  TMR_CCM1_OC2MODE_0                     ((uint16_t)0x1000)            /*!< Bit 0 */
#define  TMR_CCM1_OC2MODE_1                     ((uint16_t)0x2000)            /*!< Bit 1 */
#define  TMR_CCM1_OC2MODE_2                     ((uint16_t)0x4000)            /*!< Bit 2 */

#define  TMR_CCM1_OC2CDIS                       ((uint16_t)0x8000)            /*!< Output Compare 2 Clear Enable */

/*----------------------------------------------------------------------------*/

#define  TMR_CCM1_IC1DIV                        ((uint16_t)0x000C)            /*!< IC1PSC[1:0] bits (Input Capture 1 Prescaler) */
#define  TMR_CCM1_IC1DIV_0                      ((uint16_t)0x0004)            /*!< Bit 0 */
#define  TMR_CCM1_IC1DIV_1                      ((uint16_t)0x0008)            /*!< Bit 1 */

#define  TMR_CCM1_IC1F                          ((uint16_t)0x00F0)            /*!< IC1F[3:0] bits (Input Capture 1 Filter) */
#define  TMR_CCM1_IC1F_0                        ((uint16_t)0x0010)            /*!< Bit 0 */
#define  TMR_CCM1_IC1F_1                        ((uint16_t)0x0020)            /*!< Bit 1 */
#define  TMR_CCM1_IC1F_2                        ((uint16_t)0x0040)            /*!< Bit 2 */
#define  TMR_CCM1_IC1F_3                        ((uint16_t)0x0080)            /*!< Bit 3 */

#define  TMR_CCM1_IC2DIV                        ((uint16_t)0x0C00)            /*!< IC2PSC[1:0] bits (Input Capture 2 Prescaler) */
#define  TMR_CCM1_IC2DIV_0                      ((uint16_t)0x0400)            /*!< Bit 0 */
#define  TMR_CCM1_IC2DIVC_1                     ((uint16_t)0x0800)            /*!< Bit 1 */

#define  TMR_CCM1_IC2DF                         ((uint16_t)0xF000)            /*!< IC2F[3:0] bits (Input Capture 2 Filter) */
#define  TMR_CCM1_IC2DF_0                       ((uint16_t)0x1000)            /*!< Bit 0 */
#define  TMR_CCM1_IC2DF_1                       ((uint16_t)0x2000)            /*!< Bit 1 */
#define  TMR_CCM1_IC2DF_2                       ((uint16_t)0x4000)            /*!< Bit 2 */
#define  TMR_CCM1_IC2DF_3                       ((uint16_t)0x8000)            /*!< Bit 3 */

/******************  Bit definition for TMR_CCM2 register  *******************/
#define  TMR_CCM2_C3SEL                         ((uint16_t)0x0003)            /*!< CC3S[1:0] bits (Capture/Compare 3 Selection) */
#define  TMR_CCM2_C3SEL_0                       ((uint16_t)0x0001)            /*!< Bit 0 */
#define  TMR_CCM2_C3SEL_1                       ((uint16_t)0x0002)            /*!< Bit 1 */

#define  TMR_CCM2_OC3FEN                        ((uint16_t)0x0004)            /*!< Output Compare 3 Fast enable */
#define  TMR_CCM2_OC3PEN                        ((uint16_t)0x0008)            /*!< Output Compare 3 Preload enable */

#define  TMR_CCM2_OC3MODE                       ((uint16_t)0x0070)            /*!< OC3M[2:0] bits (Output Compare 3 Mode) */
#define  TMR_CCM2_OC3MODE_0                     ((uint16_t)0x0010)            /*!< Bit 0 */
#define  TMR_CCM2_OC3MODE_1                     ((uint16_t)0x0020)            /*!< Bit 1 */
#define  TMR_CCM2_OC3MODE_2                     ((uint16_t)0x0040)            /*!< Bit 2 */

#define  TMR_CCM2_OC3CDIS                       ((uint16_t)0x0080)            /*!< Output Compare 3 Clear Enable */

#define  TMR_CCM2_CC4S                          ((uint16_t)0x0300)            /*!< CC4S[1:0] bits (Capture/Compare 4 Selection) */
#define  TMR_CCM2_CC4S_0                        ((uint16_t)0x0100)            /*!< Bit 0 */
#define  TMR_CCM2_CC4S_1                        ((uint16_t)0x0200)            /*!< Bit 1 */

#define  TMR_CCM2_OC4FE                         ((uint16_t)0x0400)            /*!< Output Compare 4 Fast enable */
#define  TMR_CCM2_OC4PE                         ((uint16_t)0x0800)            /*!< Output Compare 4 Preload enable */

#define  TMR_CCM2_OC4MODE                       ((uint16_t)0x7000)            /*!< OC4M[2:0] bits (Output Compare 4 Mode) */
#define  TMR_CCM2_OC4MODE_0                     ((uint16_t)0x1000)            /*!< Bit 0 */
#define  TMR_CCM2_OC4MODE_1                     ((uint16_t)0x2000)            /*!< Bit 1 */
#define  TMR_CCM2_OC4MODE_2                     ((uint16_t)0x4000)            /*!< Bit 2 */

#define  TMR_CCM2_OC4CDIS                       ((uint16_t)0x8000)            /*!< Output Compare 4 Clear Enable */

