RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/*----------------------------------------------------------------------------*/

#define  TMR_CCM2_IC3DIV                        ((uint16_t)0x000C)            /*!< IC3PSC[1:0] bits (Input Capture 3 Prescaler) */
#define  TMR_CCM2_IC3DIV_0                      ((uint16_t)0x0004)            /*!< Bit 0 */
#define  TMR_CCM2_IC3DIV_1                      ((uint16_t)0x0008)            /*!< Bit 1 */

#define  TMR_CCM2_IC3DF                         ((uint16_t)0x00F0)            /*!< IC3F[3:0] bits (Input Capture 3 Filter) */
#define  TMR_CCM2_IC3DF_0                       ((uint16_t)0x0010)            /*!< Bit 0 */
#define  TMR_CCM2_IC3DF_1                       ((uint16_t)0x0020)            /*!< Bit 1 */
#define  TMR_CCM2_IC3DF_2                       ((uint16_t)0x0040)            /*!< Bit 2 */
#define  TMR_CCM2_IC3DF_3                       ((uint16_t)0x0080)            /*!< Bit 3 */

#define  TMR_CCM2_IC4DIV                        ((uint16_t)0x0C00)            /*!< IC4PSC[1:0] bits (Input Capture 4 Prescaler) */
#define  TMR_CCM2_IC4DIV_0                      ((uint16_t)0x0400)            /*!< Bit 0 */
#define  TMR_CCM2_IC4DIV_1                      ((uint16_t)0x0800)            /*!< Bit 1 */

#define  TMR_CCM2_IC4DF                         ((uint16_t)0xF000)            /*!< IC4F[3:0] bits (Input Capture 4 Filter) */
#define  TMR_CCM2_IC4DF_0                       ((uint16_t)0x1000)            /*!< Bit 0 */
#define  TMR_CCM2_IC4DF_1                       ((uint16_t)0x2000)            /*!< Bit 1 */
#define  TMR_CCM2_IC4DF_2                       ((uint16_t)0x4000)            /*!< Bit 2 */
#define  TMR_CCM2_IC4DF_3                       ((uint16_t)0x8000)            /*!< Bit 3 */

/*******************  Bit definition for TMR_CCE register  *******************/
#define  TMR_CCE_C1EN                           ((uint16_t)0x0001)            /*!< Capture/Compare 1 output enable */
#define  TMR_CCE_C1P                            ((uint16_t)0x0002)            /*!< Capture/Compare 1 output Polarity */
#define  TMR_CCE_C1NEN                           ((uint16_t)0x0004)            /*!< Capture/Compare 1 Complementary output enable */
#define  TMR_CCE_C1NP                           ((uint16_t)0x0008)            /*!< Capture/Compare 1 Complementary output Polarity */
#define  TMR_CCE_C2EN                           ((uint16_t)0x0010)            /*!< Capture/Compare 2 output enable */
#define  TMR_CCE_C2P                            ((uint16_t)0x0020)            /*!< Capture/Compare 2 output Polarity */
#define  TMR_CCE_C2NEN                          ((uint16_t)0x0040)            /*!< Capture/Compare 2 Complementary output enable */
#define  TMR_CCE_C2NP                           ((uint16_t)0x0080)            /*!< Capture/Compare 2 Complementary output Polarity */
#define  TMR_CCE_C3EN                           ((uint16_t)0x0100)            /*!< Capture/Compare 3 output enable */
#define  TMR_CCE_C3P                            ((uint16_t)0x0200)            /*!< Capture/Compare 3 output Polarity */
#define  TMR_CCE_C3NEN                          ((uint16_t)0x0400)            /*!< Capture/Compare 3 Complementary output enable */
#define  TMR_CCE_C3NP                           ((uint16_t)0x0800)            /*!< Capture/Compare 3 Complementary output Polarity */
#define  TMR_CCE_C4EN                           ((uint16_t)0x1000)            /*!< Capture/Compare 4 output enable */
#define  TMR_CCE_C4P                            ((uint16_t)0x2000)            /*!< Capture/Compare 4 output Polarity */
#define  TMR_CCE_C4NP                           ((uint16_t)0x8000)            /*!< Capture/Compare 4 Complementary output Polarity */

/*******************  Bit definition for TMR_CNT register  ********************/
#define  TMR_CNT_CNT                            ((uint16_t)0xFFFF)            /*!< Counter Value */

/*******************  Bit definition for TMR_DIV register  ********************/
#define  TMR_DIV_DIV                            ((uint16_t)0xFFFF)            /*!< Prescaler Value */

/*******************  Bit definition for TMR_AR register  ********************/
#define  TMR_AR_AR                              ((uint16_t)0xFFFF)            /*!< actual auto-reload Value */

/*******************  Bit definition for TMR_RC register  ********************/
#define  TMR_RC_RC                              ((uint8_t)0xFF)               /*!< Repetition Counter Value */

/*******************  Bit definition for TMR_CC1 register  *******************/
#define  TMR_CC1_CC1                            ((uint16_t)0xFFFF)            /*!< Capture/Compare 1 Value */

/*******************  Bit definition for TMR_CC2 register  *******************/
#define  TMR_CC2_CC2                            ((uint16_t)0xFFFF)            /*!< Capture/Compare 2 Value */

/*******************  Bit definition for TMR_CC3 register  *******************/
#define  TMR_CC3_CC3                            ((uint16_t)0xFFFF)            /*!< Capture/Compare 3 Value */

/*******************  Bit definition for TMR_CC4 register  *******************/
#define  TMR_CC4_CC4                            ((uint16_t)0xFFFF)            /*!< Capture/Compare 4 Value */

/*******************  Bit definition for TMR_BRKDT register  *******************/
#define  TMR_BRKDT_DTGS                         ((uint16_t)0x00FF)            /*!< DTG[0:7] bits (Dead-Time Generator set-up) */
#define  TMR_BRKDT_DTGS_0                       ((uint16_t)0x0001)            /*!< Bit 0 */
#define  TMR_BRKDT_DTGS_1                       ((uint16_t)0x0002)            /*!< Bit 1 */
#define  TMR_BRKDT_DTGS_2                       ((uint16_t)0x0004)            /*!< Bit 2 */
#define  TMR_BRKDT_DTGS_3                       ((uint16_t)0x0008)            /*!< Bit 3 */
#define  TMR_BRKDT_DTGS_4                       ((uint16_t)0x0010)            /*!< Bit 4 */
#define  TMR_BRKDT_DTGS_5                       ((uint16_t)0x0020)            /*!< Bit 5 */
#define  TMR_BRKDT_DTGS_6                       ((uint16_t)0x0040)            /*!< Bit 6 */
#define  TMR_BRKDT_DTGS_7                       ((uint16_t)0x0080)            /*!< Bit 7 */

