RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#define  TMR_BRKDT_LOCKC                        ((uint16_t)0x0300)            /*!< LOCK[1:0] bits (Lock Configuration) */
#define  TMR_BRKDT_LOCKC_0                      ((uint16_t)0x0100)            /*!< Bit 0 */
#define  TMR_BRKDT_LOCKC_1                      ((uint16_t)0x0200)            /*!< Bit 1 */

#define  TMR_BRKDT_OSIMI                        ((uint16_t)0x0400)            /*!< Off-State Selection for Idle mode */
#define  TMR_BRKDT_OSIMR                        ((uint16_t)0x0800)            /*!< Off-State Selection for Run mode */
#define  TMR_BRKDT_BRKEN                        ((uint16_t)0x1000)            /*!< Break enable */
#define  TMR_BRKDT_BRKP                         ((uint16_t)0x2000)            /*!< Break Polarity */
#define  TMR_BRKDT_AOEN                         ((uint16_t)0x4000)            /*!< Automatic Output enable */
#define  TMR_BRKDT_MOEN                         ((uint16_t)0x8000)            /*!< Main Output enable */

/*******************  Bit definition for TMR_DMAC register  ********************/
#define  TMR_DMAC_ADDR                          ((uint16_t)0x001F)            /*!< DBA[4:0] bits (DMA Base Address) */
#define  TMR_DMAC_ADDR_0                        ((uint16_t)0x0001)            /*!< Bit 0 */
#define  TMR_DMAC_ADDR_1                        ((uint16_t)0x0002)            /*!< Bit 1 */
#define  TMR_DMAC_ADDR_2                        ((uint16_t)0x0004)            /*!< Bit 2 */
#define  TMR_DMAC_ADDR_3                        ((uint16_t)0x0008)            /*!< Bit 3 */
#define  TMR_DMAC_ADDR_4                        ((uint16_t)0x0010)            /*!< Bit 4 */

#define  TMR_DMAC_DBLEN                         ((uint16_t)0x1F00)            /*!< DBL[4:0] bits (DMA Burst Length) */
#define  TMR_DMAC_DBLEN_0                       ((uint16_t)0x0100)            /*!< Bit 0 */
#define  TMR_DMAC_DBLEN_1                       ((uint16_t)0x0200)            /*!< Bit 1 */
#define  TMR_DMAC_DBLEN_2                       ((uint16_t)0x0400)            /*!< Bit 2 */
#define  TMR_DMAC_DBLEN_3                       ((uint16_t)0x0800)            /*!< Bit 3 */
#define  TMR_DMAC_DBLEN_4                       ((uint16_t)0x1000)            /*!< Bit 4 */

/*******************  Bit definition for TMR_DMABA register  *******************/
#define  TMR_DMABA_DMABA                    ((uint16_t)0xFFFF)            /*!< DMA register for burst accesses */

/******************************************************************************/
/*                                                                            */
/*                             Real-Time Clock                                */
/*                                                                            */
/******************************************************************************/
#if defined (AT32F415xx)
/********************  Bits definition for ERTC_TIME register  *******************/
#define ERTC_TIME_AMPM                          ((uint32_t)0x00400000)
#define ERTC_TIME_HT                            ((uint32_t)0x00300000)
#define ERTC_TIME_HT_0                          ((uint32_t)0x00100000)
#define ERTC_TIME_HT_1                          ((uint32_t)0x00200000)
#define ERTC_TIME_HU                            ((uint32_t)0x000F0000)
#define ERTC_TIME_HU_0                          ((uint32_t)0x00010000)
#define ERTC_TIME_HU_1                          ((uint32_t)0x00020000)
#define ERTC_TIME_HU_2                          ((uint32_t)0x00040000)
#define ERTC_TIME_HU_3                          ((uint32_t)0x00080000)
#define ERTC_TIME_MT                            ((uint32_t)0x00007000)
#define ERTC_TIME_MT_0                          ((uint32_t)0x00001000)
#define ERTC_TIME_MT_1                          ((uint32_t)0x00002000)
#define ERTC_TIME_MT_2                          ((uint32_t)0x00004000)
#define ERTC_TIME_MU                            ((uint32_t)0x00000F00)
#define ERTC_TIME_MU_0                          ((uint32_t)0x00000100)
#define ERTC_TIME_MU_1                          ((uint32_t)0x00000200)
#define ERTC_TIME_MU_2                          ((uint32_t)0x00000400)
#define ERTC_TIME_MU_3                          ((uint32_t)0x00000800)
#define ERTC_TIME_ST                            ((uint32_t)0x00000070)
#define ERTC_TIME_ST_0                          ((uint32_t)0x00000010)
#define ERTC_TIME_ST_1                          ((uint32_t)0x00000020)
#define ERTC_TIME_ST_2                          ((uint32_t)0x00000040)
#define ERTC_TIME_SU                            ((uint32_t)0x0000000F)
#define ERTC_TIME_SU_0                          ((uint32_t)0x00000001)
#define ERTC_TIME_SU_1                          ((uint32_t)0x00000002)
#define ERTC_TIME_SU_2                          ((uint32_t)0x00000004)
#define ERTC_TIME_SU_3                          ((uint32_t)0x00000008)

/********************  Bits definition for ERTC_DATE register  *******************/
#define ERTC_DATE_YT                            ((uint32_t)0x00F00000)
#define ERTC_DATE_YT_0                          ((uint32_t)0x00100000)
#define ERTC_DATE_YT_1                          ((uint32_t)0x00200000)
#define ERTC_DATE_YT_2                          ((uint32_t)0x00400000)
#define ERTC_DATE_YT_3                          ((uint32_t)0x00800000)
#define ERTC_DATE_YU                            ((uint32_t)0x000F0000)
#define ERTC_DATE_YU_0                          ((uint32_t)0x00010000)
#define ERTC_DATE_YU_1                          ((uint32_t)0x00020000)
#define ERTC_DATE_YU_2                          ((uint32_t)0x00040000)
#define ERTC_DATE_YU_3                          ((uint32_t)0x00080000)
#define ERTC_DATE_WK                            ((uint32_t)0x0000E000)
#define ERTC_DATE_WK_0                          ((uint32_t)0x00002000)
#define ERTC_DATE_WK_1                          ((uint32_t)0x00004000)
#define ERTC_DATE_WK_2                          ((uint32_t)0x00008000)
#define ERTC_DATE_MT                            ((uint32_t)0x00001000)
#define ERTC_DATE_MU                            ((uint32_t)0x00000F00)
#define ERTC_DATE_MU_0                          ((uint32_t)0x00000100)
#define ERTC_DATE_MU_1                          ((uint32_t)0x00000200)
#define ERTC_DATE_MU_2                          ((uint32_t)0x00000400)
#define ERTC_DATE_MU_3                          ((uint32_t)0x00000800)
#define ERTC_DATE_DT                            ((uint32_t)0x00000030)
#define ERTC_DATE_DT_0                          ((uint32_t)0x00000010)
#define ERTC_DATE_DT_1                          ((uint32_t)0x00000020)
#define ERTC_DATE_DU                            ((uint32_t)0x0000000F)
#define ERTC_DATE_DU_0                          ((uint32_t)0x00000001)
#define ERTC_DATE_DU_1                          ((uint32_t)0x00000002)
#define ERTC_DATE_DU_2                          ((uint32_t)0x00000004)
#define ERTC_DATE_DU_3                          ((uint32_t)0x00000008)

/********************  Bits definition for ERTC_CTRL register  *******************/
#define ERTC_CTRL_CALOE                         ((uint32_t)0x00800000)
#define ERTC_CTRL_OSEL                          ((uint32_t)0x00600000)
#define ERTC_CTRL_OSEL_0                        ((uint32_t)0x00200000)
#define ERTC_CTRL_OSEL_1                        ((uint32_t)0x00400000)
#define ERTC_CTRL_OPOL                          ((uint32_t)0x00100000)
#define ERTC_CTRL_CALSEL                        ((uint32_t)0x00080000)
#define ERTC_CTRL_BKP                           ((uint32_t)0x00040000)
#define ERTC_CTRL_SUB1H                         ((uint32_t)0x00020000)
#define ERTC_CTRL_ADD1H                         ((uint32_t)0x00010000)
#define ERTC_CTRL_TSIE                          ((uint32_t)0x00008000)
#define ERTC_CTRL_WATIE                         ((uint32_t)0x00004000)
#define ERTC_CTRL_ALBIE                         ((uint32_t)0x00002000)
#define ERTC_CTRL_ALAIE                         ((uint32_t)0x00001000)
#define ERTC_CTRL_TSE                           ((uint32_t)0x00000800)
#define ERTC_CTRL_WATE                          ((uint32_t)0x00000400)
#define ERTC_CTRL_ALBE                          ((uint32_t)0x00000200)
#define ERTC_CTRL_ALAE                          ((uint32_t)0x00000100)
#define ERTC_CTRL_CDCE                          ((uint32_t)0x00000080)
#define ERTC_CTRL_HFM                           ((uint32_t)0x00000040)
#define ERTC_CTRL_BYPSHDW                       ((uint32_t)0x00000020)
#define ERTC_CTRL_RFCKON                        ((uint32_t)0x00000010)
#define ERTC_CTRL_TSEDGE                        ((uint32_t)0x00000008)
#define ERTC_CTRL_WACKSEL                       ((uint32_t)0x00000007)
#define ERTC_CTRL_WACKSEL_0                     ((uint32_t)0x00000001)
#define ERTC_CTRL_WACKSEL_1                     ((uint32_t)0x00000002)
#define ERTC_CTRL_WACKSEL_2                     ((uint32_t)0x00000004)

/********************  Bits definition for ERTC_ISTS register  ******************/
#define ERTC_ISTS_RECALPDF                      ((uint32_t)0x00010000)
#define ERTC_ISTS_TPF                           ((uint32_t)0x00002000)
#define ERTC_ISTS_TP2F                          ((uint32_t)0x00004000)
#define ERTC_ISTS_TSOF                          ((uint32_t)0x00001000)
#define ERTC_ISTS_TSF                           ((uint32_t)0x00000800)
#define ERTC_ISTS_WATF                          ((uint32_t)0x00000400)
#define ERTC_ISTS_ALBF                          ((uint32_t)0x00000200)
#define ERTC_ISTS_ALAF                          ((uint32_t)0x00000100)
#define ERTC_ISTS_INITM                         ((uint32_t)0x00000080)
#define ERTC_ISTS_INITF                         ((uint32_t)0x00000040)
#define ERTC_ISTS_RSF                           ((uint32_t)0x00000020)
#define ERTC_ISTS_INITS                         ((uint32_t)0x00000010)
#define ERTC_ISTS_SFP                           ((uint32_t)0x00000008)
#define ERTC_ISTS_WATWF                         ((uint32_t)0x00000004)
#define ERTC_ISTS_ALBWF                         ((uint32_t)0x00000002)
#define ERTC_ISTS_ALAWF                         ((uint32_t)0x00000001)

/********************  Bits definition for ERTC_PSC register  *****************/
#define ERTC_PSC_PRDIV_A                        ((uint32_t)0x007F0000)
#define ERTC_PSC_PRDIV_S                        ((uint32_t)0x00001FFF)

/********************  Bits definition for ERTC_WATR register  *****************/
#define ERTC_WATR_WAREV                         ((uint32_t)0x0000FFFF)

