RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/********************  Bits definition for ERTC_CAL register  ***************/
#define ERTC_CAL_DCALS                          ((uint32_t)0x00000080)
#define ERTC_CAL_DCAL                           ((uint32_t)0x0000001F)

/********************  Bits definition for ERTC_ALA register  ***************/
#define ERTC_ALA_MASK4                          ((uint32_t)0x80000000)
#define ERTC_ALA_WKSEL                          ((uint32_t)0x40000000)
#define ERTC_ALA_DT                             ((uint32_t)0x30000000)
#define ERTC_ALA_DT_0                           ((uint32_t)0x10000000)
#define ERTC_ALA_DT_1                           ((uint32_t)0x20000000)
#define ERTC_ALA_DU                             ((uint32_t)0x0F000000)
#define ERTC_ALA_DU_0                           ((uint32_t)0x01000000)
#define ERTC_ALA_DU_1                           ((uint32_t)0x02000000)
#define ERTC_ALA_DU_2                           ((uint32_t)0x04000000)
#define ERTC_ALA_DU_3                           ((uint32_t)0x08000000)
#define ERTC_ALA_MASK3                          ((uint32_t)0x00800000)
#define ERTC_ALA_AMPM                           ((uint32_t)0x00400000)
#define ERTC_ALA_HT                             ((uint32_t)0x00300000)
#define ERTC_ALA_HT_0                           ((uint32_t)0x00100000)
#define ERTC_ALA_HT_1                           ((uint32_t)0x00200000)
#define ERTC_ALA_HU                             ((uint32_t)0x000F0000)
#define ERTC_ALA_HU_0                           ((uint32_t)0x00010000)
#define ERTC_ALA_HU_1                           ((uint32_t)0x00020000)
#define ERTC_ALA_HU_2                           ((uint32_t)0x00040000)
#define ERTC_ALA_HU_3                           ((uint32_t)0x00080000)
#define ERTC_ALA_MASK2                          ((uint32_t)0x00008000)
#define ERTC_ALA_MT                             ((uint32_t)0x00007000)
#define ERTC_ALA_MT_0                           ((uint32_t)0x00001000)
#define ERTC_ALA_MT_1                           ((uint32_t)0x00002000)
#define ERTC_ALA_MT_2                           ((uint32_t)0x00004000)
#define ERTC_ALA_MU                             ((uint32_t)0x00000F00)
#define ERTC_ALA_MU_0                           ((uint32_t)0x00000100)
#define ERTC_ALA_MU_1                           ((uint32_t)0x00000200)
#define ERTC_ALA_MU_2                           ((uint32_t)0x00000400)
#define ERTC_ALA_MU_3                           ((uint32_t)0x00000800)
#define ERTC_ALA_MASK1                          ((uint32_t)0x00000080)
#define ERTC_ALA_ST                             ((uint32_t)0x00000070)
#define ERTC_ALA_ST_0                           ((uint32_t)0x00000010)
#define ERTC_ALA_ST_1                           ((uint32_t)0x00000020)
#define ERTC_ALA_ST_2                           ((uint32_t)0x00000040)
#define ERTC_ALA_SU                             ((uint32_t)0x0000000F)
#define ERTC_ALA_SU_0                           ((uint32_t)0x00000001)
#define ERTC_ALA_SU_1                           ((uint32_t)0x00000002)
#define ERTC_ALA_SU_2                           ((uint32_t)0x00000004)
#define ERTC_ALA_SU_3                           ((uint32_t)0x00000008)

/********************  Bits definition for ERTC_ALB register  ***************/
#define ERTC_ALB_MASK4                          ((uint32_t)0x80000000)
#define ERTC_ALB_WKSEL                          ((uint32_t)0x40000000)
#define ERTC_ALB_DT                             ((uint32_t)0x30000000)
#define ERTC_ALB_DT_0                           ((uint32_t)0x10000000)
#define ERTC_ALB_DT_1                           ((uint32_t)0x20000000)
#define ERTC_ALB_DU                             ((uint32_t)0x0F000000)
#define ERTC_ALB_DU_0                           ((uint32_t)0x01000000)
#define ERTC_ALB_DU_1                           ((uint32_t)0x02000000)
#define ERTC_ALB_DU_2                           ((uint32_t)0x04000000)
#define ERTC_ALB_DU_3                           ((uint32_t)0x08000000)
#define ERTC_ALB_MASK3                          ((uint32_t)0x00800000)
#define ERTC_ALB_AMPM                           ((uint32_t)0x00400000)
#define ERTC_ALB_HT                             ((uint32_t)0x00300000)
#define ERTC_ALB_HT_0                           ((uint32_t)0x00100000)
#define ERTC_ALB_HT_1                           ((uint32_t)0x00200000)
#define ERTC_ALB_HU                             ((uint32_t)0x000F0000)
#define ERTC_ALB_HU_0                           ((uint32_t)0x00010000)
#define ERTC_ALB_HU_1                           ((uint32_t)0x00020000)
#define ERTC_ALB_HU_2                           ((uint32_t)0x00040000)
#define ERTC_ALB_HU_3                           ((uint32_t)0x00080000)
#define ERTC_ALB_MASK2                          ((uint32_t)0x00008000)
#define ERTC_ALB_MT                             ((uint32_t)0x00007000)
#define ERTC_ALB_MT_0                           ((uint32_t)0x00001000)
#define ERTC_ALB_MT_1                           ((uint32_t)0x00002000)
#define ERTC_ALB_MT_2                           ((uint32_t)0x00004000)
#define ERTC_ALB_MU                             ((uint32_t)0x00000F00)
#define ERTC_ALB_MU_0                           ((uint32_t)0x00000100)
#define ERTC_ALB_MU_1                           ((uint32_t)0x00000200)
#define ERTC_ALB_MU_2                           ((uint32_t)0x00000400)
#define ERTC_ALB_MU_3                           ((uint32_t)0x00000800)
#define ERTC_ALB_MASK1                          ((uint32_t)0x00000080)
#define ERTC_ALB_ST                             ((uint32_t)0x00000070)
#define ERTC_ALB_ST_0                           ((uint32_t)0x00000010)
#define ERTC_ALB_ST_1                           ((uint32_t)0x00000020)
#define ERTC_ALB_ST_2                           ((uint32_t)0x00000040)
#define ERTC_ALA_SU                             ((uint32_t)0x0000000F)
#define ERTC_ALA_SU_0                           ((uint32_t)0x00000001)
#define ERTC_ALA_SU_1                           ((uint32_t)0x00000002)
#define ERTC_ALA_SU_2                           ((uint32_t)0x00000004)
#define ERTC_ALA_SU_3                           ((uint32_t)0x00000008)

