RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/********************  Bits definition for ERTC_WPR register  ******************/
#define ERTC_WPR_KEY                            ((uint32_t)0x000000FF)

/********************  Bits definition for ERTC_SBSR register  ******************/
#define ERTC_SBSR_SBS                           ((uint32_t)0x0000FFFF)

/********************  Bits definition for ERTC_SFCTR register  ***************/
#define ERTC_SFCTR_SUBSBS                       ((uint32_t)0x00007FFF)
#define ERTC_SFCTR_ADD1S                        ((uint32_t)0x80000000)

/********************  Bits definition for ERTC_TSTM register  *****************/
#define ERTC_TSTM_AMPM                          ((uint32_t)0x00400000)
#define ERTC_TSTM_HT                            ((uint32_t)0x00300000)
#define ERTC_TSTM_HT_0                          ((uint32_t)0x00100000)
#define ERTC_TSTM_HT_1                          ((uint32_t)0x00200000)
#define ERTC_TSTM_HU                            ((uint32_t)0x000F0000)
#define ERTC_TSTM_HU_0                          ((uint32_t)0x00010000)
#define ERTC_TSTM_HU_1                          ((uint32_t)0x00020000)
#define ERTC_TSTM_HU_2                          ((uint32_t)0x00040000)
#define ERTC_TSTM_HU_3                          ((uint32_t)0x00080000)
#define ERTC_TSTM_MT                            ((uint32_t)0x00007000)
#define ERTC_TSTM_MT_0                          ((uint32_t)0x00001000)
#define ERTC_TSTM_MT_1                          ((uint32_t)0x00002000)
#define ERTC_TSTM_MT_2                          ((uint32_t)0x00004000)
#define ERTC_TSTM_MU                            ((uint32_t)0x00000F00)
#define ERTC_TSTM_MU_0                          ((uint32_t)0x00000100)
#define ERTC_TSTM_MU_1                          ((uint32_t)0x00000200)
#define ERTC_TSTM_MU_2                          ((uint32_t)0x00000400)
#define ERTC_TSTM_MU_3                          ((uint32_t)0x00000800)
#define ERTC_TSTM_ST                            ((uint32_t)0x00000070)
#define ERTC_TSTM_ST_0                          ((uint32_t)0x00000010)
#define ERTC_TSTM_ST_1                          ((uint32_t)0x00000020)
#define ERTC_TSTM_ST_2                          ((uint32_t)0x00000040)
#define ERTC_TSTM_SU                            ((uint32_t)0x0000000F)
#define ERTC_TSTM_SU_0                          ((uint32_t)0x00000001)
#define ERTC_TSTM_SU_1                          ((uint32_t)0x00000002)
#define ERTC_TSTM_SU_2                          ((uint32_t)0x00000004)
#define ERTC_TSTM_SU_3                          ((uint32_t)0x00000008)

/********************  Bits definition for ERTC_TSDT register  *****************/
#define ERTC_TSDT_WK                            ((uint32_t)0x0000E000)
#define ERTC_TSDT_WK_0                          ((uint32_t)0x00002000)
#define ERTC_TSDT_WK_1                          ((uint32_t)0x00004000)
#define ERTC_TSDT_WK_2                          ((uint32_t)0x00008000)
#define ERTC_TSDT_MT                            ((uint32_t)0x00001000)
#define ERTC_TSDT_MU                            ((uint32_t)0x00000F00)
#define ERTC_TSDT_MU_0                          ((uint32_t)0x00000100)
#define ERTC_TSDT_MU_1                          ((uint32_t)0x00000200)
#define ERTC_TSDT_MU_2                          ((uint32_t)0x00000400)
#define ERTC_TSDT_MU_3                          ((uint32_t)0x00000800)
#define ERTC_TSDT_DT                            ((uint32_t)0x00000030)
#define ERTC_TSDT_DT_0                          ((uint32_t)0x00000010)
#define ERTC_TSDT_DT_1                          ((uint32_t)0x00000020)
#define ERTC_TSDT_DU                            ((uint32_t)0x0000000F)
#define ERTC_TSDT_DU_0                          ((uint32_t)0x00000001)
#define ERTC_TSDT_DU_1                          ((uint32_t)0x00000002)
#define ERTC_TSDT_DU_2                          ((uint32_t)0x00000004)
#define ERTC_TSDT_DU_3                          ((uint32_t)0x00000008)

/********************  Bits definition for ERTC_TSSBS register  ****************/
#define ERTC_TSSBS_SBS                          ((uint32_t)0x0000FFFF)

/********************  Bits definition for ERTC_CCR register  *****************/
#define ERTC_CCR_CALAD                          ((uint32_t)0x00008000)
#define ERTC_CCR_CAL8                           ((uint32_t)0x00004000)
#define ERTC_CCR_CAL16                          ((uint32_t)0x00002000)
#define ERTC_CCR_CALM                           ((uint32_t)0x000001FF)
#define ERTC_CCR_CALM_0                         ((uint32_t)0x00000001)
#define ERTC_CCR_CALM_1                         ((uint32_t)0x00000002)
#define ERTC_CCR_CALM_2                         ((uint32_t)0x00000004)
#define ERTC_CCR_CALM_3                         ((uint32_t)0x00000008)
#define ERTC_CCR_CALM_4                         ((uint32_t)0x00000010)
#define ERTC_CCR_CALM_5                         ((uint32_t)0x00000020)
#define ERTC_CCR_CALM_6                         ((uint32_t)0x00000040)
#define ERTC_CCR_CALM_7                         ((uint32_t)0x00000080)
#define ERTC_CCR_CALM_8                         ((uint32_t)0x00000100)

/********************  Bits definition for ERTC_TPAF register  ****************/
#define ERTC_TPAF_ALAOUTTYPE                    ((uint32_t)0x00040000)
#define ERTC_TPAF_TSINSEL                       ((uint32_t)0x00020000)
#define ERTC_TPAF_TMPINSEL                      ((uint32_t)0x00010000)
#define ERTC_TPAF_TMPUDIS                       ((uint32_t)0x00008000)
#define ERTC_TPAF_TMPRCH                        ((uint32_t)0x00006000)
#define ERTC_TPAF_TMPRCH_0                      ((uint32_t)0x00002000)
#define ERTC_TPAF_TMPRCH_1                      ((uint32_t)0x00004000)
#define ERTC_TPAF_TMFLT                         ((uint32_t)0x00001800)
#define ERTC_TPAF_TMFLT_0                       ((uint32_t)0x00000800)
#define ERTC_TPAF_TMFLT_1                       ((uint32_t)0x00001000)
#define ERTC_TPAF_TMFREQ                        ((uint32_t)0x00000700)
#define ERTC_TPAF_TMFREQ_0                      ((uint32_t)0x00000100)
#define ERTC_TPAF_TMFREQ_1                      ((uint32_t)0x00000200)
#define ERTC_TPAF_TMFREQ_2                      ((uint32_t)0x00000400)
#define ERTC_TPAF_TMTS                          ((uint32_t)0x00000080)
#define ERTC_TPAF_TM2TRG                        ((uint32_t)0x00000010)
#define ERTC_TPAF_TM2E                          ((uint32_t)0x00000008)
#define ERTC_TPAF_TMIE                          ((uint32_t)0x00000004)
#define ERTC_TPAF_TM1TRG                        ((uint32_t)0x00000002)
#define ERTC_TPAF_TM1E                          ((uint32_t)0x00000001)

/********************  Bits definition for ERTC_ALASBS register  *************/
#define ERTC_ALASBS_MASKSBS                     ((uint32_t)0x0F000000)
#define ERTC_ALASBS_MASKSBS_0                   ((uint32_t)0x01000000)
#define ERTC_ALASBS_MASKSBS_1                   ((uint32_t)0x02000000)
#define ERTC_ALASBS_MASKSBS_2                   ((uint32_t)0x04000000)
#define ERTC_ALASBS_MASKSBS_3                   ((uint32_t)0x08000000)
#define ERTC_ALASBS_SBS                         ((uint32_t)0x00007FFF)

/********************  Bits definition for ERTC_ALBSBS register  *************/
#define ERTC_ALBSBS_MASKSBS                     ((uint32_t)0x0F000000)
#define ERTC_ALBSBS_MASKSBS_0                   ((uint32_t)0x01000000)
#define ERTC_ALBSBS_MASKSBS_1                   ((uint32_t)0x02000000)
#define ERTC_ALBSBS_MASKSBS_2                   ((uint32_t)0x04000000)
#define ERTC_ALBSBS_MASKSBS_3                   ((uint32_t)0x08000000)
#define ERTC_ALBSBS_SBS                         ((uint32_t)0x00007FFF)

