RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/********************  Bits definition for ERTC_BKP0DT register  ****************/
#define ERTC_BKP0DT                             ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP1DT register  ****************/
#define ERTC_BKP1DT                             ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP2DT register  ****************/
#define ERTC_BKP2DT                             ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP3DT register  ****************/
#define ERTC_BKP3DT                             ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP4DT register  ****************/
#define ERTC_BKP4DT                             ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP5DT register  ****************/
#define ERTC_BKP5DT                             ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP6DT register  ****************/
#define ERTC_BKP6DT                             ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP7DT register  ****************/
#define ERTC_BKP7DT                             ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP8DT register  ****************/
#define ERTC_BKP8DT                             ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP9DT register  ****************/
#define ERTC_BKP9DT                             ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP10DT register  ***************/
#define ERTC_BKP10DT                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP11DT register  ***************/
#define ERTC_BKP11DT                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP12DT register  ***************/
#define ERTC_BKP12DT                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP13DT register  ***************/
#define ERTC_BKP13DT                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP14DT register  ***************/
#define ERTC_BKP14DT                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP15DT register  ***************/
#define ERTC_BKP15DT                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP16DT register  ***************/
#define ERTC_BKP16DT                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP17DT register  ***************/
#define ERTC_BKP17DT                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP18DT register  ***************/
#define ERTC_BKP18DT                            ((uint32_t)0xFFFFFFFF)

/********************  Bits definition for ERTC_BKP19DT register  ***************/
#define ERTC_BKP19DT                            ((uint32_t)0xFFFFFFFF)

#else
/*******************  Bit definition for RTC_CTRLH register  ********************/
#define  RTC_CTRLH_PACEIEN                      ((uint8_t)0x01)               /*!< Second Interrupt Enable */
#define  RTC_CTRLH_ALAIEN                       ((uint8_t)0x02)               /*!< Alarm Interrupt Enable */
#define  RTC_CTRLH_OVIEN                        ((uint8_t)0x04)               /*!< OverfloW Interrupt Enable */

/*******************  Bit definition for RTC_CTRLL register  ********************/
#define  RTC_CTRLL_PACEF                        ((uint8_t)0x01)               /*!< Second Flag */
#define  RTC_CTRLL_ALAF                         ((uint8_t)0x02)               /*!< Alarm Flag */
#define  RTC_CTRLL_OVF                          ((uint8_t)0x04)               /*!< OverfloW Flag */
#define  RTC_CTRLL_RSYNF                        ((uint8_t)0x08)               /*!< Registers Synchronized Flag */
#define  RTC_CTRLL_CMF                          ((uint8_t)0x10)               /*!< Configuration Flag */
#define  RTC_CTRLL_RTF                          ((uint8_t)0x20)               /*!< RTC operation OFF */

/*******************  Bit definition for RTC_DIVH register  *******************/
#define  RTC_DIVH_DIV                           ((uint16_t)0x000F)            /*!< RTC Prescaler Reload Value High */

/*******************  Bit definition for RTC_DIVL register  *******************/
#define  RTC_DIVL_DIV                           ((uint16_t)0xFFFF)            /*!< RTC Prescaler Reload Value Low */

/*******************  Bit definition for RTC_DIVCNTH register  *******************/
#define  RTC_DIVCNTH_RTC_DIVCNT                 ((uint16_t)0x000F)            /*!< RTC Clock Divider High */

/*******************  Bit definition for RTC_DIVCNTL register  *******************/
#define  RTC_DIVCNTL_RTC_DIVCNT                 ((uint16_t)0xFFFF)            /*!< RTC Clock Divider Low */

/*******************  Bit definition for RTC_CNTH register  *******************/
#define  RTC_CNTH_CNT                           ((uint16_t)0xFFFF)            /*!< RTC Counter High */

/*******************  Bit definition for RTC_CNTL register  *******************/
#define  RTC_CNTL_CNT                           ((uint16_t)0xFFFF)            /*!< RTC Counter Low */

/*******************  Bit definition for RTC_ALAH register  *******************/
#define  RTC_ALAH_ALA                           ((uint16_t)0xFFFF)            /*!< RTC Alarm High */

/*******************  Bit definition for RTC_ALAL register  *******************/
#define  RTC_ALAL_ALA                           ((uint16_t)0xFFFF)            /*!< RTC Alarm Low */
#endif
/******************************************************************************/
/*                                                                            */
/*                           Independent WATCHDOG                             */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for IWDG_KEY register  ********************/
#define  IWDG_KEY_KEY                           ((uint16_t)0xFFFF)            /*!< Key value (write only, read 0000h) */

/*******************  Bit definition for IWDG_PSC register  ********************/
#define  IWDG_PSC_PSC                           ((uint8_t)0x07)               /*!< PR[2:0] (Prescaler divider) */
#define  IWDG_PSC_PSC_0                         ((uint8_t)0x01)               /*!< Bit 0 */
#define  IWDG_PSC_PSC_1                         ((uint8_t)0x02)               /*!< Bit 1 */
#define  IWDG_PSC_PSC_2                         ((uint8_t)0x04)               /*!< Bit 2 */

/*******************  Bit definition for IWDG_RLD register  *******************/
#define  IWDG_RLD_RLD                           ((uint16_t)0x0FFF)            /*!< Watchdog counter reload value */

/*******************  Bit definition for IWDG_STS register  ********************/
#define  IWDG_STS_PSCF                          ((uint8_t)0x01)               /*!< Watchdog prescaler value update */
#define  IWDG_STS_RLDF                          ((uint8_t)0x02)               /*!< Watchdog counter reload value update */

/******************************************************************************/
/*                                                                            */
/*                            Window WATCHDOG                                 */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for WWDG_CTRL register  ********************/
#define  WWDG_CTRL_CNTR                         ((uint8_t)0x7F)               /*!< T[6:0] bits (7-Bit counter (MSB to LSB)) */
#define  WWDG_CTRL_CNTR0                        ((uint8_t)0x01)               /*!< Bit 0 */
#define  WWDG_CTRL_CNTR1                        ((uint8_t)0x02)               /*!< Bit 1 */
#define  WWDG_CTRL_CNTR2                        ((uint8_t)0x04)               /*!< Bit 2 */
#define  WWDG_CTRL_CNTR3                        ((uint8_t)0x08)               /*!< Bit 3 */
#define  WWDG_CTRL_CNTR4                        ((uint8_t)0x10)               /*!< Bit 4 */
#define  WWDG_CTRL_CNTR5                        ((uint8_t)0x20)               /*!< Bit 5 */
#define  WWDG_CTRL_CNTR6                        ((uint8_t)0x40)               /*!< Bit 6 */

