RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#define  WWDG_CTRL_EN                           ((uint8_t)0x80)               /*!< Activation bit */

/*******************  Bit definition for WWDG_CFG register  *******************/
#define  WWDG_CFG_WCNTR                         ((uint16_t)0x007F)            /*!< W[6:0] bits (7-bit window value) */
#define  WWDG_CFG_WCNTR0                        ((uint16_t)0x0001)            /*!< Bit 0 */
#define  WWDG_CFG_WCNTR1                        ((uint16_t)0x0002)            /*!< Bit 1 */
#define  WWDG_CFG_WCNTR2                        ((uint16_t)0x0004)            /*!< Bit 2 */
#define  WWDG_CFG_WCNTR3                        ((uint16_t)0x0008)            /*!< Bit 3 */
#define  WWDG_CFG_WCNTR4                        ((uint16_t)0x0010)            /*!< Bit 4 */
#define  WWDG_CFG_WCNTR5                        ((uint16_t)0x0020)            /*!< Bit 5 */
#define  WWDG_CFG_WCNTR6                        ((uint16_t)0x0040)            /*!< Bit 6 */

#define  WWDG_CFG_PSC                           ((uint16_t)0x0180)            /*!< WDGTB[1:0] bits (Timer Base) */
#define  WWDG_CFG_PSC0                          ((uint16_t)0x0080)            /*!< Bit 0 */
#define  WWDG_CFG_PSC1                          ((uint16_t)0x0100)            /*!< Bit 1 */

#define  WWDG_CFG_EWIEN                         ((uint16_t)0x0200)            /*!< Early Wakeup Interrupt */

/*******************  Bit definition for WWDG_STS register  ********************/
#define  WWDG_STS_EWIF                          ((uint8_t)0x01)               /*!< Early Wakeup Interrupt Flag */

/******************************************************************************/
/*                                                                            */
/*                       eXternal Memory Controller                              */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for XMC_BK1CTRL1 register  *******************/
#define  XMC_BK1CTRL1_EN                        ((uint32_t)0x00000001)        /*!< Memory bank enable bit */
#define  XMC_BK1CTRL1_MUXEN                     ((uint32_t)0x00000002)        /*!< Address/data multiplexing enable bit */

#define  XMC_BK1CTRL1_DEV                       ((uint32_t)0x0000000C)        /*!< MTYP[1:0] bits (Memory type) */
#define  XMC_BK1CTRL1_DEV_0                     ((uint32_t)0x00000004)        /*!< Bit 0 */
#define  XMC_BK1CTRL1_DEV_1                     ((uint32_t)0x00000008)        /*!< Bit 1 */

#define  XMC_BK1CTRL1_BUSTYPE                   ((uint32_t)0x00000030)        /*!< MWID[1:0] bits (Memory data bus width) */
#define  XMC_BK1CTRL1_BUSTYPE_0                 ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  XMC_BK1CTRL1_BUSTYPE_1                 ((uint32_t)0x00000020)        /*!< Bit 1 */

#define  XMC_BK1CTRL1_NOREN                     ((uint32_t)0x00000040)        /*!< Flash access enable */
#define  XMC_BK1CTRL1_BURSTEN                   ((uint32_t)0x00000100)        /*!< Burst enable bit */
#define  XMC_BK1CTRL1_WAITALV                   ((uint32_t)0x00000200)        /*!< Wait signal polarity bit */
#define  XMC_BK1CTRL1_BRSTSPLTEN                ((uint32_t)0x00000400)        /*!< Wrapped burst mode support */
#define  XMC_BK1CTRL1_WAITCFG                   ((uint32_t)0x00000800)        /*!< Wait timing configuration */
#define  XMC_BK1CTRL1_WREN                      ((uint32_t)0x00001000)        /*!< Write enable bit */
#define  XMC_BK1CTRL1_WAITEN                    ((uint32_t)0x00002000)        /*!< Wait enable bit */
#define  XMC_BK1CTRL1_TMGWREN                   ((uint32_t)0x00004000)        /*!< Extended mode enable */
#define  XMC_BK1CTRL1_WAITASYNC                 ((uint32_t)0x00008000)       /*!< Asynchronous wait */
#define  XMC_BK1CTRL1_BURSTWRSYN                ((uint32_t)0x00080000)        /*!< Write burst enable */

/******************  Bit definition for XMC_BK1CTRL2 register  *******************/
#define  XMC_BK1CTRL2_EN                        ((uint32_t)0x00000001)        /*!< Memory bank enable bit */
#define  XMC_BK1CTRL2_MUXEN                     ((uint32_t)0x00000002)        /*!< Address/data multiplexing enable bit */

#define  XMC_BK1CTRL2_DEV                       ((uint32_t)0x0000000C)        /*!< MTYP[1:0] bits (Memory type) */
#define  XMC_BK1CTRL2_DEV_0                     ((uint32_t)0x00000004)        /*!< Bit 0 */
#define  XMC_BK1CTRL2_DEV_1                     ((uint32_t)0x00000008)        /*!< Bit 1 */

#define  XMC_BK1CTRL2_BUSTYPE                   ((uint32_t)0x00000030)        /*!< MWID[1:0] bits (Memory data bus width) */
#define  XMC_BK1CTRL2_BUSTYPE_0                 ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  XMC_BK1CTRL2_BUSTYPE_1                 ((uint32_t)0x00000020)        /*!< Bit 1 */

#define  XMC_BK1CTRL2_NOREN                     ((uint32_t)0x00000040)        /*!< Flash access enable */
#define  XMC_BK1CTRL2_BURSTEN                   ((uint32_t)0x00000100)        /*!< Burst enable bit */
#define  XMC_BK1CTRL2_WAITALV                   ((uint32_t)0x00000200)        /*!< Wait signal polarity bit */
#define  XMC_BK1CTRL2_BRSTSPLTEN                ((uint32_t)0x00000400)        /*!< Wrapped burst mode support */
#define  XMC_BK1CTRL2_WAITCFG                   ((uint32_t)0x00000800)        /*!< Wait timing configuration */
#define  XMC_BK1CTRL2_WREN                      ((uint32_t)0x00001000)        /*!< Write enable bit */
#define  XMC_BK1CTRL2_WAITEN                    ((uint32_t)0x00002000)        /*!< Wait enable bit */
#define  XMC_BK1CTRL2_TMGWREN                   ((uint32_t)0x00004000)        /*!< Extended mode enable */
#define  XMC_BK1CTRL2_WAITASYNC                 ((uint32_t)0x00008000)       /*!< Asynchronous wait */
#define  XMC_BK1CTRL2_BURSTWRSYN                ((uint32_t)0x00080000)        /*!< Write burst enable */

/******************  Bit definition for XMC_BK1CTRL3 register  *******************/
#define  XMC_BK1CTRL3_EN                        ((uint32_t)0x00000001)        /*!< Memory bank enable bit */
#define  XMC_BK1CTRL3_MUXEN                     ((uint32_t)0x00000002)        /*!< Address/data multiplexing enable bit */

#define  XMC_BK1CTRL3_DEV                       ((uint32_t)0x0000000C)        /*!< MTYP[1:0] bits (Memory type) */
#define  XMC_BK1CTRL3_DEV_0                     ((uint32_t)0x00000004)        /*!< Bit 0 */
#define  XMC_BK1CTRL3_DEV_1                     ((uint32_t)0x00000008)        /*!< Bit 1 */

#define  XMC_BK1CTRL3_BUSTYPE                   ((uint32_t)0x00000030)        /*!< MWID[1:0] bits (Memory data bus width) */
#define  XMC_BK1CTRL3_BUSTYPE_0                 ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  XMC_BK1CTRL3_BUSTYPE_1                 ((uint32_t)0x00000020)        /*!< Bit 1 */

#define  XMC_BK1CTRL3_NOREN                     ((uint32_t)0x00000040)        /*!< Flash access enable */
#define  XMC_BK1CTRL3_BURSTEN                   ((uint32_t)0x00000100)        /*!< Burst enable bit */
#define  XMC_BK1CTRL3_WAITALV                   ((uint32_t)0x00000200)        /*!< Wait signal polarity bit. */
#define  XMC_BK1CTRL3_BRSTSPLTEN                ((uint32_t)0x00000400)        /*!< Wrapped burst mode support */
#define  XMC_BK1CTRL3_WAITCFG                   ((uint32_t)0x00000800)        /*!< Wait timing configuration */
#define  XMC_BK1CTRL3_WREN                      ((uint32_t)0x00001000)        /*!< Write enable bit */
#define  XMC_BK1CTRL3_WAITEN                    ((uint32_t)0x00002000)        /*!< Wait enable bit */
#define  XMC_BK1CTRL3_TMGWREN                   ((uint32_t)0x00004000)        /*!< Extended mode enable */
#define  XMC_BK1CTRL3_WAITASYNC                 ((uint32_t)0x00008000)       /*!< Asynchronous wait */
#define  XMC_BK1CTRL3_BURSTWRSYN                ((uint32_t)0x00080000)        /*!< Write burst enable */

/******************  Bit definition for XMC_BK1CTRL4 register  *******************/
#define  XMC_BK1CTRL4_EN                        ((uint32_t)0x00000001)        /*!< Memory bank enable bit */
#define  XMC_BK1CTRL4_MUXEN                     ((uint32_t)0x00000002)        /*!< Address/data multiplexing enable bit */

#define  XMC_BK1CTRL4_DEV                       ((uint32_t)0x0000000C)        /*!< MTYP[1:0] bits (Memory type) */
#define  XMC_BK1CTRL4_DEV_0                     ((uint32_t)0x00000004)        /*!< Bit 0 */
#define  XMC_BK1CTRL4_DEV_1                     ((uint32_t)0x00000008)        /*!< Bit 1 */

#define  XMC_BK1CTRL4_BUSTYPE                   ((uint32_t)0x00000030)        /*!< MWID[1:0] bits (Memory data bus width) */
#define  XMC_BK1CTRL4_BUSTYPE_0                 ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  XMC_BK1CTRL4_BUSTYPE_1                 ((uint32_t)0x00000020)        /*!< Bit 1 */

#define  XMC_BK1CTRL4_NOREN                     ((uint32_t)0x00000040)        /*!< Flash access enable */
#define  XMC_BK1CTRL4_BURSTEN                   ((uint32_t)0x00000100)        /*!< Burst enable bit */
#define  XMC_BK1CTRL4_WAITALV                   ((uint32_t)0x00000200)        /*!< Wait signal polarity bit */
#define  XMC_BK1CTRL4_BRSTSPLTEN                ((uint32_t)0x00000400)        /*!< Wrapped burst mode support */
#define  XMC_BK1CTRL4_WAITCFG                   ((uint32_t)0x00000800)        /*!< Wait timing configuration */
#define  XMC_BK1CTRL4_WREN                      ((uint32_t)0x00001000)        /*!< Write enable bit */
#define  XMC_BK1CTRL4_WAITEN                    ((uint32_t)0x00002000)        /*!< Wait enable bit */
#define  XMC_BK1CTRL4_TMGWREN                   ((uint32_t)0x00004000)        /*!< Extended mode enable */
#define  XMC_BK1CTRL4_WAITASYNC                 ((uint32_t)0x00008000)       /*!< Asynchronous wait */
#define  XMC_BK1CTRL4_BURSTWRSYN                ((uint32_t)0x00080000)        /*!< Write burst enable */

