RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#define  XMC_BK1TMG4_DTSTBL                     ((uint32_t)0x0F000000)        /*!< DATLA[3:0] bits (Data latency) */
#define  XMC_BK1TMG4_DTSTBL_0                   ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  XMC_BK1TMG4_DTSTBL_1                   ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  XMC_BK1TMG4_DTSTBL_2                   ((uint32_t)0x04000000)        /*!< Bit 2 */
#define  XMC_BK1TMG4_DTSTBL_3                   ((uint32_t)0x08000000)        /*!< Bit 3 */

#define  XMC_BK1TMG4_MODE                       ((uint32_t)0x30000000)        /*!< ACCMOD[1:0] bits (Access mode) */
#define  XMC_BK1TMG4_MODE_0                     ((uint32_t)0x10000000)        /*!< Bit 0 */
#define  XMC_BK1TMG4_MODE_1                     ((uint32_t)0x20000000)        /*!< Bit 1 */

/******************  Bit definition for XMC_BK1TMGWR1 register  ******************/
#define  XMC_BK1TMGWR1_ADROP                    ((uint32_t)0x0000000F)        /*!< ADDSET[3:0] bits (Address setup phase duration) */
#define  XMC_BK1TMGWR1_ADROP_0                  ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  XMC_BK1TMGWR1_ADROP_1                  ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  XMC_BK1TMGWR1_ADROP_2                  ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  XMC_BK1TMGWR1_ADROP_3                  ((uint32_t)0x00000008)        /*!< Bit 3 */

#define  XMC_BK1TMGWR1_ADRHLD                   ((uint32_t)0x000000F0)        /*!< ADDHLD[3:0] bits (Address-hold phase duration) */
#define  XMC_BK1TMGWR1_ADRHLD_0                 ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  XMC_BK1TMGWR1_ADRHLD_1                 ((uint32_t)0x00000020)        /*!< Bit 1 */
#define  XMC_BK1TMGWR1_ADRHLD_2                 ((uint32_t)0x00000040)        /*!< Bit 2 */
#define  XMC_BK1TMGWR1_ADRHLD_3                 ((uint32_t)0x00000080)        /*!< Bit 3 */

#define  XMC_BK1TMGWR1_DTOP                     ((uint32_t)0x0000FF00)        /*!< DATAST [3:0] bits (Data-phase duration) */
#define  XMC_BK1TMGWR1_DTOP_0                   ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  XMC_BK1TMGWR1_DTOP_1                   ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  XMC_BK1TMGWR1_DTOP_2                   ((uint32_t)0x00000400)        /*!< Bit 2 */
#define  XMC_BK1TMGWR1_DTOP_3                   ((uint32_t)0x00000800)        /*!< Bit 3 */

#define  XMC_BK1TMGWR1_CLKPSC                   ((uint32_t)0x00F00000)        /*!< CLKDIV[3:0] bits (Clock divide ratio) */
#define  XMC_BK1TMGWR1_CLKPSC_0                 ((uint32_t)0x00100000)        /*!< Bit 0 */
#define  XMC_BK1TMGWR1_CLKPSC_1                 ((uint32_t)0x00200000)        /*!< Bit 1 */
#define  XMC_BK1TMGWR1_CLKPSC_2                 ((uint32_t)0x00400000)        /*!< Bit 2 */
#define  XMC_BK1TMGWR1_CLKPSC_3                 ((uint32_t)0x00800000)        /*!< Bit 3 */

#define  XMC_BK1TMGWR1_DTSTBL                   ((uint32_t)0x0F000000)        /*!< DATLA[3:0] bits (Data latency) */
#define  XMC_BK1TMGWR1_DTSTBL_0                 ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  XMC_BK1TMGWR1_DTSTBL_1                 ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  XMC_BK1TMGWR1_DTSTBL_2                 ((uint32_t)0x04000000)        /*!< Bit 2 */
#define  XMC_BK1TMGWR1_DTSTBL_3                 ((uint32_t)0x08000000)        /*!< Bit 3 */

#define  XMC_BK1TMGWR1_MODE                     ((uint32_t)0x30000000)        /*!< ACCMOD[1:0] bits (Access mode) */
#define  XMC_BK1TMGWR1_MODE_0                   ((uint32_t)0x10000000)        /*!< Bit 0 */
#define  XMC_BK1TMGWR1_MODE_1                   ((uint32_t)0x20000000)        /*!< Bit 1 */

/******************  Bit definition for XMC_BK1TMGWR2 register  ******************/
#define  XMC_BK1TMGWR2_ADROP                    ((uint32_t)0x0000000F)        /*!< ADDSET[3:0] bits (Address setup phase duration) */
#define  XMC_BK1TMGWR2_ADROP_0                  ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  XMC_BK1TMGWR2_ADROP_1                  ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  XMC_BK1TMGWR2_ADROP_2                  ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  XMC_BK1TMGWR2_ADROP_3                  ((uint32_t)0x00000008)        /*!< Bit 3 */

#define  XMC_BK1TMGWR2_ADRHLD                   ((uint32_t)0x000000F0)        /*!< ADDHLD[3:0] bits (Address-hold phase duration) */
#define  XMC_BK1TMGWR2_ADRHLD_0                 ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  XMC_BK1TMGWR2_ADRHLD_1                 ((uint32_t)0x00000020)        /*!< Bit 1 */
#define  XMC_BK1TMGWR2_ADRHLD_2                 ((uint32_t)0x00000040)        /*!< Bit 2 */
#define  XMC_BK1TMGWR2_ADRHLD_3                 ((uint32_t)0x00000080)        /*!< Bit 3 */

#define  XMC_BK1TMGWR2_DTOP                     ((uint32_t)0x0000FF00)        /*!< DATAST [3:0] bits (Data-phase duration) */
#define  XMC_BK1TMGWR2_DTOP_0                   ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  XMC_BK1TMGWR2_DTOP_1                   ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  XMC_BK1TMGWR2_DTOP_2                   ((uint32_t)0x00000400)        /*!< Bit 2 */
#define  XMC_BK1TMGWR2_DTOP_3                   ((uint32_t)0x00000800)        /*!< Bit 3 */

#define  XMC_BK1TMGWR2_CLKPSC                   ((uint32_t)0x00F00000)        /*!< CLKDIV[3:0] bits (Clock divide ratio) */
#define  XMC_BK1TMGWR2_CLKPSC_0                 ((uint32_t)0x00100000)        /*!< Bit 0 */
#define  XMC_BK1TMGWR2_CLKPSC_1                 ((uint32_t)0x00200000)        /*!< Bit 1*/
#define  XMC_BK1TMGWR2_CLKPSC_2                 ((uint32_t)0x00400000)        /*!< Bit 2 */
#define  XMC_BK1TMGWR2_CLKPSC_3                 ((uint32_t)0x00800000)        /*!< Bit 3 */

#define  XMC_BK1TMGWR2_DTSTBL                   ((uint32_t)0x0F000000)        /*!< DATLA[3:0] bits (Data latency) */
#define  XMC_BK1TMGWR2_DTSTBL_0                 ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  XMC_BK1TMGWR2_DTSTBL_1                 ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  XMC_BK1TMGWR2_DTSTBL_2                 ((uint32_t)0x04000000)        /*!< Bit 2 */
#define  XMC_BK1TMGWR2_DTSTBL_3                 ((uint32_t)0x08000000)        /*!< Bit 3 */

#define  XMC_BK1TMGWR2_MODE                     ((uint32_t)0x30000000)        /*!< ACCMOD[1:0] bits (Access mode) */
#define  XMC_BK1TMGWR2_MODE_0                   ((uint32_t)0x10000000)        /*!< Bit 0 */
#define  XMC_BK1TMGWR2_MODE_1                   ((uint32_t)0x20000000)        /*!< Bit 1 */

