RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/******************  Bit definition for XMC_BK1TMGWR3 register  ******************/
#define  XMC_BK1TMGWR3_ADROP                    ((uint32_t)0x0000000F)        /*!< ADDSET[3:0] bits (Address setup phase duration) */
#define  XMC_BK1TMGWR3_ADROP_0                  ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  XMC_BK1TMGWR3_ADROP_1                  ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  XMC_BK1TMGWR3_ADROP_2                  ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  XMC_BK1TMGWR3_ADROP_3                  ((uint32_t)0x00000008)        /*!< Bit 3 */

#define  XMC_BK1TMGWR3_ADRHLD                   ((uint32_t)0x000000F0)        /*!< ADDHLD[3:0] bits (Address-hold phase duration) */
#define  XMC_BK1TMGWR3_ADRHLD_0                 ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  XMC_BK1TMGWR3_ADRHLD_1                 ((uint32_t)0x00000020)        /*!< Bit 1 */
#define  XMC_BK1TMGWR3_ADRHLD_2                 ((uint32_t)0x00000040)        /*!< Bit 2 */
#define  XMC_BK1TMGWR3_ADRHLD_3                 ((uint32_t)0x00000080)        /*!< Bit 3 */

#define  XMC_BK1TMGWR3_DTOP                     ((uint32_t)0x0000FF00)        /*!< DATAST [3:0] bits (Data-phase duration) */
#define  XMC_BK1TMGWR3_DTOP_0                   ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  XMC_BK1TMGWR3_DTOP_1                   ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  XMC_BK1TMGWR3_DTOP_2                   ((uint32_t)0x00000400)        /*!< Bit 2 */
#define  XMC_BK1TMGWR3_DTOP_3                   ((uint32_t)0x00000800)        /*!< Bit 3 */

#define  XMC_BK1TMGWR3_CLKPSC                   ((uint32_t)0x00F00000)        /*!< CLKDIV[3:0] bits (Clock divide ratio) */
#define  XMC_BK1TMGWR3_CLKPSC_0                 ((uint32_t)0x00100000)        /*!< Bit 0 */
#define  XMC_BK1TMGWR3_CLKPSC_1                 ((uint32_t)0x00200000)        /*!< Bit 1 */
#define  XMC_BK1TMGWR3_CLKPSC_2                 ((uint32_t)0x00400000)        /*!< Bit 2 */
#define  XMC_BK1TMGWR3_CLKPSC_3                 ((uint32_t)0x00800000)        /*!< Bit 3 */

#define  XMC_BK1TMGWR3_DTSTBL                   ((uint32_t)0x0F000000)        /*!< DATLA[3:0] bits (Data latency) */
#define  XMC_BK1TMGWR3_DTSTBL_0                 ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  XMC_BK1TMGWR3_DTSTBL_1                 ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  XMC_BK1TMGWR3_DTSTBL_2                 ((uint32_t)0x04000000)        /*!< Bit 2 */
#define  XMC_BK1TMGWR3_DTSTBL_3                 ((uint32_t)0x08000000)        /*!< Bit 3 */

#define  XMC_BK1TMGWR3_MODE                     ((uint32_t)0x30000000)        /*!< ACCMOD[1:0] bits (Access mode) */
#define  XMC_BK1TMGWR3_MODE_0                   ((uint32_t)0x10000000)        /*!< Bit 0 */
#define  XMC_BK1TMGWR3_MODE_1                   ((uint32_t)0x20000000)        /*!< Bit 1 */

/******************  Bit definition for XMC_BK1TMGWR4 register  ******************/
#define  XMC_BK1TMGWR4_ADROP                    ((uint32_t)0x0000000F)        /*!< ADDSET[3:0] bits (Address setup phase duration) */
#define  XMC_BK1TMGWR4_ADROP_0                  ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  XMC_BK1TMGWR4_ADROP_1                  ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  XMC_BK1TMGWR4_ADROP_2                  ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  XMC_BK1TMGWR4_ADROP_3                  ((uint32_t)0x00000008)        /*!< Bit 3 */

#define  XMC_BK1TMGWR4_ADRHLD                   ((uint32_t)0x000000F0)        /*!< ADDHLD[3:0] bits (Address-hold phase duration) */
#define  XMC_BK1TMGWR4_ADRHLD_0                 ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  XMC_BK1TMGWR4_ADRHLD_1                 ((uint32_t)0x00000020)        /*!< Bit 1 */
#define  XMC_BK1TMGWR4_ADRHLD_2                 ((uint32_t)0x00000040)        /*!< Bit 2 */
#define  XMC_BK1TMGWR4_ADRHLD_3                 ((uint32_t)0x00000080)        /*!< Bit 3 */

#define  XMC_BK1TMGWR4_DTOP                     ((uint32_t)0x0000FF00)        /*!< DATAST [3:0] bits (Data-phase duration) */
#define  XMC_BK1TMGWR4_DTOP_0                   ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  XMC_BK1TMGWR4_DTOP_1                   ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  XMC_BK1TMGWR4_DTOP_2                   ((uint32_t)0x00000400)        /*!< Bit 2 */
#define  XMC_BK1TMGWR4_DTOP_3                   ((uint32_t)0x00000800)        /*!< Bit 3 */

#define  XMC_BK1TMGWR4_CLKPSC                   ((uint32_t)0x00F00000)        /*!< CLKDIV[3:0] bits (Clock divide ratio) */
#define  XMC_BK1TMGWR4_CLKPSC_0                 ((uint32_t)0x00100000)        /*!< Bit 0 */
#define  XMC_BK1TMGWR4_CLKPSC_1                 ((uint32_t)0x00200000)        /*!< Bit 1 */
#define  XMC_BK1TMGWR4_CLKPSC_2                 ((uint32_t)0x00400000)        /*!< Bit 2 */
#define  XMC_BK1TMGWR4_CLKPSC_3                 ((uint32_t)0x00800000)        /*!< Bit 3 */

#define  XMC_BK1TMGWR4_DTSTBL                   ((uint32_t)0x0F000000)        /*!< DATLA[3:0] bits (Data latency) */
#define  XMC_BK1TMGWR4_DTSTBL_0                 ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  XMC_BK1TMGWR4_DTSTBL_1                 ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  XMC_BK1TMGWR4_DTSTBL_2                 ((uint32_t)0x04000000)        /*!< Bit 2 */
#define  XMC_BK1TMGWR4_DTSTBL_3                 ((uint32_t)0x08000000)        /*!< Bit 3 */

#define  XMC_BK1TMGWR4_MODE                     ((uint32_t)0x30000000)        /*!< ACCMOD[1:0] bits (Access mode) */
#define  XMC_BK1TMGWR4_MODE_0                   ((uint32_t)0x10000000)        /*!< Bit 0 */
#define  XMC_BK1TMGWR4_MODE_1                   ((uint32_t)0x20000000)        /*!< Bit 1 */

/******************  Bit definition for XMC_BK2CTRL register  *******************/
#define  XMC_BK2CTRL_WAITEN                     ((uint32_t)0x00000002)        /*!< Wait feature enable bit */
#define  XMC_BK2CTRL_EN                         ((uint32_t)0x00000004)        /*!< PC Card/NAND Flash memory bank enable bit */
#define  XMC_BK2CTRL_DEV                        ((uint32_t)0x00000008)        /*!< Memory type */

#define  XMC_BK2CTRL_BUSTYPE                    ((uint32_t)0x00000030)        /*!< PWID[1:0] bits (NAND Flash databus width) */
#define  XMC_BK2CTRL_BUSTYPE_0                  ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  XMC_BK2CTRL_BUSTYPE_1                  ((uint32_t)0x00000020)        /*!< Bit 1 */

#define  XMC_BK2CTRL_ECCEN                      ((uint32_t)0x00000040)        /*!< ECC computation logic enable bit */

