RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#define  XMC_BK2CTRL_DLYCR                      ((uint32_t)0x00001E00)        /*!< TCLR[3:0] bits (CLE to RE delay) */
#define  XMC_BK2CTRL_DLYCR_0                    ((uint32_t)0x00000200)        /*!< Bit 0 */
#define  XMC_BK2CTRL_DLYCR_1                    ((uint32_t)0x00000400)        /*!< Bit 1 */
#define  XMC_BK2CTRL_DLYCR_2                    ((uint32_t)0x00000800)        /*!< Bit 2 */
#define  XMC_BK2CTRL_DLYCR_3                    ((uint32_t)0x00001000)        /*!< Bit 3 */

#define  XMC_BK2CTRL_DLYAR                      ((uint32_t)0x0001E000)        /*!< TAR[3:0] bits (ALE to RE delay) */
#define  XMC_BK2CTRL_DLYAR_0                    ((uint32_t)0x00002000)        /*!< Bit 0 */
#define  XMC_BK2CTRL_DLYAR_1                    ((uint32_t)0x00004000)        /*!< Bit 1 */
#define  XMC_BK2CTRL_DLYAR_2                    ((uint32_t)0x00008000)        /*!< Bit 2 */
#define  XMC_BK2CTRL_DLYAR_3                    ((uint32_t)0x00010000)        /*!< Bit 3 */

#define  XMC_BK2CTRL_ECCPGSIZE                  ((uint32_t)0x000E0000)        /*!< ECCPS[1:0] bits (ECC page size) */
#define  XMC_BK2CTRL_ECCPGSIZE_0                ((uint32_t)0x00020000)        /*!< Bit 0 */
#define  XMC_BK2CTRL_ECCPGSIZE_1                ((uint32_t)0x00040000)        /*!< Bit 1 */
#define  XMC_BK2CTRL_ECCPGSIZE_2                ((uint32_t)0x00080000)        /*!< Bit 2 */

/******************  Bit definition for XMC_BK3CTRL register  *******************/
#define  XMC_BK3CTRL_WAITEN                     ((uint32_t)0x00000002)        /*!< Wait feature enable bit */
#define  XMC_BK3CTRL_EN                         ((uint32_t)0x00000004)        /*!< PC Card/NAND Flash memory bank enable bit */
#define  XMC_BK3CTRL_DEV                        ((uint32_t)0x00000008)        /*!< Memory type */

#define  XMC_BK3CTRL_BUSTYPE                    ((uint32_t)0x00000030)        /*!< PWID[1:0] bits (NAND Flash databus width) */
#define  XMC_BK3CTRL_BUSTYPE_0                  ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  XMC_BK3CTRL_BUSTYPE_1                  ((uint32_t)0x00000020)        /*!< Bit 1 */

#define  XMC_BK3CTRL_ECCEN                      ((uint32_t)0x00000040)        /*!< ECC computation logic enable bit */

#define  XMC_BK3CTRL_DLYCR                      ((uint32_t)0x00001E00)        /*!< TCLR[3:0] bits (CLE to RE delay) */
#define  XMC_BK3CTRL_DLYCR_0                    ((uint32_t)0x00000200)        /*!< Bit 0 */
#define  XMC_BK3CTRL_DLYCR_1                    ((uint32_t)0x00000400)        /*!< Bit 1 */
#define  XMC_BK3CTRL_DLYCR_2                    ((uint32_t)0x00000800)        /*!< Bit 2 */
#define  XMC_BK3CTRL_DLYCR_3                    ((uint32_t)0x00001000)        /*!< Bit 3 */

#define  XMC_BK3CTRL_DLYAR                      ((uint32_t)0x0001E000)        /*!< TAR[3:0] bits (ALE to RE delay) */
#define  XMC_BK3CTRL_DLYAR_0                    ((uint32_t)0x00002000)        /*!< Bit 0 */
#define  XMC_BK3CTRL_DLYAR_1                    ((uint32_t)0x00004000)        /*!< Bit 1 */
#define  XMC_BK3CTRL_DLYAR_2                    ((uint32_t)0x00008000)        /*!< Bit 2 */
#define  XMC_BK3CTRL_DLYAR_3                    ((uint32_t)0x00010000)        /*!< Bit 3 */

#define  XMC_BK3CTRL_ECCPGSIZE                  ((uint32_t)0x000E0000)        /*!< ECCPS[2:0] bits (ECC page size) */
#define  XMC_BK3CTRL_ECCPGSIZE_0                ((uint32_t)0x00020000)        /*!< Bit 0 */
#define  XMC_BK3CTRL_ECCPGSIZE_1                ((uint32_t)0x00040000)        /*!< Bit 1 */
#define  XMC_BK3CTRL_ECCPGSIZE_2                ((uint32_t)0x00080000)        /*!< Bit 2 */

/******************  Bit definition for XMC_BK4CTRL register  *******************/
#define  XMC_BK4CTRL_WAITEN                     ((uint32_t)0x00000002)        /*!< Wait feature enable bit */
#define  XMC_BK4CTRL_EN                         ((uint32_t)0x00000004)        /*!< PC Card/NAND Flash memory bank enable bit */
#define  XMC_BK4CTRL_DEV                        ((uint32_t)0x00000008)        /*!< Memory type */

#define  XMC_BK4CTRL_BUSTYPE                    ((uint32_t)0x00000030)        /*!< PWID[1:0] bits (NAND Flash databus width) */
#define  XMC_BK4CTRL_BUSTYPE_0                  ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  XMC_BK4CTRL_BUSTYPE_1                  ((uint32_t)0x00000020)        /*!< Bit 1 */

#define  XMC_BK4CTRL_ECCEN                      ((uint32_t)0x00000040)        /*!< ECC computation logic enable bit */

#define  XMC_BK4CTRL_DLYCR                      ((uint32_t)0x00001E00)        /*!< TCLR[3:0] bits (CLE to RE delay) */
#define  XMC_BK4CTRL_DLYCR_0                    ((uint32_t)0x00000200)        /*!< Bit 0 */
#define  XMC_BK4CTRL_DLYCR_1                    ((uint32_t)0x00000400)        /*!< Bit 1 */
#define  XMC_BK4CTRL_DLYCR_2                    ((uint32_t)0x00000800)        /*!< Bit 2 */
#define  XMC_BK4CTRL_DLYCR_3                    ((uint32_t)0x00001000)        /*!< Bit 3 */

#define  XMC_BK4CTRL_DLYAR                      ((uint32_t)0x0001E000)        /*!< TAR[3:0] bits (ALE to RE delay) */
#define  XMC_BK4CTRL_DLYAR_0                    ((uint32_t)0x00002000)        /*!< Bit 0 */
#define  XMC_BK4CTRL_DLYAR_1                    ((uint32_t)0x00004000)        /*!< Bit 1 */
#define  XMC_BK4CTRL_DLYAR_2                    ((uint32_t)0x00008000)        /*!< Bit 2 */
#define  XMC_BK4CTRL_DLYAR_3                    ((uint32_t)0x00010000)        /*!< Bit 3 */

#define  XMC_BK4CTRL_ECCPGSIZE                  ((uint32_t)0x000E0000)        /*!< ECCPS[2:0] bits (ECC page size) */
#define  XMC_BK4CTRL_ECCPGSIZE_0                ((uint32_t)0x00020000)        /*!< Bit 0 */
#define  XMC_BK4CTRL_ECCPGSIZE_1                ((uint32_t)0x00040000)        /*!< Bit 1 */
#define  XMC_BK4CTRL_ECCPGSIZE_2                ((uint32_t)0x00080000)        /*!< Bit 2 */

/*******************  Bit definition for XMC_BK2STS register  *******************/
#define  XMC_BK2STS_IRF                         ((uint8_t)0x01)               /*!< Interrupt Rising Edge status */
#define  XMC_BK2STS_IHLF                        ((uint8_t)0x02)               /*!< Interrupt Level status */
#define  XMC_BK2STS_IFF                         ((uint8_t)0x04)               /*!< Interrupt Falling Edge status */
#define  XMC_BK2STS_IREN                        ((uint8_t)0x08)               /*!< Interrupt Rising Edge detection Enable bit */
#define  XMC_BK2STS_IHLEN                       ((uint8_t)0x10)               /*!< Interrupt Level detection Enable bit */
#define  XMC_BK2STS_IFEN                        ((uint8_t)0x20)               /*!< Interrupt Falling Edge detection Enable bit */
#define  XMC_BK2STS_FIFOE                       ((uint8_t)0x40)               /*!< FIFO empty */

/*******************  Bit definition for XMC_BK3STS register  *******************/
#define  XMC_BK3STS_IRF                         ((uint8_t)0x01)               /*!< Interrupt Rising Edge status */
#define  XMC_BK3STS_IHLF                        ((uint8_t)0x02)               /*!< Interrupt Level status */
#define  XMC_BK3STS_IFF                         ((uint8_t)0x04)               /*!< Interrupt Falling Edge status */
#define  XMC_BK3STS_IREN                        ((uint8_t)0x08)               /*!< Interrupt Rising Edge detection Enable bit */
#define  XMC_BK3STS_IHLEN                       ((uint8_t)0x10)               /*!< Interrupt Level detection Enable bit */
#define  XMC_BK3STS_IFEN                        ((uint8_t)0x20)               /*!< Interrupt Falling Edge detection Enable bit */
#define  XMC_BK3STS_FIFOE                       ((uint8_t)0x40)               /*!< FIFO empty */

