RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/*******************  Bit definition for XMC_BK4STS register  *******************/
#define  XMC_BK4STS_IRF                         ((uint8_t)0x01)               /*!< Interrupt Rising Edge status */
#define  XMC_BK4STS_IHLF                        ((uint8_t)0x02)               /*!< Interrupt Level status */
#define  XMC_BK4STS_IFF                         ((uint8_t)0x04)               /*!< Interrupt Falling Edge status */
#define  XMC_BK4STS_IREN                        ((uint8_t)0x08)               /*!< Interrupt Rising Edge detection Enable bit */
#define  XMC_BK4STS_IHLEN                       ((uint8_t)0x10)               /*!< Interrupt Level detection Enable bit */
#define  XMC_BK4STS_IFEN                        ((uint8_t)0x20)               /*!< Interrupt Falling Edge detection Enable bit */
#define  XMC_BK4STS_FIFOE                       ((uint8_t)0x40)               /*!< FIFO empty */

/******************  Bit definition for XMC_BK2TMGMEM register  ******************/
#define  XMC_BK2TMGMEM_STP                      ((uint32_t)0x000000FF)        /*!< MEMSET2[7:0] bits (Common memory 2 setup time) */
#define  XMC_BK2TMGMEM_STP_0                    ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  XMC_BK2TMGMEM_STP_1                    ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  XMC_BK2TMGMEM_STP_2                    ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  XMC_BK2TMGMEM_STP_3                    ((uint32_t)0x00000008)        /*!< Bit 3 */
#define  XMC_BK2TMGMEM_STP_4                    ((uint32_t)0x00000010)        /*!< Bit 4 */
#define  XMC_BK2TMGMEM_STP_5                    ((uint32_t)0x00000020)        /*!< Bit 5 */
#define  XMC_BK2TMGMEM_STP_6                    ((uint32_t)0x00000040)        /*!< Bit 6 */
#define  XMC_BK2TMGMEM_STP_7                    ((uint32_t)0x00000080)        /*!< Bit 7 */

#define  XMC_BK2TMGMEM_OP                       ((uint32_t)0x0000FF00)        /*!< MEMWAIT2[7:0] bits (Common memory 2 wait time) */
#define  XMC_BK2TMGMEM_OP_0                     ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  XMC_BK2TMGMEM_OP_1                     ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  XMC_BK2TMGMEM_OP_2                     ((uint32_t)0x00000400)        /*!< Bit 2 */
#define  XMC_BK2TMGMEM_OP_3                     ((uint32_t)0x00000800)        /*!< Bit 3 */
#define  XMC_BK2TMGMEM_OP_4                     ((uint32_t)0x00001000)        /*!< Bit 4 */
#define  XMC_BK2TMGMEM_OP_5                     ((uint32_t)0x00002000)        /*!< Bit 5 */
#define  XMC_BK2TMGMEM_OP_6                     ((uint32_t)0x00004000)        /*!< Bit 6 */
#define  XMC_BK2TMGMEM_OP_7                     ((uint32_t)0x00008000)        /*!< Bit 7 */

#define  XMC_BK2TMGMEM_HLD                      ((uint32_t)0x00FF0000)        /*!< MEMHOLD2[7:0] bits (Common memory 2 hold time) */
#define  XMC_BK2TMGMEM_HLD_0                    ((uint32_t)0x00010000)        /*!< Bit 0 */
#define  XMC_BK2TMGMEM_HLD_1                    ((uint32_t)0x00020000)        /*!< Bit 1 */
#define  XMC_BK2TMGMEM_HLD_2                    ((uint32_t)0x00040000)        /*!< Bit 2 */
#define  XMC_BK2TMGMEM_HLD_3                    ((uint32_t)0x00080000)        /*!< Bit 3 */
#define  XMC_BK2TMGMEM_HLD_4                    ((uint32_t)0x00100000)        /*!< Bit 4 */
#define  XMC_BK2TMGMEM_HLD_5                    ((uint32_t)0x00200000)        /*!< Bit 5 */
#define  XMC_BK2TMGMEM_HLD_6                    ((uint32_t)0x00400000)        /*!< Bit 6 */
#define  XMC_BK2TMGMEM_HLD_7                    ((uint32_t)0x00800000)        /*!< Bit 7 */

#define  XMC_BK2TMGMEM_WRSTP                    ((uint32_t)0xFF000000)        /*!< MEMHIZ2[7:0] bits (Common memory 2 databus HiZ time) */
#define  XMC_BK2TMGMEM_WRSTP_0                  ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  XMC_BK2TMGMEM_WRSTP_1                  ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  XMC_BK2TMGMEM_WRSTP_2                  ((uint32_t)0x04000000)        /*!< Bit 2 */
#define  XMC_BK2TMGMEM_WRSTP_3                  ((uint32_t)0x08000000)        /*!< Bit 3 */
#define  XMC_BK2TMGMEM_WRSTP_4                  ((uint32_t)0x10000000)        /*!< Bit 4 */
#define  XMC_BK2TMGMEM_WRSTP_5                  ((uint32_t)0x20000000)        /*!< Bit 5 */
#define  XMC_BK2TMGMEM_WRSTP_6                  ((uint32_t)0x40000000)        /*!< Bit 6 */
#define  XMC_BK2TMGMEM_WRSTP_7                  ((uint32_t)0x80000000)        /*!< Bit 7 */

/******************  Bit definition for XMC_BK3TMGMEM register  ******************/
#define  XMC_BK3TMGMEM_STP                      ((uint32_t)0x000000FF)        /*!< MEMSET3[7:0] bits (Common memory 3 setup time) */
#define  XMC_BK3TMGMEM_STP_0                    ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  XMC_BK3TMGMEM_STP_1                    ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  XMC_BK3TMGMEM_STP_2                    ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  XMC_BK3TMGMEM_STP_3                    ((uint32_t)0x00000008)        /*!< Bit 3 */
#define  XMC_BK3TMGMEM_STP_4                    ((uint32_t)0x00000010)        /*!< Bit 4 */
#define  XMC_BK3TMGMEM_STP_5                    ((uint32_t)0x00000020)        /*!< Bit 5 */
#define  XMC_BK3TMGMEM_STP_6                    ((uint32_t)0x00000040)        /*!< Bit 6 */
#define  XMC_BK3TMGMEM_STP_7                    ((uint32_t)0x00000080)        /*!< Bit 7 */

#define  XMC_BK3TMGMEM_OP                       ((uint32_t)0x0000FF00)        /*!< MEMWAIT3[7:0] bits (Common memory 3 wait time) */
#define  XMC_BK3TMGMEM_OP_0                     ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  XMC_BK3TMGMEM_OP_1                     ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  XMC_BK3TMGMEM_OP_2                     ((uint32_t)0x00000400)        /*!< Bit 2 */
#define  XMC_BK3TMGMEM_OP_3                     ((uint32_t)0x00000800)        /*!< Bit 3 */
#define  XMC_BK3TMGMEM_OP_4                     ((uint32_t)0x00001000)        /*!< Bit 4 */
#define  XMC_BK3TMGMEM_OP_5                     ((uint32_t)0x00002000)        /*!< Bit 5 */
#define  XMC_BK3TMGMEM_OP_6                     ((uint32_t)0x00004000)        /*!< Bit 6 */
#define  XMC_BK3TMGMEM_OP_7                     ((uint32_t)0x00008000)        /*!< Bit 7 */

