RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/******************  Bit definition for XMC_BK3TMGATT register  ******************/
#define  XMC_BK3TMGATT_STP                      ((uint32_t)0x000000FF)        /*!< ATTSET3[7:0] bits (Attribute memory 3 setup time) */
#define  XMC_BK3TMGATT_STP_0                    ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  XMC_BK3TMGATT_STP_1                    ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  XMC_BK3TMGATT_STP_2                    ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  XMC_BK3TMGATT_STP_3                    ((uint32_t)0x00000008)        /*!< Bit 3 */
#define  XMC_BK3TMGATT_STP_4                    ((uint32_t)0x00000010)        /*!< Bit 4 */
#define  XMC_BK3TMGATT_STP_5                    ((uint32_t)0x00000020)        /*!< Bit 5 */
#define  XMC_BK3TMGATT_STP_6                    ((uint32_t)0x00000040)        /*!< Bit 6 */
#define  XMC_BK3TMGATT_STP_7                    ((uint32_t)0x00000080)        /*!< Bit 7 */

#define  XMC_BK3TMGATT_OP                       ((uint32_t)0x0000FF00)        /*!< ATTWAIT3[7:0] bits (Attribute memory 3 wait time) */
#define  XMC_BK3TMGATT_OP_0                     ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  XMC_BK3TMGATT_OP_1                     ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  XMC_BK3TMGATT_OP_2                     ((uint32_t)0x00000400)        /*!< Bit 2 */
#define  XMC_BK3TMGATT_OP_3                     ((uint32_t)0x00000800)        /*!< Bit 3 */
#define  XMC_BK3TMGATT_OP_4                     ((uint32_t)0x00001000)        /*!< Bit 4 */
#define  XMC_BK3TMGATT_OP_5                     ((uint32_t)0x00002000)        /*!< Bit 5 */
#define  XMC_BK3TMGATT_OP_6                     ((uint32_t)0x00004000)        /*!< Bit 6 */
#define  XMC_BK3TMGATT_OP_7                     ((uint32_t)0x00008000)        /*!< Bit 7 */

#define  XMC_BK3TMGATT_HLD                      ((uint32_t)0x00FF0000)        /*!< ATTHOLD3[7:0] bits (Attribute memory 3 hold time) */
#define  XMC_BK3TMGATT_HLD_0                    ((uint32_t)0x00010000)        /*!< Bit 0 */
#define  XMC_BK3TMGATT_HLD_1                    ((uint32_t)0x00020000)        /*!< Bit 1 */
#define  XMC_BK3TMGATT_HLD_2                    ((uint32_t)0x00040000)        /*!< Bit 2 */
#define  XMC_BK3TMGATT_HLD_3                    ((uint32_t)0x00080000)        /*!< Bit 3 */
#define  XMC_BK3TMGATT_HLD_4                    ((uint32_t)0x00100000)        /*!< Bit 4 */
#define  XMC_BK3TMGATT_HLD_5                    ((uint32_t)0x00200000)        /*!< Bit 5 */
#define  XMC_BK3TMGATT_HLD_6                    ((uint32_t)0x00400000)        /*!< Bit 6 */
#define  XMC_BK3TMGATT_HLD_7                    ((uint32_t)0x00800000)        /*!< Bit 7 */

#define  XMC_BK3TMGATT_WRSTP                    ((uint32_t)0xFF000000)        /*!< ATTHIZ3[7:0] bits (Attribute memory 3 databus HiZ time) */
#define  XMC_BK3TMGATT_WRSTP_0                  ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  XMC_BK3TMGATT_WRSTP_1                  ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  XMC_BK3TMGATT_WRSTP_2                  ((uint32_t)0x04000000)        /*!< Bit 2 */
#define  XMC_BK3TMGATT_WRSTP_3                  ((uint32_t)0x08000000)        /*!< Bit 3 */
#define  XMC_BK3TMGATT_WRSTP_4                  ((uint32_t)0x10000000)        /*!< Bit 4 */
#define  XMC_BK3TMGATT_WRSTP_5                  ((uint32_t)0x20000000)        /*!< Bit 5 */
#define  XMC_BK3TMGATT_WRSTP_6                  ((uint32_t)0x40000000)        /*!< Bit 6 */
#define  XMC_BK3TMGATT_WRSTP_7                  ((uint32_t)0x80000000)        /*!< Bit 7 */

/******************  Bit definition for XMC_BK4TMGATT register  ******************/
#define  XMC_BK4TMGATT_STP                      ((uint32_t)0x000000FF)        /*!< ATTSET4[7:0] bits (Attribute memory 4 setup time) */
#define  XMC_BK4TMGATT_STP_0                    ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  XMC_BK4TMGATT_STP_1                    ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  XMC_BK4TMGATT_STP_2                    ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  XMC_BK4TMGATT_STP_3                    ((uint32_t)0x00000008)        /*!< Bit 3 */
#define  XMC_BK4TMGATT_STP_4                    ((uint32_t)0x00000010)        /*!< Bit 4 */
#define  XMC_BK4TMGATT_STP_5                    ((uint32_t)0x00000020)        /*!< Bit 5 */
#define  XMC_BK4TMGATT_STP_6                    ((uint32_t)0x00000040)        /*!< Bit 6 */
#define  XMC_BK4TMGATT_STP_7                    ((uint32_t)0x00000080)        /*!< Bit 7 */

#define  XMC_BK4TMGATT_OP                       ((uint32_t)0x0000FF00)        /*!< ATTWAIT4[7:0] bits (Attribute memory 4 wait time) */
#define  XMC_BK4TMGATT_OP_0                     ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  XMC_BK4TMGATT_OP_1                     ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  XMC_BK4TMGATT_OP_2                     ((uint32_t)0x00000400)        /*!< Bit 2 */
#define  XMC_BK4TMGATT_OP_3                     ((uint32_t)0x00000800)        /*!< Bit 3 */
#define  XMC_BK4TMGATT_OP_4                     ((uint32_t)0x00001000)        /*!< Bit 4 */
#define  XMC_BK4TMGATT_OP_5                     ((uint32_t)0x00002000)        /*!< Bit 5 */
#define  XMC_BK4TMGATT_OP_6                     ((uint32_t)0x00004000)        /*!< Bit 6 */
#define  XMC_BK4TMGATT_OP_7                     ((uint32_t)0x00008000)        /*!< Bit 7 */

#define  XMC_BK4TMGATT_HLD                      ((uint32_t)0x00FF0000)        /*!< ATTHOLD4[7:0] bits (Attribute memory 4 hold time) */
#define  XMC_BK4TMGATT_HLD_0                    ((uint32_t)0x00010000)        /*!< Bit 0 */
#define  XMC_BK4TMGATT_HLD_1                    ((uint32_t)0x00020000)        /*!< Bit 1 */
#define  XMC_BK4TMGATT_HLD_2                    ((uint32_t)0x00040000)        /*!< Bit 2 */
#define  XMC_BK4TMGATT_HLD_3                    ((uint32_t)0x00080000)        /*!< Bit 3 */
#define  XMC_BK4TMGATT_HLD_4                    ((uint32_t)0x00100000)        /*!< Bit 4 */
#define  XMC_BK4TMGATT_HLD_5                    ((uint32_t)0x00200000)        /*!< Bit 5 */
#define  XMC_BK4TMGATT_HLD_6                    ((uint32_t)0x00400000)        /*!< Bit 6 */
#define  XMC_BK4TMGATT_HLD_7                    ((uint32_t)0x00800000)        /*!< Bit 7 */

#define  XMC_BK4TMGATT_WRSTP                    ((uint32_t)0xFF000000)        /*!< ATTHIZ4[7:0] bits (Attribute memory 4 databus HiZ time) */
#define  XMC_BK4TMGATT_WRSTP_0                  ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  XMC_BK4TMGATT_WRSTP_1                  ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  XMC_BK4TMGATT_WRSTP_2                  ((uint32_t)0x04000000)        /*!< Bit 2 */
#define  XMC_BK4TMGATT_WRSTP_3                  ((uint32_t)0x08000000)        /*!< Bit 3 */
#define  XMC_BK4TMGATT_WRSTP_4                  ((uint32_t)0x10000000)        /*!< Bit 4 */
#define  XMC_BK4TMGATT_WRSTP_5                  ((uint32_t)0x20000000)        /*!< Bit 5 */
#define  XMC_BK4TMGATT_WRSTP_6                  ((uint32_t)0x40000000)        /*!< Bit 6 */
#define  XMC_BK4TMGATT_WRSTP_7                  ((uint32_t)0x80000000)        /*!< Bit 7 */

