RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/******************  Bit definition for XMC_BK4TMGIO register  *******************/
#define  XMC_BK4TMGIO_STP                       ((uint32_t)0x000000FF)        /*!< IOSET4[7:0] bits (I/O 4 setup time) */
#define  XMC_BK4TMGIO_STP_0                     ((uint32_t)0x00000001)        /*!< Bit 0 */
#define  XMC_BK4TMGIO_STP_1                     ((uint32_t)0x00000002)        /*!< Bit 1 */
#define  XMC_BK4TMGIO_STP_2                     ((uint32_t)0x00000004)        /*!< Bit 2 */
#define  XMC_BK4TMGIO_STP_3                     ((uint32_t)0x00000008)        /*!< Bit 3 */
#define  XMC_BK4TMGIO_STP_4                     ((uint32_t)0x00000010)        /*!< Bit 4 */
#define  XMC_BK4TMGIO_STP_5                     ((uint32_t)0x00000020)        /*!< Bit 5 */
#define  XMC_BK4TMGIO_STP_6                     ((uint32_t)0x00000040)        /*!< Bit 6 */
#define  XMC_BK4TMGIO_STP_7                     ((uint32_t)0x00000080)        /*!< Bit 7 */

#define  XMC_BK4TMGIO_OP                        ((uint32_t)0x0000FF00)        /*!< IOWAIT4[7:0] bits (I/O 4 wait time) */
#define  XMC_BK4TMGIO_OP_0                      ((uint32_t)0x00000100)        /*!< Bit 0 */
#define  XMC_BK4TMGIO_OP_1                      ((uint32_t)0x00000200)        /*!< Bit 1 */
#define  XMC_BK4TMGIO_OP_2                      ((uint32_t)0x00000400)        /*!< Bit 2 */
#define  XMC_BK4TMGIO_OP_3                      ((uint32_t)0x00000800)        /*!< Bit 3 */
#define  XMC_BK4TMGIO_OP_4                      ((uint32_t)0x00001000)        /*!< Bit 4 */
#define  XMC_BK4TMGIO_OP_5                      ((uint32_t)0x00002000)        /*!< Bit 5 */
#define  XMC_BK4TMGIO_OP_6                      ((uint32_t)0x00004000)        /*!< Bit 6 */
#define  XMC_BK4TMGIO_OP_7                      ((uint32_t)0x00008000)        /*!< Bit 7 */

#define  XMC_BK4TMGIO_HLD                       ((uint32_t)0x00FF0000)        /*!< IOHOLD4[7:0] bits (I/O 4 hold time) */
#define  XMC_BK4TMGIO_HLD_0                     ((uint32_t)0x00010000)        /*!< Bit 0 */
#define  XMC_BK4TMGIO_HLD_1                     ((uint32_t)0x00020000)        /*!< Bit 1 */
#define  XMC_BK4TMGIO_HLD_2                     ((uint32_t)0x00040000)        /*!< Bit 2 */
#define  XMC_BK4TMGIO_HLD_3                     ((uint32_t)0x00080000)        /*!< Bit 3 */
#define  XMC_BK4TMGIO_HLD_4                     ((uint32_t)0x00100000)        /*!< Bit 4 */
#define  XMC_BK4TMGIO_HLD_5                     ((uint32_t)0x00200000)        /*!< Bit 5 */
#define  XMC_BK4TMGIO_HLD_6                     ((uint32_t)0x00400000)        /*!< Bit 6 */
#define  XMC_BK4TMGIO_HLD_7                     ((uint32_t)0x00800000)        /*!< Bit 7 */

#define  XMC_BK4TMGIO_WRSTP                     ((uint32_t)0xFF000000)        /*!< IOHIZ4[7:0] bits (I/O 4 databus HiZ time) */
#define  XMC_BK4TMGIO_WRSTP_0                   ((uint32_t)0x01000000)        /*!< Bit 0 */
#define  XMC_BK4TMGIO_WRSTP_1                   ((uint32_t)0x02000000)        /*!< Bit 1 */
#define  XMC_BK4TMGIO_WRSTP_2                   ((uint32_t)0x04000000)        /*!< Bit 2 */
#define  XMC_BK4TMGIO_WRSTP_3                   ((uint32_t)0x08000000)        /*!< Bit 3 */
#define  XMC_BK4TMGIO_WRSTP_4                   ((uint32_t)0x10000000)        /*!< Bit 4 */
#define  XMC_BK4TMGIO_WRSTP_5                   ((uint32_t)0x20000000)        /*!< Bit 5 */
#define  XMC_BK4TMGIO_WRSTP_6                   ((uint32_t)0x40000000)        /*!< Bit 6 */
#define  XMC_BK4TMGIO_WRSTP_7                   ((uint32_t)0x80000000)        /*!< Bit 7 */

/******************  Bit definition for XMC_BK2ECC register  ******************/
#define  XMC_BK2ECC_ECC                         ((uint32_t)0xFFFFFFFF)        /*!< ECC result */

/******************  Bit definition for XMC_BK3ECC register  ******************/
#define  XMC_BK3ECC_ECC                         ((uint32_t)0xFFFFFFFF)        /*!< ECC result */

/******************************************************************************/
/*                                                                            */
/*                          SD host Interface                                 */
/*                                                                            */
/******************************************************************************/

/******************  Bit definition for SDIO_POWER register  ******************/
#define  SDIO_POWER_PWRCTRL                     ((uint8_t)0x03)               /*!< PWRCTRL[1:0] bits (Power supply control bits) */
#define  SDIO_POWER_PWRCTRL_0                   ((uint8_t)0x01)               /*!< Bit 0 */
#define  SDIO_POWER_PWRCTRL_1                   ((uint8_t)0x02)               /*!< Bit 1 */

/******************  Bit definition for SDIO_CLKCTRL register  ******************/
#define  SDIO_CLKCTRL_CLKPSC                    ((uint16_t)0x00FF)            /*!< Clock divide factor */
#define  SDIO_CLKCTRL_CLKEN                     ((uint16_t)0x0100)            /*!< Clock enable bit */
#define  SDIO_CLKCTRL_PWRSVG                    ((uint16_t)0x0200)            /*!< Power saving configuration bit */
#define  SDIO_CLKCTRL_BYPS                      ((uint16_t)0x0400)            /*!< Clock divider bypass enable bit */

#define  SDIO_CLKCTRL_BUSWIDTH                  ((uint16_t)0x1800)            /*!< WIDBUS[1:0] bits (Wide bus mode enable bit) */
#define  SDIO_CLKCR_WIDBUS_0                    ((uint16_t)0x0800)            /*!< Bit 0 */
#define  SDIO_CLKCR_WIDBUS_1                    ((uint16_t)0x1000)            /*!< Bit 1 */

#define  SDIO_CLKCTRL_CLKEDG                    ((uint16_t)0x2000)            /*!< SDIO_CK dephasing selection bit */
#define  SDIO_CLKCTRL_FLWCTRLEN                 ((uint16_t)0x4000)            /*!< HW Flow Control enable */

/*******************  Bit definition for SDIO_ARG register  *******************/
#define  SDIO_ARG_ARG                           ((uint32_t)0xFFFFFFFF)            /*!< Command argument */

/*******************  Bit definition for SDIO_CMD register  *******************/
#define  SDIO_CMD_CMDIDX                        ((uint16_t)0x003F)            /*!< Command Index */

#define  SDIO_CMD_RSPWT                         ((uint16_t)0x00C0)            /*!< WAITRESP[1:0] bits (Wait for response bits) */
#define  SDIO_CMD_WAITRESP_0                    ((uint16_t)0x0040)            /*!<  Bit 0 */
#define  SDIO_CMD_WAITRESP_1                    ((uint16_t)0x0080)            /*!<  Bit 1 */

#define  SDIO_CMD_INTWT                         ((uint16_t)0x0100)            /*!< CPSM Waits for Interrupt Request */
#define  SDIO_CMD_PNDWT                         ((uint16_t)0x0200)            /*!< CPSM Waits for ends of data transfer (CmdPend internal signal) */
#define  SDIO_CMD_CMDMEN                        ((uint16_t)0x0400)            /*!< Command path state machine (CPSM) Enable bit */
#define  SDIO_CMD_SDIOSUSP                      ((uint16_t)0x0800)            /*!< SD I/O suspend command */
#define  SDIO_CMD_CMPLSGNLEN                    ((uint16_t)0x1000)            /*!< Enable CMD completion */
#define  SDIO_CMD_INTDIS                        ((uint16_t)0x2000)            /*!< Interrupt Disable */
#define  SDIO_CMD_ATACMD                        ((uint16_t)0x4000)            /*!< CE-ATA command */

/*****************  Bit definition for SDIO_RSPCMD register  *****************/
#define  SDIO_RSPCMD_RSPCMD                     ((uint8_t)0x3F)               /*!< Response command index */

/******************  Bit definition for SDIO_RESP0 register  ******************/
#define  SDIO_RESP0_CARDSTATUS0                 ((uint32_t)0xFFFFFFFF)        /*!< Card Status */

