RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/******************  Bit definition for SDIO_RSP1 register  ******************/
#define  SDIO_RSP1_CARDSTS1                     ((uint32_t)0xFFFFFFFF)        /*!< Card Status */

/******************  Bit definition for SDIO_RSP2 register  ******************/
#define  SDIO_RSP2_CARDSTS2                     ((uint32_t)0xFFFFFFFF)        /*!< Card Status */

/******************  Bit definition for SDIO_RSP3 register  ******************/
#define  SDIO_RSP3_CARDSTS3                     ((uint32_t)0xFFFFFFFF)        /*!< Card Status */

/******************  Bit definition for SDIO_RSP4 register  ******************/
#define  SDIO_RSP4_CARDSTS4                     ((uint32_t)0xFFFFFFFF)        /*!< Card Status */

/******************  Bit definition for SDIO_DTTMR register  *****************/
#define  SDIO_DTTMR_TIMEOUT                     ((uint32_t)0xFFFFFFFF)        /*!< Data timeout period. */

/******************  Bit definition for SDIO_DTLEN register  *******************/
#define  SDIO_DTLEN_DTLEN                       ((uint32_t)0x01FFFFFF)        /*!< Data length value */

/******************  Bit definition for SDIO_DTCTRL register  ******************/
#define  SDIO_DTCTRL_TFREN                      ((uint16_t)0x0001)            /*!< Data transfer enabled bit */
#define  SDIO_DTCTRL_TFRDIR                     ((uint16_t)0x0002)            /*!< Data transfer direction selection */
#define  SDIO_DTCTRL_TFRMODE                    ((uint16_t)0x0004)            /*!< Data transfer mode selection */
#define  SDIO_DTCTRL_DMAEN                      ((uint16_t)0x0008)            /*!< DMA enabled bit */

#define  SDIO_DTCTRL_BLKSIZE                    ((uint16_t)0x00F0)            /*!< DBLOCKSIZE[3:0] bits (Data block size) */
#define  SDIO_DTCTRL_DBLOCKSIZE_0               ((uint16_t)0x0010)            /*!< Bit 0 */
#define  SDIO_DTCTRL_DBLOCKSIZE_1               ((uint16_t)0x0020)            /*!< Bit 1 */
#define  SDIO_DTCTRL_DBLOCKSIZE_2               ((uint16_t)0x0040)            /*!< Bit 2 */
#define  SDIO_DTCTRL_DBLOCKSIZE_3               ((uint16_t)0x0080)            /*!< Bit 3 */

#define  SDIO_DTCTRL_RDWTSTART                  ((uint16_t)0x0100)            /*!< Read wait start */
#define  SDIO_DTCTRL_RDWTSTOP                   ((uint16_t)0x0200)            /*!< Read wait stop */
#define  SDIO_DTCTRL_RDWTMODE                   ((uint16_t)0x0400)            /*!< Read wait mode */
#define  SDIO_DTCTRL_SDIOEN                     ((uint16_t)0x0800)            /*!< SD I/O enable functions */

/******************  Bit definition for SDIO_DTCNTR register  *****************/
#define  SDIO_DTCNTR_DTCNT                      ((uint32_t)0x01FFFFFF)        /*!< Data count value */

/******************  Bit definition for SDIO_STS register  ********************/
#define  SDIO_STS_CMDFAIL                       ((uint32_t)0x00000001)        /*!< Command response received (CRC check failed) */
#define  SDIO_STS_DTFAIL                        ((uint32_t)0x00000002)        /*!< Data block sent/received (CRC check failed) */
#define  SDIO_STS_CMDTIMEOUT                    ((uint32_t)0x00000004)        /*!< Command response timeout */
#define  SDIO_STS_DTTIMEOUT                     ((uint32_t)0x00000008)        /*!< Data timeout */
#define  SDIO_STS_TXERRU                        ((uint32_t)0x00000010)        /*!< Transmit FIFO underrun error */
#define  SDIO_STS_RXERRO                        ((uint32_t)0x00000020)        /*!< Received FIFO overrun error */
#define  SDIO_STS_CMDRSPCMPL                    ((uint32_t)0x00000040)        /*!< Command response received (CRC check passed) */
#define  SDIO_STS_CMDCMPL                       ((uint32_t)0x00000080)        /*!< Command sent (no response required) */
#define  SDIO_STS_DTCMPL                        ((uint32_t)0x00000100)        /*!< Data end (data counter, SDIDCOUNT, is zero) */
#define  SDIO_STS_SBITERR                       ((uint32_t)0x00000200)        /*!< Start bit not detected on all data signals in wide bus mode */
#define  SDIO_STS_DTBLKCMPL                     ((uint32_t)0x00000400)        /*!< Data block sent/received (CRC check passed) */
#define  SDIO_STS_DOCMD                         ((uint32_t)0x00000800)        /*!< Command transfer in progress */
#define  SDIO_STS_DOTX                          ((uint32_t)0x00001000)        /*!< Data transmit in progress */
#define  SDIO_STS_DORX                          ((uint32_t)0x00002000)        /*!< Data receive in progress */
#define  SDIO_STS_TXBUF_H                       ((uint32_t)0x00004000)        /*!< Transmit FIFO Half Empty: at least 8 words can be written into the FIFO */
#define  SDIO_STS_RXBUF_H                       ((uint32_t)0x00008000)        /*!< Receive FIFO Half Full: there are at least 8 words in the FIFO */
#define  SDIO_STS_TXBUF_F                       ((uint32_t)0x00010000)        /*!< Transmit FIFO full */
#define  SDIO_STS_RXBUF_F                       ((uint32_t)0x00020000)        /*!< Receive FIFO full */
#define  SDIO_STS_TXBUF_E                       ((uint32_t)0x00040000)        /*!< Transmit FIFO empty */
#define  SDIO_STS_RXBUF_E                       ((uint32_t)0x00080000)        /*!< Receive FIFO empty */
#define  SDIO_STS_TXBUF                         ((uint32_t)0x00100000)        /*!< Data available in transmit FIFO */
#define  SDIO_STS_RXBUF                         ((uint32_t)0x00200000)        /*!< Data available in receive FIFO */
#define  SDIO_STS_SDIOIF                        ((uint32_t)0x00400000)        /*!< SDIO interrupt received */
#define  SDIO_STS_ATACMPL                       ((uint32_t)0x00800000)        /*!< CE-ATA command completion signal received for CMD61 */

/*******************  Bit definition for SDIO_INTCLR register  *******************/
#define  SDIO_INTCLR_CMDFAIL                    ((uint32_t)0x00000001)        /*!< CCRCFAIL flag clear bit */
#define  SDIO_INTCLR_DTFAIL                     ((uint32_t)0x00000002)        /*!< DCRCFAIL flag clear bit */
#define  SDIO_INTCLR_CMDTIMEOUT                 ((uint32_t)0x00000004)        /*!< CTIMEOUT flag clear bit */
#define  SDIO_INTCLR_DTTIMEOUT                  ((uint32_t)0x00000008)        /*!< DTIMEOUT flag clear bit */
#define  SDIO_INTCLR_TXERRU                     ((uint32_t)0x00000010)        /*!< TXUNDERR flag clear bit */
#define  SDIO_INTCLR_RXERRO                     ((uint32_t)0x00000020)        /*!< RXOVERR flag clear bit */
#define  SDIO_INTCLR_CMDRSPCMPL                 ((uint32_t)0x00000040)        /*!< CMDREND flag clear bit */
#define  SDIO_INTCLR_CMDCMPL                    ((uint32_t)0x00000080)        /*!< CMDSENT flag clear bit */
#define  SDIO_INTCLR_DTCMPL                     ((uint32_t)0x00000100)        /*!< DATAEND flag clear bit */
#define  SDIO_INTCLR_SBITERR                    ((uint32_t)0x00000200)        /*!< STBITERR flag clear bit */
#define  SDIO_INTCLR_DTBLKCMPL                  ((uint32_t)0x00000400)        /*!< DBCKEND flag clear bit */
#define  SDIO_INTCLR_SDIOIF                     ((uint32_t)0x00400000)        /*!< SDIOIT flag clear bit */
#define  SDIO_INTCLR_ATACMPL                    ((uint32_t)0x00800000)        /*!< CEATAEND flag clear bit */

/******************  Bit definition for SDIO_MASK register  *******************/
#define  SDIO_MASK_CCRCFAILIE                   ((uint32_t)0x00000001)        /*!< Command CRC Fail Interrupt Enable */
#define  SDIO_INTEN_DTFAIL                      ((uint32_t)0x00000002)        /*!< Data CRC Fail Interrupt Enable */
#define  SDIO_INTEN_CMDTIMEOUT                  ((uint32_t)0x00000004)        /*!< Command TimeOut Interrupt Enable */
#define  SDIO_INTEN_DTTIMEOUT                   ((uint32_t)0x00000008)        /*!< Data TimeOut Interrupt Enable */
#define  SDIO_INTEN_TXERRU                      ((uint32_t)0x00000010)        /*!< Tx FIFO UnderRun Error Interrupt Enable */
#define  SDIO_INTEN_RXERRO                      ((uint32_t)0x00000020)        /*!< Rx FIFO OverRun Error Interrupt Enable */
#define  SDIO_INTEN_CMDRSPCMPL                  ((uint32_t)0x00000040)        /*!< Command Response Received Interrupt Enable */
#define  SDIO_INTEN_CMDCMPL                     ((uint32_t)0x00000080)        /*!< Command Sent Interrupt Enable */
#define  SDIO_INTEN_DTCMPL                      ((uint32_t)0x00000100)        /*!< Data End Interrupt Enable */
#define  SDIO_INTEN_SBITERR                     ((uint32_t)0x00000200)        /*!< Start Bit Error Interrupt Enable */
#define  SDIO_INTEN_DTBLKCMPL                   ((uint32_t)0x00000400)        /*!< Data Block End Interrupt Enable */
#define  SDIO_INTEN_DOCMD                       ((uint32_t)0x00000800)        /*!< Command Acting Interrupt Enable */
#define  SDIO_INTEN_DOTX                        ((uint32_t)0x00001000)        /*!< Data Transmit Acting Interrupt Enable */
#define  SDIO_INTEN_DORX                        ((uint32_t)0x00002000)        /*!< Data receive acting interrupt enabled */
#define  SDIO_INTEN_TXBUF_H                     ((uint32_t)0x00004000)        /*!< Tx FIFO Half Empty interrupt Enable */
#define  SDIO_INTEN_RXBUF_H                     ((uint32_t)0x00008000)        /*!< Rx FIFO Half Full interrupt Enable */
#define  SDIO_INTEN_TXBUF_F                     ((uint32_t)0x00010000)        /*!< Tx FIFO Full interrupt Enable */
#define  SDIO_INTEN_RXBUF_F                     ((uint32_t)0x00020000)        /*!< Rx FIFO Full interrupt Enable */
#define  SDIO_INTEN_TXBUF_E                     ((uint32_t)0x00040000)        /*!< Tx FIFO Empty interrupt Enable */
#define  SDIO_INTEN_RXBUF_E                     ((uint32_t)0x00080000)        /*!< Rx FIFO Empty interrupt Enable */
#define  SDIO_INTEN_TXBUF                       ((uint32_t)0x00100000)        /*!< Data available in Tx FIFO interrupt Enable */
#define  SDIO_INTEN_RXBUF                       ((uint32_t)0x00200000)        /*!< Data available in Rx FIFO interrupt Enable */
#define  SDIO_INTEN_SDIOIF                      ((uint32_t)0x00400000)        /*!< SDIO Mode Interrupt Received interrupt Enable */
#define  SDIO_INTEN_ATACMPL                     ((uint32_t)0x00800000)        /*!< CE-ATA command completion signal received Interrupt Enable */

/*****************  Bit definition for SDIO_BUFCNTR register  *****************/
#define  SDIO_BUFCNTR_CNT                       ((uint32_t)0x00FFFFFF)        /*!< Remaining number of words to be written to or read from the FIFO */

/******************  Bit definition for SDIO_BUF register  *******************/
#define  SDIO_BUF_DT                            ((uint32_t)0xFFFFFFFF)        /*!< Receive and transmit BUF data */

/******************************************************************************/
/*                                                                            */
/*                                   USB Device FS                            */
/*                                                                            */
/******************************************************************************/

/** Endpoint-specific registers */
/*******************  Bit definition for USB_EPT0 register  *******************/
#define  USB_EPT0_EPTADR                        ((uint16_t)0x000F)            /*!< Endpoint Address */

#define  USB_EPT0_STS_TX                        ((uint16_t)0x0030)            /*!< STAT_TX[1:0] bits (Status bits, for transmission transfers) */
#define  USB_EPT0_STS_TX_0                      ((uint16_t)0x0010)            /*!< Bit 0 */
#define  USB_EPT0_STS_TX_1                      ((uint16_t)0x0020)            /*!< Bit 1 */

#define  USB_EPT0_DTOG_TX                       ((uint16_t)0x0040)            /*!< Data Toggle, for transmission transfers */
#define  USB_EPT0_CTFR_TX                       ((uint16_t)0x0080)            /*!< Correct Transfer for transmission */
#define  USB_EPT0_EPT_SUBTYPE                   ((uint16_t)0x0100)            /*!< Endpoint Kind */

#define  USB_EPT0_EPT_TYPE                      ((uint16_t)0x0600)            /*!< EP_TYPE[1:0] bits (Endpoint type) */
#define  USB_EPT0_EPT_TYPE_0                    ((uint16_t)0x0200)            /*!< Bit 0 */
#define  USB_EPT0_EPT_TYPE_1                    ((uint16_t)0x0400)            /*!< Bit 1 */

#define  USB_EPT0_SETUP                         ((uint16_t)0x0800)            /*!< Setup transaction completed */

#define  USB_EPT0_STS_RX                        ((uint16_t)0x3000)            /*!< STAT_RX[1:0] bits (Status bits, for reception transfers) */
#define  USB_EPT0_STS_RX_0                      ((uint16_t)0x1000)            /*!< Bit 0 */
#define  USB_EPT0_STS_RX_1                      ((uint16_t)0x2000)            /*!< Bit 1 */

#define  USB_EPT0_DTOG_RX                       ((uint16_t)0x4000)            /*!< Data Toggle, for reception transfers */
#define  USB_EPT0_CTFR_RX                       ((uint16_t)0x8000)            /*!< Correct Transfer for reception */

