RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/*******************  Bit definition for USB_EPT1 register  *******************/
#define  USB_EPT1_EPTADR                        ((uint16_t)0x000F)            /*!< Endpoint Address */

#define  USB_EPT1_STS_TX                        ((uint16_t)0x0030)            /*!< STAT_TX[1:0] bits (Status bits, for transmission transfers) */
#define  USB_EPT1_STS_TX_0                      ((uint16_t)0x0010)            /*!< Bit 0 */
#define  USB_EPT1_STS_TX_1                      ((uint16_t)0x0020)            /*!< Bit 1 */

#define  USB_EPT1_DTOG_TX                       ((uint16_t)0x0040)            /*!< Data Toggle, for transmission transfers */
#define  USB_EPT1_CTFR_TX                       ((uint16_t)0x0080)            /*!< Correct Transfer for transmission */
#define  USB_EPT1_EPT_SUBTYPE                   ((uint16_t)0x0100)            /*!< Endpoint Kind */

#define  USB_EPT1_EPT_TYPE                      ((uint16_t)0x0600)            /*!< EP_TYPE[1:0] bits (Endpoint type) */
#define  USB_EPT1_EPT_TYPE_0                    ((uint16_t)0x0200)            /*!< Bit 0 */
#define  USB_EPT1_EPT_TYPE_1                    ((uint16_t)0x0400)            /*!< Bit 1 */

#define  USB_EPT1_SETUP                         ((uint16_t)0x0800)            /*!< Setup transaction completed */

#define  USB_EPT1_STS_RX                        ((uint16_t)0x3000)            /*!< STAT_RX[1:0] bits (Status bits, for reception transfers) */
#define  USB_EPT1_STS_RX_0                      ((uint16_t)0x1000)            /*!< Bit 0 */
#define  USB_EPT1_STS_RX_1                      ((uint16_t)0x2000)            /*!< Bit 1 */

#define  USB_EPT1_DTOG_RX                       ((uint16_t)0x4000)            /*!< Data Toggle, for reception transfers */
#define  USB_EPT1_CTFR_RX                       ((uint16_t)0x8000)            /*!< Correct Transfer for reception */

/*******************  Bit definition for USB_EPT2 register  *******************/
#define  USB_EPT2_EPTADR                        ((uint16_t)0x000F)            /*!< Endpoint Address */

#define  USB_EPT2_STS_TX                        ((uint16_t)0x0030)            /*!< STAT_TX[1:0] bits (Status bits, for transmission transfers) */
#define  USB_EPT2_STS_TX_0                      ((uint16_t)0x0010)            /*!< Bit 0 */
#define  USB_EPT2_STS_TX_1                      ((uint16_t)0x0020)            /*!< Bit 1 */

#define  USB_EPT2_DTOG_TX                       ((uint16_t)0x0040)            /*!< Data Toggle, for transmission transfers */
#define  USB_EPT2_CTFR_TX                       ((uint16_t)0x0080)            /*!< Correct Transfer for transmission */
#define  USB_EPT2_EPT_SUBTYPE                   ((uint16_t)0x0100)            /*!< Endpoint Kind */

#define  USB_EPT2_EPT_TYPE                      ((uint16_t)0x0600)            /*!< EP_TYPE[1:0] bits (Endpoint type) */
#define  USB_EPT2_EPT_TYPE_0                    ((uint16_t)0x0200)            /*!< Bit 0 */
#define  USB_EPT2_EPT_TYPE_1                    ((uint16_t)0x0400)            /*!< Bit 1 */

#define  USB_EPT2_SETUP                         ((uint16_t)0x0800)            /*!< Setup transaction completed */

#define  USB_EPT2_STS_RX                        ((uint16_t)0x3000)            /*!< STAT_RX[1:0] bits (Status bits, for reception transfers) */
#define  USB_EPT2_STS_RX_0                      ((uint16_t)0x1000)            /*!< Bit 0 */
#define  USB_EPT2_STS_RX_1                      ((uint16_t)0x2000)            /*!< Bit 1 */

#define  USB_EPT2_DTOG_RX                       ((uint16_t)0x4000)            /*!< Data Toggle, for reception transfers */
#define  USB_EPT2_CTFR_RX                       ((uint16_t)0x8000)            /*!< Correct Transfer for reception */

/*******************  Bit definition for USB_EPT3 register  *******************/
#define  USB_EPT3_EPTADR                        ((uint16_t)0x000F)            /*!< Endpoint Address */

#define  USB_EPT3_STS_TX                        ((uint16_t)0x0030)            /*!< STAT_TX[1:0] bits (Status bits, for transmission transfers) */
#define  USB_EPT3_STS_TX_0                      ((uint16_t)0x0010)            /*!< Bit 0 */
#define  USB_EPT3_STS_TX_1                      ((uint16_t)0x0020)            /*!< Bit 1 */

#define  USB_EPT3_DTOG_TX                       ((uint16_t)0x0040)            /*!< Data Toggle, for transmission transfers */
#define  USB_EPT3_CTFR_TX                       ((uint16_t)0x0080)            /*!< Correct Transfer for transmission */
#define  USB_EPT3_EPT_SUBTYPE                   ((uint16_t)0x0100)            /*!< Endpoint Kind */

#define  USB_EPT3_EPT_TYPE                      ((uint16_t)0x0600)            /*!< EP_TYPE[1:0] bits (Endpoint type) */
#define  USB_EPT3_EPT_TYPE_0                    ((uint16_t)0x0200)            /*!< Bit 0 */
#define  USB_EPT3_EPT_TYPE_1                    ((uint16_t)0x0400)            /*!< Bit 1 */

#define  USB_EPT3_SETUP                         ((uint16_t)0x0800)            /*!< Setup transaction completed */

#define  USB_EPT3_STS_RX                        ((uint16_t)0x3000)            /*!< STAT_RX[1:0] bits (Status bits, for reception transfers) */
#define  USB_EPT3_STS_RX_0                      ((uint16_t)0x1000)            /*!< Bit 0 */
#define  USB_EPT3_STS_RX_1                      ((uint16_t)0x2000)            /*!< Bit 1 */

#define  USB_EPT3_DTOG_RX                       ((uint16_t)0x4000)            /*!< Data Toggle, for reception transfers */
#define  USB_EPT3_CTFR_RX                       ((uint16_t)0x8000)            /*!< Correct Transfer for reception */

/*******************  Bit definition for USB_EPT4 register  *******************/
#define  USB_EPT4_EPTADR                        ((uint16_t)0x000F)            /*!< Endpoint Address */

#define  USB_EPT4_STS_TX                        ((uint16_t)0x0030)            /*!< STAT_TX[1:0] bits (Status bits, for transmission transfers) */
#define  USB_EPT4_STS_TX_0                      ((uint16_t)0x0010)            /*!< Bit 0 */
#define  USB_EPT4_STS_TX_1                      ((uint16_t)0x0020)            /*!< Bit 1 */

#define  USB_EPT4_DTOG_TX                       ((uint16_t)0x0040)            /*!< Data Toggle, for transmission transfers */
#define  USB_EPT4_CTFR_TX                       ((uint16_t)0x0080)            /*!< Correct Transfer for transmission */
#define  USB_EPT4_EPT_SUBTYPE                   ((uint16_t)0x0100)            /*!< Endpoint Kind */

#define  USB_EPT4_EPT_TYPE                      ((uint16_t)0x0600)            /*!< EP_TYPE[1:0] bits (Endpoint type) */
#define  USB_EPT4_EPT_TYPE_0                    ((uint16_t)0x0200)            /*!< Bit 0 */
#define  USB_EPT4_EPT_TYPE_1                    ((uint16_t)0x0400)            /*!< Bit 1 */

#define  USB_EPT4_SETUP                         ((uint16_t)0x0800)            /*!< Setup transaction completed */

