RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#define  USB_EPT4_STS_RX                        ((uint16_t)0x3000)            /*!< STAT_RX[1:0] bits (Status bits, for reception transfers) */
#define  USB_EPT4_STS_RX_0                      ((uint16_t)0x1000)            /*!< Bit 0 */
#define  USB_EPT4_STS_RX_1                      ((uint16_t)0x2000)            /*!< Bit 1 */

#define  USB_EPT4_DTOG_RX                       ((uint16_t)0x4000)            /*!< Data Toggle, for reception transfers */
#define  USB_EPT4_CTFR_RX                       ((uint16_t)0x8000)            /*!< Correct Transfer for reception */

/*******************  Bit definition for USB_EPT5 register  *******************/
#define  USB_EPT5_EPTADR                        ((uint16_t)0x000F)            /*!< Endpoint Address */

#define  USB_EPT5_STS_TX                        ((uint16_t)0x0030)            /*!< STAT_TX[1:0] bits (Status bits, for transmission transfers) */
#define  USB_EPT5_STS_TX_0                      ((uint16_t)0x0010)            /*!< Bit 0 */
#define  USB_EPT5_STS_TX_1                      ((uint16_t)0x0020)            /*!< Bit 1 */

#define  USB_EPT5_DTOG_TX                       ((uint16_t)0x0040)            /*!< Data Toggle, for transmission transfers */
#define  USB_EPT5_CTFR_TX                       ((uint16_t)0x0080)            /*!< Correct Transfer for transmission */
#define  USB_EPT5_EPT_SUBTYPE                   ((uint16_t)0x0100)            /*!< Endpoint Kind */

#define  USB_EPT5_EPT_TYPE                      ((uint16_t)0x0600)            /*!< EP_TYPE[1:0] bits (Endpoint type) */
#define  USB_EPT5_EPT_TYPE_0                    ((uint16_t)0x0200)            /*!< Bit 0 */
#define  USB_EPT5_EPT_TYPE_1                    ((uint16_t)0x0400)            /*!< Bit 1 */

#define  USB_EPT5_SETUP                         ((uint16_t)0x0800)            /*!< Setup transaction completed */

#define  USB_EPT5_STS_RX                        ((uint16_t)0x3000)            /*!< STAT_RX[1:0] bits (Status bits, for reception transfers) */
#define  USB_EPT5_STS_RX_0                      ((uint16_t)0x1000)            /*!< Bit 0 */
#define  USB_EPT5_STS_RX_1                      ((uint16_t)0x2000)            /*!< Bit 1 */

#define  USB_EPT5_DTOG_RX                       ((uint16_t)0x4000)            /*!< Data Toggle, for reception transfers */
#define  USB_EPT5_CTFR_RX                       ((uint16_t)0x8000)            /*!< Correct Transfer for reception */

/*******************  Bit definition for USB_EPT6 register  *******************/
#define  USB_EPT6_EPTADR                        ((uint16_t)0x000F)            /*!< Endpoint Address */

#define  USB_EPT6_STS_TX                        ((uint16_t)0x0030)            /*!< STAT_TX[1:0] bits (Status bits, for transmission transfers) */
#define  USB_EPT6_STS_TX_0                      ((uint16_t)0x0010)            /*!< Bit 0 */
#define  USB_EPT6_STS_TX_1                      ((uint16_t)0x0020)            /*!< Bit 1 */

#define  USB_EPT6_DTOG_TX                       ((uint16_t)0x0040)            /*!< Data Toggle, for transmission transfers */
#define  USB_EPT6_CTFR_TX                       ((uint16_t)0x0080)            /*!< Correct Transfer for transmission */
#define  USB_EPT6_EPT_SUBTYPE                   ((uint16_t)0x0100)            /*!< Endpoint Kind */

#define  USB_EPT6_EPT_TYPE                      ((uint16_t)0x0600)            /*!< EP_TYPE[1:0] bits (Endpoint type) */
#define  USB_EPT6_EPT_TYPE_0                    ((uint16_t)0x0200)            /*!< Bit 0 */
#define  USB_EPT6_EPT_TYPE_1                    ((uint16_t)0x0400)            /*!< Bit 1 */

#define  USB_EPT6_SETUP                         ((uint16_t)0x0800)            /*!< Setup transaction completed */

#define  USB_EPT6_STS_RX                        ((uint16_t)0x3000)            /*!< STAT_RX[1:0] bits (Status bits, for reception transfers) */
#define  USB_EPT6_STS_RX_0                      ((uint16_t)0x1000)            /*!< Bit 0 */
#define  USB_EPT6_STS_RX_1                      ((uint16_t)0x2000)            /*!< Bit 1 */

#define  USB_EPT6_DTOG_RX                       ((uint16_t)0x4000)            /*!< Data Toggle, for reception transfers */
#define  USB_EPT6_CTFR_RX                       ((uint16_t)0x8000)            /*!< Correct Transfer for reception */

/*******************  Bit definition for USB_EPT7 register  *******************/
#define  USB_EPT7_EPTADR                        ((uint16_t)0x000F)            /*!< Endpoint Address */

#define  USB_EPT7_STS_TX                        ((uint16_t)0x0030)            /*!< STAT_TX[1:0] bits (Status bits, for transmission transfers) */
#define  USB_EPT7_STS_TX_0                      ((uint16_t)0x0010)            /*!< Bit 0 */
#define  USB_EPT7_STS_TX_1                      ((uint16_t)0x0020)            /*!< Bit 1 */

#define  USB_EPT7_DTOG_TX                       ((uint16_t)0x0040)            /*!< Data Toggle, for transmission transfers */
#define  USB_EPT7_CTFR_TX                       ((uint16_t)0x0080)            /*!< Correct Transfer for transmission */
#define  USB_EPT7_EPT_SUBTYPE                   ((uint16_t)0x0100)            /*!< Endpoint Kind */

#define  USB_EPT7_EPT_TYPE                      ((uint16_t)0x0600)            /*!< EP_TYPE[1:0] bits (Endpoint type) */
#define  USB_EPT7_EPT_TYPE_0                    ((uint16_t)0x0200)            /*!< Bit 0 */
#define  USB_EPT7_EPT_TYPE_1                    ((uint16_t)0x0400)            /*!< Bit 1 */

#define  USB_EPT7_SETUP                         ((uint16_t)0x0800)            /*!< Setup transaction completed */

#define  USB_EPT7_STS_RX                        ((uint16_t)0x3000)            /*!< STAT_RX[1:0] bits (Status bits, for reception transfers) */
#define  USB_EPT7_STS_RX_0                      ((uint16_t)0x1000)            /*!< Bit 0 */
#define  USB_EPT7_STS_RX_1                      ((uint16_t)0x2000)            /*!< Bit 1 */

#define  USB_EPT7_DTOG_RX                       ((uint16_t)0x4000)            /*!< Data Toggle, for reception transfers */
#define  USB_EPT7_CTFR_RX                       ((uint16_t)0x8000)            /*!< Correct Transfer for reception */

/** Common registers */
/*******************  Bit definition for USB_CTRL register  *******************/
#define  USB_CTRL_FRST                          ((uint16_t)0x0001)            /*!< Force USB Reset */
#define  USB_CTRL_PDWN                          ((uint16_t)0x0002)            /*!< Power down */
#define  USB_CTRL_LPWR                          ((uint16_t)0x0004)            /*!< Low-power mode */
#define  USB_CTRL_FSUSP                         ((uint16_t)0x0008)            /*!< Force suspend */
#define  USB_CTRL_RESUME                        ((uint16_t)0x0010)            /*!< Resume request */
#define  USB_CTRL_ESOF_IEN                      ((uint16_t)0x0100)            /*!< Expected Start Of Frame Interrupt Mask */
#define  USB_CTRL_SOF_IEN                       ((uint16_t)0x0200)            /*!< Start Of Frame Interrupt Mask */
#define  USB_CTRL_RST_IEN                       ((uint16_t)0x0400)            /*!< RESET Interrupt Mask */
#define  USB_CTRL_SUSP_IEN                      ((uint16_t)0x0800)            /*!< Suspend mode Interrupt Mask */
#define  USB_CTRL_WKUP_IEN                      ((uint16_t)0x1000)            /*!< Wakeup Interrupt Mask */
#define  USB_CTRL_ERR_IEN                       ((uint16_t)0x2000)            /*!< Error Interrupt Mask */
#define  USB_CTRL_PMOVR_IEN                     ((uint16_t)0x4000)            /*!< Packet Memory Area Over / Underrun Interrupt Mask */
#define  USB_CTRL_CTFR_IEN                      ((uint16_t)0x8000)            /*!< Correct Transfer Interrupt Mask */

