RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/*******************  Bit definition for USB_INTSTS register  *******************/
#define  USB_INTSTS_EPT_ID                      ((uint16_t)0x000F)            /*!< Endpoint Identifier */
#define  USB_INTSTS_DIR                         ((uint16_t)0x0010)            /*!< Direction of transaction */
#define  USB_INTSTS_ESOF                        ((uint16_t)0x0100)            /*!< Expected Start Of Frame */
#define  USB_INTSTS_SOFF                        ((uint16_t)0x0200)            /*!< Start Of Frame */
#define  USB_INTSTS_RSTF                        ((uint16_t)0x0400)            /*!< USB RESET request */
#define  USB_INTSTS_SUSPF                       ((uint16_t)0x0800)            /*!< Suspend mode request */
#define  USB_INTSTS_WKUPF                       ((uint16_t)0x1000)            /*!< Wake up */
#define  USB_INTSTS_ERRF                        ((uint16_t)0x2000)            /*!< Error */
#define  USB_INTSTS_PMOVERF                     ((uint16_t)0x4000)            /*!< Packet Memory Area Over / Underrun */
#define  USB_INTSTS_CTFRF                       ((uint16_t)0x8000)            /*!< Correct Transfer */

/*******************  Bit definition for USB_FRNUM register  ********************/
#define  USB_FRNUM_FRNUM                        ((uint16_t)0x07FF)            /*!< Frame Number */
#define  USB_FRNUM_LSOF                         ((uint16_t)0x1800)            /*!< Lost SOF */
#define  USB_FRNUM_LCK                          ((uint16_t)0x2000)            /*!< Locked */
#define  USB_FRNUM_DMSTS                        ((uint16_t)0x4000)            /*!< Receive Data - Line Status */
#define  USB_FRNUM_DPSTS                        ((uint16_t)0x8000)            /*!< Receive Data + Line Status */

/******************  Bit definition for USB_DEVADR register  *******************/
#define  USB_DEVADR_ADR                         ((uint8_t)0x7F)               /*!< ADD[6:0] bits (Device Address) */
#define  USB_DEVADR_ADR_B0                      ((uint8_t)0x01)               /*!< Bit 0 */
#define  USB_DEVADR_ADR_B1                      ((uint8_t)0x02)               /*!< Bit 1 */
#define  USB_DEVADR_ADR_B2                      ((uint8_t)0x04)               /*!< Bit 2 */
#define  USB_DEVADR_ADR_B3                      ((uint8_t)0x08)               /*!< Bit 3 */
#define  USB_DEVADR_ADR_B4                      ((uint8_t)0x10)               /*!< Bit 4 */
#define  USB_DEVADR_ADR_B5                      ((uint8_t)0x20)               /*!< Bit 5 */
#define  USB_DEVADR_ADR_B6                      ((uint8_t)0x40)               /*!< Bit 6 */

#define  USB_DEVADR_EN                          ((uint8_t)0x80)               /*!< Enable Function */

/******************  Bit definition for USB_BUFTBL register  ******************/
#define  USB_BUFTBL_ADR                         ((uint16_t)0xFFF8)            /*!< Buffer Table */

/** Buffer descriptor table */
/*****************  Bit definition for USB_ADR0_TX register  *****************/
#define  USB_ADR0_TX_ADR0_TX                    ((uint16_t)0xFFFE)            /*!< Transmission Buffer Address 0 */

/*****************  Bit definition for USB_ADR1_TX register  *****************/
#define  USB_ADR1_TX_ADR1_TX                    ((uint16_t)0xFFFE)            /*!< Transmission Buffer Address 1 */

/*****************  Bit definition for USB_ADR2_TX register  *****************/
#define  USB_ADR2_TX_ADR2_TX                    ((uint16_t)0xFFFE)            /*!< Transmission Buffer Address 2 */

/*****************  Bit definition for USB_ADR3_TX register  *****************/
#define  USB_ADR3_TX_ADR3_TX                    ((uint16_t)0xFFFE)            /*!< Transmission Buffer Address 3 */

/*****************  Bit definition for USB_ADR4_TX register  *****************/
#define  USB_ADR4_TX_ADR4_TX                    ((uint16_t)0xFFFE)            /*!< Transmission Buffer Address 4 */

/*****************  Bit definition for USB_ADR5_TX register  *****************/
#define  USB_ADR5_TX_ADR5_TX                    ((uint16_t)0xFFFE)            /*!< Transmission Buffer Address 5 */

/*****************  Bit definition for USB_ADR6_TX register  *****************/
#define  USB_ADR6_TX_ADR6_TX                    ((uint16_t)0xFFFE)            /*!< Transmission Buffer Address 6 */

/*****************  Bit definition for USB_ADR7_TX register  *****************/
#define  USB_ADR7_TX_ADR7_TX                    ((uint16_t)0xFFFE)            /*!< Transmission Buffer Address 7 */

/*----------------------------------------------------------------------------*/

/*****************  Bit definition for USB_CNT0_TX register  ****************/
#define  USB_CNT0_TX_CNT0_TX                    ((uint16_t)0x03FF)            /*!< Transmission Byte Count 0 */

/*****************  Bit definition for USB_CNT1_TX register  ****************/
#define  USB_CNT1_TX_CNT1_TX                    ((uint16_t)0x03FF)            /*!< Transmission Byte Count 1 */

/*****************  Bit definition for USB_CNT2_TX register  ****************/
#define  USB_CNT2_TX_CNT2_TX                    ((uint16_t)0x03FF)            /*!< Transmission Byte Count 2 */

/*****************  Bit definition for USB_CNT3_TX register  ****************/
#define  USB_CNT3_TX_CNT3_TX                    ((uint16_t)0x03FF)            /*!< Transmission Byte Count 3 */

/*****************  Bit definition for USB_CNT4_TX register  ****************/
#define  USB_CNT4_TX_CNT4_TX                    ((uint16_t)0x03FF)            /*!< Transmission Byte Count 4 */

/*****************  Bit definition for USB_CNT5_TX register  ****************/
#define  USB_CNT5_TX_CNT5_TX                    ((uint16_t)0x03FF)            /*!< Transmission Byte Count 5 */

/*****************  Bit definition for USB_CNT6_TX register  ****************/
#define  USB_CNT6_TX_CNT6_TX                    ((uint16_t)0x03FF)            /*!< Transmission Byte Count 6 */

/*****************  Bit definition for USB_CNT7_TX register  ****************/
#define  USB_CNT7_TX_CNT7_TX                    ((uint16_t)0x03FF)            /*!< Transmission Byte Count 7 */

