RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/*----------------------------------------------------------------------------*/

/****************  Bit definition for USB_CNT0_TX_0 register  ***************/
#define  USB_CNT0_TX_0_CNT0_TX_0                ((uint32_t)0x000003FF)        /*!< Transmission Byte Count 0 (low) */

/****************  Bit definition for USB_CNT0_TX_1 register  ***************/
#define  USB_CNT0_TX_1_CNT0_TX_1                ((uint32_t)0x03FF0000)        /*!< Transmission Byte Count 0 (high) */

/****************  Bit definition for USB_CNT1_TX_0 register  ***************/
#define  USB_CNT1_TX_0_CNT1_TX_0                ((uint32_t)0x000003FF)        /*!< Transmission Byte Count 1 (low) */

/****************  Bit definition for USB_CNT1_TX_1 register  ***************/
#define  USB_CNT1_TX_1_CNT1_TX_1                ((uint32_t)0x03FF0000)        /*!< Transmission Byte Count 1 (high) */

/****************  Bit definition for USB_CNT2_TX_0 register  ***************/
#define  USB_CNT2_TX_0_CNT2_TX_0                ((uint32_t)0x000003FF)        /*!< Transmission Byte Count 2 (low) */

/****************  Bit definition for USB_CNT2_TX_1 register  ***************/
#define  USB_CNT2_TX_1_CNT2_TX_1                ((uint32_t)0x03FF0000)        /*!< Transmission Byte Count 2 (high) */

/****************  Bit definition for USB_CNT3_TX_0 register  ***************/
#define  USB_CNT3_TX_0_CNT3_TX_0                ((uint32_t)0x000003FF)        /*!< Transmission Byte Count 3 (low) */

/****************  Bit definition for USB_CNT3_TX_1 register  ***************/
#define  USB_CNT3_TX_1_CNT3_TX_1                ((uint32_t)0x03FF0000)        /*!< Transmission Byte Count 3 (high) */

/****************  Bit definition for USB_CNT4_TX_0 register  ***************/
#define  USB_CNT4_TX_0_CNT4_TX_0                ((uint32_t)0x000003FF)        /*!< Transmission Byte Count 4 (low) */

/****************  Bit definition for USB_CNT4_TX_1 register  ***************/
#define  USB_CNT4_TX_1_CNT4_TX_1                ((uint32_t)0x03FF0000)        /*!< Transmission Byte Count 4 (high) */

/****************  Bit definition for USB_CNT5_TX_0 register  ***************/
#define  USB_CNT5_TX_0_CNT5_TX_0                ((uint32_t)0x000003FF)        /*!< Transmission Byte Count 5 (low) */

/****************  Bit definition for USB_CNT5_TX_1 register  ***************/
#define  USB_CNT5_TX_1_CNT5_TX_1                ((uint32_t)0x03FF0000)        /*!< Transmission Byte Count 5 (high) */

/****************  Bit definition for USB_CNT6_TX_0 register  ***************/
#define  USB_CNT6_TX_0_CNT6_TX_0                ((uint32_t)0x000003FF)        /*!< Transmission Byte Count 6 (low) */

/****************  Bit definition for USB_CNT6_TX_1 register  ***************/
#define  USB_CNT6_TX_1_CNT6_TX_1                ((uint32_t)0x03FF0000)        /*!< Transmission Byte Count 6 (high) */

/****************  Bit definition for USB_CNT7_TX_0 register  ***************/
#define  USB_CNT7_TX_0_CNT7_TX_0                ((uint32_t)0x000003FF)        /*!< Transmission Byte Count 7 (low) */

/****************  Bit definition for USB_CNT7_TX_1 register  ***************/
#define  USB_CNT7_TX_1_CNT7_TX_1                ((uint32_t)0x03FF0000)        /*!< Transmission Byte Count 7 (high) */

/*----------------------------------------------------------------------------*/

/*****************  Bit definition for USB_ADR0_RX register  *****************/
#define  USB_ADR0_RX_ADR0_RX                    ((uint16_t)0xFFFE)            /*!< Reception Buffer Address 0 */

/*****************  Bit definition for USB_ADR1_RX register  *****************/
#define  USB_ADR1_RX_ADR1_RX                    ((uint16_t)0xFFFE)            /*!< Reception Buffer Address 1 */

/*****************  Bit definition for USB_ADR2_RX register  *****************/
#define  USB_ADR2_RX_ADR2_RX                    ((uint16_t)0xFFFE)            /*!< Reception Buffer Address 2 */

/*****************  Bit definition for USB_ADR3_RX register  *****************/
#define  USB_ADR3_RX_ADR3_RX                    ((uint16_t)0xFFFE)            /*!< Reception Buffer Address 3 */

/*****************  Bit definition for USB_ADR4_RX register  *****************/
#define  USB_ADR4_RX_ADR4_RX                    ((uint16_t)0xFFFE)            /*!< Reception Buffer Address 4 */

/*****************  Bit definition for USB_ADR5_RX register  *****************/
#define  USB_ADR5_RX_ADR5_RX                    ((uint16_t)0xFFFE)            /*!< Reception Buffer Address 5 */

/*****************  Bit definition for USB_ADR6_RX register  *****************/
#define  USB_ADR6_RX_ADR6_RX                    ((uint16_t)0xFFFE)            /*!< Reception Buffer Address 6 */

/*****************  Bit definition for USB_ADR7_RX register  *****************/
#define  USB_ADR7_RX_ADR7_RX                    ((uint16_t)0xFFFE)            /*!< Reception Buffer Address 7 */

/*----------------------------------------------------------------------------*/

/*****************  Bit definition for USB_CNT0_RX register  ****************/
#define  USB_CNT0_RX_CNT0_RX                    ((uint16_t)0x03FF)            /*!< Reception Byte Count */

#define  USB_CNT0_RX_NUM_BLK                    ((uint16_t)0x7C00)            /*!< NUM_BLOCK[4:0] bits (Number of blocks) */
#define  USB_CNT0_RX_NUM_BLK_0                  ((uint16_t)0x0400)            /*!< Bit 0 */
#define  USB_CNT0_RX_NUM_BLK_1                  ((uint16_t)0x0800)            /*!< Bit 1 */
#define  USB_CNT0_RX_NUM_BLK_2                  ((uint16_t)0x1000)            /*!< Bit 2 */
#define  USB_CNT0_RX_NUM_BLK_3                  ((uint16_t)0x2000)            /*!< Bit 3 */
#define  USB_CNT0_RX_NUM_BLK_4                  ((uint16_t)0x4000)            /*!< Bit 4 */

#define  USB_CNT0_RX_BLKSIZE                    ((uint16_t)0x8000)            /*!< BLock SIZE */

/*****************  Bit definition for USB_CNT1_RX register  ****************/
#define  USB_CNT1_RX_CNT1_RX                    ((uint16_t)0x03FF)            /*!< Reception Byte Count */

#define  USB_CNT1_RX_NUM_BLK                    ((uint16_t)0x7C00)            /*!< NUM_BLOCK[4:0] bits (Number of blocks) */
#define  USB_CNT1_RX_NUM_BLK_0                  ((uint16_t)0x0400)            /*!< Bit 0 */
#define  USB_CNT1_RX_NUM_BLK_1                  ((uint16_t)0x0800)            /*!< Bit 1 */
#define  USB_CNT1_RX_NUM_BLK_2                  ((uint16_t)0x1000)            /*!< Bit 2 */
#define  USB_CNT1_RX_NUM_BLK_3                  ((uint16_t)0x2000)            /*!< Bit 3 */
#define  USB_CNT1_RX_NUM_BLK_4                  ((uint16_t)0x4000)            /*!< Bit 4 */

#define  USB_CNT1_RX_BLKSIZE                    ((uint16_t)0x8000)            /*!< BLock SIZE */

/*****************  Bit definition for USB_CNT2_RX register  ****************/
#define  USB_CNT2_RX_CNT2_RX                    ((uint16_t)0x03FF)            /*!< Reception Byte Count */

#define  USB_CNT2_RX_NUM_BLK                    ((uint16_t)0x7C00)            /*!< NUM_BLOCK[4:0] bits (Number of blocks) */
#define  USB_CNT2_RX_NUM_BLK_0                  ((uint16_t)0x0400)            /*!< Bit 0 */
#define  USB_CNT2_RX_NUM_BLK_1                  ((uint16_t)0x0800)            /*!< Bit 1 */
#define  USB_CNT2_RX_NUM_BLK_2                  ((uint16_t)0x1000)            /*!< Bit 2 */
#define  USB_CNT2_RX_NUM_BLK_3                  ((uint16_t)0x2000)            /*!< Bit 3 */
#define  USB_CNT2_RX_NUM_BLK_4                  ((uint16_t)0x4000)            /*!< Bit 4 */

