RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#define  USB_CNT2_RX_BLKSIZE                    ((uint16_t)0x8000)            /*!< BLock SIZE */

/*****************  Bit definition for USB_CNT3_RX register  ****************/
#define  USB_CNT3_RX_CNT0_RX                    ((uint16_t)0x03FF)            /*!< Reception Byte Count */

#define  USB_CNT3_RX_NUM_BLK                    ((uint16_t)0x7C00)            /*!< NUM_BLOCK[4:0] bits (Number of blocks) */
#define  USB_CNT3_RX_NUM_BLK_0                  ((uint16_t)0x0400)            /*!< Bit 0 */
#define  USB_CNT3_RX_NUM_BLK_1                  ((uint16_t)0x0800)            /*!< Bit 1 */
#define  USB_CNT3_RX_NUM_BLK_2                  ((uint16_t)0x1000)            /*!< Bit 2 */
#define  USB_CNT3_RX_NUM_BLK_3                  ((uint16_t)0x2000)            /*!< Bit 3 */
#define  USB_CNT3_RX_NUM_BLK_4                  ((uint16_t)0x4000)            /*!< Bit 4 */

#define  USB_CNT3_RX_BLKSIZE                    ((uint16_t)0x8000)            /*!< BLock SIZE */

/*****************  Bit definition for USB_CNT4_RX register  ****************/
#define  USB_CNT4_RX_CNT0_RX                    ((uint16_t)0x03FF)            /*!< Reception Byte Count */

#define  USB_CNT4_RX_NUM_BLK                    ((uint16_t)0x7C00)            /*!< NUM_BLOCK[4:0] bits (Number of blocks) */
#define  USB_CNT4_RX_NUM_BLK_0                  ((uint16_t)0x0400)            /*!< Bit 0 */
#define  USB_CNT4_RX_NUM_BLK_1                  ((uint16_t)0x0800)            /*!< Bit 1 */
#define  USB_CNT4_RX_NUM_BLK_2                  ((uint16_t)0x1000)            /*!< Bit 2 */
#define  USB_CNT4_RX_NUM_BLK_3                  ((uint16_t)0x2000)            /*!< Bit 3 */
#define  USB_CNT4_RX_NUM_BLK_4                  ((uint16_t)0x4000)            /*!< Bit 4 */

#define  USB_CNT4_RX_BLKSIZE                    ((uint16_t)0x8000)            /*!< BLock SIZE */

/*****************  Bit definition for USB_CNT5_RX register  ****************/
#define  USB_CNT5_RX_CNT0_RX                    ((uint16_t)0x03FF)            /*!< Reception Byte Count */

#define  USB_CNT5_RX_NUM_BLK                    ((uint16_t)0x7C00)            /*!< NUM_BLOCK[4:0] bits (Number of blocks) */
#define  USB_CNT5_RX_NUM_BLK_0                  ((uint16_t)0x0400)            /*!< Bit 0 */
#define  USB_CNT5_RX_NUM_BLK_1                  ((uint16_t)0x0800)            /*!< Bit 1 */
#define  USB_CNT5_RX_NUM_BLK_2                  ((uint16_t)0x1000)            /*!< Bit 2 */
#define  USB_CNT5_RX_NUM_BLK_3                  ((uint16_t)0x2000)            /*!< Bit 3 */
#define  USB_CNT5_RX_NUM_BLK_4                  ((uint16_t)0x4000)            /*!< Bit 4 */

#define  USB_CNT5_RX_BLKSIZE                    ((uint16_t)0x8000)            /*!< BLock SIZE */

/*****************  Bit definition for USB_CNT6_RX register  ****************/
#define  USB_CNT6_RX_CNT0_RX                    ((uint16_t)0x03FF)            /*!< Reception Byte Count */

#define  USB_CNT6_RX_NUM_BLK                    ((uint16_t)0x7C00)            /*!< NUM_BLOCK[4:0] bits (Number of blocks) */
#define  USB_CNT6_RX_NUM_BLK_0                  ((uint16_t)0x0400)            /*!< Bit 0 */
#define  USB_CNT6_RX_NUM_BLK_1                  ((uint16_t)0x0800)            /*!< Bit 1 */
#define  USB_CNT6_RX_NUM_BLK_2                  ((uint16_t)0x1000)            /*!< Bit 2 */
#define  USB_CNT6_RX_NUM_BLK_3                  ((uint16_t)0x2000)            /*!< Bit 3 */
#define  USB_CNT6_RX_NUM_BLK_4                  ((uint16_t)0x4000)            /*!< Bit 4 */

#define  USB_CNT6_RX_BLKSIZE                    ((uint16_t)0x8000)            /*!< BLock SIZE */

/*****************  Bit definition for USB_CNT7_RX register  ****************/
#define  USB_CNT7_RX_CNT0_RX                    ((uint16_t)0x03FF)            /*!< Reception Byte Count */

#define  USB_CNT7_RX_NUM_BLK                    ((uint16_t)0x7C00)            /*!< NUM_BLOCK[4:0] bits (Number of blocks) */
#define  USB_CNT7_RX_NUM_BLK_0                  ((uint16_t)0x0400)            /*!< Bit 0 */
#define  USB_CNT7_RX_NUM_BLK_1                  ((uint16_t)0x0800)            /*!< Bit 1 */
#define  USB_CNT7_RX_NUM_BLK_2                  ((uint16_t)0x1000)            /*!< Bit 2 */
#define  USB_CNT7_RX_NUM_BLK_3                  ((uint16_t)0x2000)            /*!< Bit 3 */
#define  USB_CNT7_RX_NUM_BLK_4                  ((uint16_t)0x4000)            /*!< Bit 4 */

#define  USB_CNT7_RX_BLKSIZE                    ((uint16_t)0x8000)            /*!< BLock SIZE */

/*----------------------------------------------------------------------------*/

/****************  Bit definition for USB_CNT0_RX_0 register  ***************/
#define  USB_CNT0_RX_0_CNT0_RX_0                ((uint32_t)0x000003FF)        /*!< Reception Byte Count (low) */

#define  USB_CNT0_RX_0_NUM_BLK_0                ((uint32_t)0x00007C00)        /*!< NUM_BLOCK_0[4:0] bits (Number of blocks) (low) */
#define  USB_CNT0_RX_0_NUM_BLK_0_0              ((uint32_t)0x00000400)        /*!< Bit 0 */
#define  USB_CNT0_RX_0_NUM_BLK_0_1              ((uint32_t)0x00000800)        /*!< Bit 1 */
#define  USB_CNT0_RX_0_NUM_BLK_0_2              ((uint32_t)0x00001000)        /*!< Bit 2 */
#define  USB_CNT0_RX_0_NUM_BLK_0_3              ((uint32_t)0x00002000)        /*!< Bit 3 */
#define  USB_CNT0_RX_0_NUM_BLK_0_4              ((uint32_t)0x00004000)        /*!< Bit 4 */

#define  USB_CNT0_RX_0_BLKSIZE_0                ((uint32_t)0x00008000)        /*!< BLock SIZE (low) */

/****************  Bit definition for USB_CNT0_RX_1 register  ***************/
#define  USB_CNT0_RX_1_CNT0_RX_1                ((uint32_t)0x03FF0000)        /*!< Reception Byte Count (high) */

#define  USB_CNT0_RX_1_NUM_BLK_1                ((uint32_t)0x7C000000)        /*!< NUM_BLOCK_1[4:0] bits (Number of blocks) (high) */
#define  USB_CNT0_RX_1_NUM_BLK_1_0              ((uint32_t)0x04000000)        /*!< Bit 1 */
#define  USB_CNT0_RX_1_NUM_BLK_1_1              ((uint32_t)0x08000000)        /*!< Bit 1 */
#define  USB_CNT0_RX_1_NUM_BLK_1_2              ((uint32_t)0x10000000)        /*!< Bit 2 */
#define  USB_CNT0_RX_1_NUM_BLK_1_3              ((uint32_t)0x20000000)        /*!< Bit 3 */
#define  USB_CNT0_RX_1_NUM_BLK_1_4              ((uint32_t)0x40000000)        /*!< Bit 4 */

#define  USB_CNT0_RX_1_BLKSIZE_1                ((uint32_t)0x80000000)        /*!< BLock SIZE (high) */

/****************  Bit definition for USB_CNT1_RX_0 register  ***************/
#define  USB_CNT1_RX_0_CNT1_RX_0                ((uint32_t)0x000003FF)        /*!< Reception Byte Count (low) */

#define  USB_CNT1_RX_0_NUM_BLK_0                ((uint32_t)0x00007C00)        /*!< NUM_BLOCK_0[4:0] bits (Number of blocks) (low) */
#define  USB_CNT1_RX_0_NUM_BLK_0_0              ((uint32_t)0x00000400)        /*!< Bit 0 */
#define  USB_CNT1_RX_0_NUM_BLK_0_1              ((uint32_t)0x00000800)        /*!< Bit 1 */
#define  USB_CNT1_RX_0_NUM_BLK_0_2              ((uint32_t)0x00001000)        /*!< Bit 2 */
#define  USB_CNT1_RX_0_NUM_BLK_0_3              ((uint32_t)0x00002000)        /*!< Bit 3 */
#define  USB_CNT1_RX_0_NUM_BLK_0_4              ((uint32_t)0x00004000)        /*!< Bit 4 */

#define  USB_CNT1_RX_0_BLKSIZE_0                ((uint32_t)0x00008000)        /*!< BLock SIZE (low) */

