RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#define  USB_CNT5_RX_0_BLKSIZE_0                ((uint32_t)0x00008000)        /*!< BLock SIZE (low) */

/****************  Bit definition for USB_CNT5_RX_1 register  ***************/
#define  USB_CNT5_RX_1_CNT5_RX_1                ((uint32_t)0x03FF0000)        /*!< Reception Byte Count (high) */

#define  USB_CNT5_RX_1_NUM_BLK_1                ((uint32_t)0x7C000000)        /*!< NUM_BLOCK_1[4:0] bits (Number of blocks) (high) */
#define  USB_CNT5_RX_1_NUM_BLK_1_0              ((uint32_t)0x04000000)        /*!< Bit 0 */
#define  USB_CNT5_RX_1_NUM_BLK_1_1              ((uint32_t)0x08000000)        /*!< Bit 1 */
#define  USB_CNT5_RX_1_NUM_BLK_1_2              ((uint32_t)0x10000000)        /*!< Bit 2 */
#define  USB_CNT5_RX_1_NUM_BLK_1_3              ((uint32_t)0x20000000)        /*!< Bit 3 */
#define  USB_CNT5_RX_1_NUM_BLK_1_4              ((uint32_t)0x40000000)        /*!< Bit 4 */

#define  USB_CNT5_RX_1_BLKSIZE_1                ((uint32_t)0x80000000)        /*!< BLock SIZE (high) */

/***************  Bit definition for USB_CNT6_RX_0  register  ***************/
#define  USB_CNT6_RX_0_CNT6_RX_0                ((uint32_t)0x000003FF)        /*!< Reception Byte Count (low) */

#define  USB_CNT6_RX_0_NUM_BLK_0                ((uint32_t)0x00007C00)        /*!< NUM_BLOCK_0[4:0] bits (Number of blocks) (low) */
#define  USB_CNT6_RX_0_NUM_BLK_0_0              ((uint32_t)0x00000400)        /*!< Bit 0 */
#define  USB_CNT6_RX_0_NUM_BLK_0_1              ((uint32_t)0x00000800)        /*!< Bit 1 */
#define  USB_CNT6_RX_0_NUM_BLK_0_2              ((uint32_t)0x00001000)        /*!< Bit 2 */
#define  USB_CNT6_RX_0_NUM_BLK_0_3              ((uint32_t)0x00002000)        /*!< Bit 3 */
#define  USB_CNT6_RX_0_NUM_BLK_0_4              ((uint32_t)0x00004000)        /*!< Bit 4 */

#define  USB_CNT6_RX_0_BLKSIZE_0                ((uint32_t)0x00008000)        /*!< BLock SIZE (low) */

/****************  Bit definition for USB_CNT6_RX_1 register  ***************/
#define  USB_CNT6_RX_1_CNT6_RX_1                ((uint32_t)0x03FF0000)        /*!< Reception Byte Count (high) */

#define  USB_CNT6_RX_1_NUM_BLK_1                ((uint32_t)0x7C000000)        /*!< NUM_BLOCK_1[4:0] bits (Number of blocks) (high) */
#define  USB_CNT6_RX_1_NUM_BLK_1_0              ((uint32_t)0x04000000)        /*!< Bit 0 */
#define  USB_CNT6_RX_1_NUM_BLK_1_1              ((uint32_t)0x08000000)        /*!< Bit 1 */
#define  USB_CNT6_RX_1_NUM_BLK_1_2              ((uint32_t)0x10000000)        /*!< Bit 2 */
#define  USB_CNT6_RX_1_NUM_BLK_1_3              ((uint32_t)0x20000000)        /*!< Bit 3 */
#define  USB_CNT6_RX_1_NUM_BLK_1_4              ((uint32_t)0x40000000)        /*!< Bit 4 */

#define  USB_CNT6_RX_1_BLKSIZE_1                ((uint32_t)0x80000000)        /*!< BLock SIZE (high) */

/***************  Bit definition for USB_CNT7_RX_0 register  ****************/
#define  USB_CNT7_RX_0_CNT7_RX_0                ((uint32_t)0x000003FF)        /*!< Reception Byte Count (low) */

#define  USB_CNT7_RX_0_NUM_BLK_0                ((uint32_t)0x00007C00)        /*!< NUM_BLOCK_0[4:0] bits (Number of blocks) (low) */
#define  USB_CNT7_RX_0_NUM_BLK_0_0              ((uint32_t)0x00000400)        /*!< Bit 0 */
#define  USB_CNT7_RX_0_NUM_BLK_0_1              ((uint32_t)0x00000800)        /*!< Bit 1 */
#define  USB_CNT7_RX_0_NUM_BLK_0_2              ((uint32_t)0x00001000)        /*!< Bit 2 */
#define  USB_CNT7_RX_0_NUM_BLK_0_3              ((uint32_t)0x00002000)        /*!< Bit 3 */
#define  USB_CNT7_RX_0_NUM_BLK_0_4              ((uint32_t)0x00004000)        /*!< Bit 4 */

#define  USB_CNT7_RX_0_BLKSIZE_0                ((uint32_t)0x00008000)        /*!< BLock SIZE (low) */

/***************  Bit definition for USB_CNT7_RX_1 register  ****************/
#define  USB_CNT7_RX_1_CNT7_RX_1                ((uint32_t)0x03FF0000)        /*!< Reception Byte Count (high) */

#define  USB_CNT7_RX_1_NUM_BLK_1                ((uint32_t)0x7C000000)        /*!< NUM_BLOCK_1[4:0] bits (Number of blocks) (high) */
#define  USB_CNT7_RX_1_NUM_BLK_1_0              ((uint32_t)0x04000000)        /*!< Bit 0 */
#define  USB_CNT7_RX_1_NUM_BLK_1_1              ((uint32_t)0x08000000)        /*!< Bit 1 */
#define  USB_CNT7_RX_1_NUM_BLK_1_2              ((uint32_t)0x10000000)        /*!< Bit 2 */
#define  USB_CNT7_RX_1_NUM_BLK_1_3              ((uint32_t)0x20000000)        /*!< Bit 3 */
#define  USB_CNT7_RX_1_NUM_BLK_1_4              ((uint32_t)0x40000000)        /*!< Bit 4 */

#define  USB_CNT7_RX_1_BLKSIZE_1                ((uint32_t)0x80000000)        /*!< BLock SIZE (high) */

/******************************************************************************/
/*                                                                            */
/*                         Controller Area Network                            */
/*                                                                            */
/******************************************************************************/

/** CAN control and status registers */
/*******************  Bit definition for CAN_MCTRL register  ********************/
#define  CAN_MCTRL_INRQ                         ((uint16_t)0x0001)            /*!< Initialization Request */
#define  CAN_MCTRL_SLP                          ((uint16_t)0x0002)            /*!< Sleep Mode Request */
#define  CAN_MCTRL_TFP                          ((uint16_t)0x0004)            /*!< Transmit FIFO Priority */
#define  CAN_MCTRL_RFL                          ((uint16_t)0x0008)            /*!< Receive FIFO Locked Mode */
#define  CAN_MCTRL_NART                         ((uint16_t)0x0010)            /*!< No Automatic Retransmission */
#define  CAN_MCTRL_AWU                          ((uint16_t)0x0020)            /*!< Automatic Wakeup Mode */
#define  CAN_MCTRL_ABO                          ((uint16_t)0x0040)            /*!< Automatic Bus-Off Management */
#define  CAN_MCTRL_TTC                          ((uint16_t)0x0080)            /*!< Time Triggered Communication Mode */
#define  CAN_MCTRL_RST                          ((uint16_t)0x8000)            /*!< CAN software master reset */

