RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/*******************  Bit definition for CAN_MSTS register  ********************/
#define  CAN_MSTS_IAK                           ((uint16_t)0x0001)            /*!< Initialization Acknowledge */
#define  CAN_MSTS_SAK                           ((uint16_t)0x0002)            /*!< Sleep Acknowledge */
#define  CAN_MSTS_ERIT                          ((uint16_t)0x0004)            /*!< Error Interrupt */
#define  CAN_MSTS_WKIT                          ((uint16_t)0x0008)            /*!< Wakeup Interrupt */
#define  CAN_MSTS_SAKIT                         ((uint16_t)0x0010)            /*!< Sleep Acknowledge Interrupt */
#define  CAN_MSTS_TX                            ((uint16_t)0x0100)            /*!< Transmit Mode */
#define  CAN_MSTS_RX                            ((uint16_t)0x0200)            /*!< Receive Mode */
#define  CAN_MSTS_LSAP                          ((uint16_t)0x0400)            /*!< Last Sample Point */
#define  CAN_MSTS_RXS                           ((uint16_t)0x0800)            /*!< CAN Rx Signal */

/*******************  Bit definition for CAN_TSTS register  ********************/
#define  CAN_TSTS_RQC0                          ((uint32_t)0x00000001)        /*!< Request Completed Mailbox0 */
#define  CAN_TSTS_TOK0                          ((uint32_t)0x00000002)        /*!< Transmission OK of Mailbox0 */
#define  CAN_TSTS_ALS0                          ((uint32_t)0x00000004)        /*!< Arbitration Lost for Mailbox0 */
#define  CAN_TSTS_TER0                          ((uint32_t)0x00000008)        /*!< Transmission Error of Mailbox0 */
#define  CAN_TSTS_ARQ0                          ((uint32_t)0x00000080)        /*!< Abort Request for Mailbox0 */
#define  CAN_TSTS_RQC1                          ((uint32_t)0x00000100)        /*!< Request Completed Mailbox1 */
#define  CAN_TSTS_TOK1                          ((uint32_t)0x00000200)        /*!< Transmission OK of Mailbox1 */
#define  CAN_TSTS_ALS1                          ((uint32_t)0x00000400)        /*!< Arbitration Lost for Mailbox1 */
#define  CAN_TSTS_TER1                          ((uint32_t)0x00000800)        /*!< Transmission Error of Mailbox1 */
#define  CAN_TSTS_ARQ1                          ((uint32_t)0x00008000)        /*!< Abort Request for Mailbox 1 */
#define  CAN_TSTS_RQC2                          ((uint32_t)0x00010000)        /*!< Request Completed Mailbox2 */
#define  CAN_TSTS_TOK2                          ((uint32_t)0x00020000)        /*!< Transmission OK of Mailbox 2 */
#define  CAN_TSTS_ALS2                          ((uint32_t)0x00040000)        /*!< Arbitration Lost for mailbox 2 */
#define  CAN_TSTS_TER2                          ((uint32_t)0x00080000)        /*!< Transmission Error of Mailbox 2 */
#define  CAN_TSTS_ARQ2                          ((uint32_t)0x00800000)        /*!< Abort Request for Mailbox 2 */
#define  CAN_TSTS_NTM                           ((uint32_t)0x03000000)        /*!< Mailbox Code */

#define  CAN_TSTS_TSME                          ((uint32_t)0x1C000000)        /*!< TME[2:0] bits */
#define  CAN_TSTS_TSME0                         ((uint32_t)0x04000000)        /*!< Transmit Mailbox 0 Empty */
#define  CAN_TSTS_TSME1                         ((uint32_t)0x08000000)        /*!< Transmit Mailbox 1 Empty */
#define  CAN_TSTS_TSME2                         ((uint32_t)0x10000000)        /*!< Transmit Mailbox 2 Empty */

#define  CAN_TSTS_LPM                           ((uint32_t)0xE0000000)        /*!< LOW[2:0] bits */
#define  CAN_TSTS_LPM0                          ((uint32_t)0x20000000)        /*!< Lowest Priority Flag for Mailbox 0 */
#define  CAN_TSTS_LPM1                          ((uint32_t)0x40000000)        /*!< Lowest Priority Flag for Mailbox 1 */
#define  CAN_TSTS_LPM2                          ((uint32_t)0x80000000)        /*!< Lowest Priority Flag for Mailbox 2 */

/*******************  Bit definition for CAN_RF0 register  *******************/
#define  CAN_RF0_RFP0                           ((uint8_t)0x03)               /*!< FIFO 0 Message Pending */
#define  CAN_RF0_RFFU0                          ((uint8_t)0x08)               /*!< FIFO 0 Full */
#define  CAN_RF0_RFOV0                          ((uint8_t)0x10)               /*!< FIFO 0 Overrun */
#define  CAN_RF0_RRFM0                          ((uint8_t)0x20)               /*!< Release FIFO 0 Output Mailbox */

/*******************  Bit definition for CAN_RF1 register  *******************/
#define  CAN_RF1_RFP1                           ((uint8_t)0x03)               /*!< FIFO 1 Message Pending */
#define  CAN_RF1_RFFU1                          ((uint8_t)0x08)               /*!< FIFO 1 Full */
#define  CAN_RF1_RFOV1                          ((uint8_t)0x10)               /*!< FIFO 1 Overrun */
#define  CAN_RF1_RRFM1                          ((uint8_t)0x20)               /*!< Release FIFO 1 Output Mailbox */

/********************  Bit definition for CAN_INTEN register  *******************/
#define  CAN_INTEN_TSMEIE                       ((uint32_t)0x00000001)        /*!< Transmit Mailbox Empty Interrupt Enable */
#define  CAN_INTEN_RFPIE0                       ((uint32_t)0x00000002)        /*!< FIFO Message Pending Interrupt Enable */
#define  CAN_INTEN_RFFUIE0                      ((uint32_t)0x00000004)        /*!< FIFO Full Interrupt Enable */
#define  CAN_INTEN_RFOVIE0                      ((uint32_t)0x00000008)        /*!< FIFO Overrun Interrupt Enable */
#define  CAN_INTEN_RFPIE1                       ((uint32_t)0x00000010)        /*!< FIFO Message Pending Interrupt Enable */
#define  CAN_INTEN_RFFUIE1                      ((uint32_t)0x00000020)        /*!< FIFO Full Interrupt Enable */
#define  CAN_INTEN_RFOVIE1                      ((uint32_t)0x00000040)        /*!< FIFO Overrun Interrupt Enable */
#define  CAN_INTEN_ERWIE                        ((uint32_t)0x00000100)        /*!< Error Warning Interrupt Enable */
#define  CAN_INTEN_ERPIE                        ((uint32_t)0x00000200)        /*!< Error Passive Interrupt Enable */
#define  CAN_INTEN_BUIE                         ((uint32_t)0x00000400)        /*!< Bus-Off Interrupt Enable */
#define  CAN_INTEN_ERCIE                        ((uint32_t)0x00000800)        /*!< Last Error Code Interrupt Enable */
#define  CAN_INTEN_ERIE                         ((uint32_t)0x00008000)        /*!< Error Interrupt Enable */
#define  CAN_INTEN_WKIE                         ((uint32_t)0x00010000)        /*!< Wakeup Interrupt Enable */
#define  CAN_INTEN_SAKIE                        ((uint32_t)0x00020000)        /*!< Sleep Interrupt Enable */

/********************  Bit definition for CAN_ESTS register  *******************/
#define  CAN_ESTS_ERWF                          ((uint32_t)0x00000001)        /*!< Error Warning Flag */
#define  CAN_ESTS_ERPF                          ((uint32_t)0x00000002)        /*!< Error Passive Flag */
#define  CAN_ESTS_BFF                           ((uint32_t)0x00000004)        /*!< Bus-Off Flag */

#define  CAN_ESTS_ERC                           ((uint32_t)0x00000070)        /*!< LEC[2:0] bits (Last Error Code) */
#define  CAN_ESTS_ERC_0                         ((uint32_t)0x00000010)        /*!< Bit 0 */
#define  CAN_ESTS_ERC_1                         ((uint32_t)0x00000020)        /*!< Bit 1 */
#define  CAN_ESTS_ERC_2                         ((uint32_t)0x00000040)        /*!< Bit 2 */

#define  CAN_ESTS_TEC                           ((uint32_t)0x00FF0000)        /*!< Least significant byte of the 9-bit Transmit Error Counter */
#define  CAN_ESTS_REC                           ((uint32_t)0xFF000000)        /*!< Receive Error Counter */

/*******************  Bit definition for CAN_BTMG register  ********************/
#define  CAN_BTMG_BRP                           ((uint32_t)0x000003FF)        /*!< Baud Rate Prescaler */
#define  CAN_BTMG_BS1                           ((uint32_t)0x000F0000)        /*!< Time Segment 1 */
#define  CAN_BTMG_BS2                           ((uint32_t)0x00700000)        /*!< Time Segment 2 */
#define  CAN_BTMG_SJW                           ((uint32_t)0x03000000)        /*!< Resynchronization Jump Width */
#define  CAN_BTMG_LBK                           ((uint32_t)0x40000000)        /*!< Loop Back Mode (Debug) */
#define  CAN_BTMG_SIL                           ((uint32_t)0x80000000)        /*!< Silent Mode */

/** Mailbox registers */
/******************  Bit definition for CAN_TI0R register  ********************/
#define  CAN_TMI0_TRQ                           ((uint32_t)0x00000001)        /*!< Transmit Mailbox Request */
#define  CAN_TMI0_RTR                           ((uint32_t)0x00000002)        /*!< Remote Transmission Request */
#define  CAN_TMI0_IDT                           ((uint32_t)0x00000004)        /*!< Identifier Extension */
#define  CAN_TMI0_EID                           ((uint32_t)0x001FFFF8)        /*!< Extended Identifier */
#define  CAN_TMI0_SID                           ((uint32_t)0xFFE00000)        /*!< Standard Identifier or Extended Identifier */

/******************  Bit definition for CAN_TDT0 register  *******************/
#define  CAN_TDT0_DLC                           ((uint32_t)0x0000000F)        /*!< Data Length Code */
#define  CAN_TDT0_TMEN                          ((uint32_t)0x00000100)        /*!< Transmit Global Time */
#define  CAN_TDT0_TS                            ((uint32_t)0xFFFF0000)        /*!< Message Time Stamp */

/******************  Bit definition for CAN_TDL0 register  *******************/
#define  CAN_TDL0_D0                            ((uint32_t)0x000000FF)        /*!< Data byte 0 */
#define  CAN_TDL0_D1                            ((uint32_t)0x0000FF00)        /*!< Data byte 1 */
#define  CAN_TDL0_D2                            ((uint32_t)0x00FF0000)        /*!< Data byte 2 */
#define  CAN_TDL0_D3                            ((uint32_t)0xFF000000)        /*!< Data byte 3 */

/******************  Bit definition for CAN_TDH0 register  *******************/
#define  CAN_TDH0_D4                            ((uint32_t)0x000000FF)        /*!< Data byte 4 */
#define  CAN_TDH0_D5                            ((uint32_t)0x0000FF00)        /*!< Data byte 5 */
#define  CAN_TDH0_D6                            ((uint32_t)0x00FF0000)        /*!< Data byte 6 */
#define  CAN_TDH0_D7                            ((uint32_t)0xFF000000)        /*!< Data byte 7 */

/*******************  Bit definition for CAN_TMI1 register  *******************/
#define  CAN_TMI1_TRQ                           ((uint32_t)0x00000001)        /*!< Transmit Mailbox Request */
#define  CAN_TMI1_RTR                           ((uint32_t)0x00000002)        /*!< Remote Transmission Request */
#define  CAN_TMI1_IDT                           ((uint32_t)0x00000004)        /*!< Identifier Extension */
#define  CAN_TMI1_EID                           ((uint32_t)0x001FFFF8)        /*!< Extended Identifier */
#define  CAN_TMI1_SID                           ((uint32_t)0xFFE00000)        /*!< Standard Identifier or Extended Identifier */

/*******************  Bit definition for CAN_TDT1 register  ******************/
#define  CAN_TDT1_DLC                           ((uint32_t)0x0000000F)        /*!< Data Length Code */
#define  CAN_TDT1_TMEN                          ((uint32_t)0x00000100)        /*!< Transmit Global Time */
#define  CAN_TDT1_TS                            ((uint32_t)0xFFFF0000)        /*!< Message Time Stamp */

/*******************  Bit definition for CAN_TDL1 register  ******************/
#define  CAN_TDL1_D0                            ((uint32_t)0x000000FF)        /*!< Data byte 0 */
#define  CAN_TDL1_D1                            ((uint32_t)0x0000FF00)        /*!< Data byte 1 */
#define  CAN_TDL1_D2                            ((uint32_t)0x00FF0000)        /*!< Data byte 2 */
#define  CAN_TDL1_D3                            ((uint32_t)0xFF000000)        /*!< Data byte 3 */

/*******************  Bit definition for CAN_TDH1 register  ******************/
#define  CAN_TDH1_D4                            ((uint32_t)0x000000FF)        /*!< Data byte 4 */
#define  CAN_TDH1_D5                            ((uint32_t)0x0000FF00)        /*!< Data byte 5 */
#define  CAN_TDH1_D6                            ((uint32_t)0x00FF0000)        /*!< Data byte 6 */
#define  CAN_TDH1_D7                            ((uint32_t)0xFF000000)        /*!< Data byte 7 */

