RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/*******************  Bit definition for CAN_TMI2 register  *******************/
#define  CAN_TMI2_TRQ                           ((uint32_t)0x00000001)        /*!< Transmit Mailbox Request */
#define  CAN_TMI2_RTR                           ((uint32_t)0x00000002)        /*!< Remote Transmission Request */
#define  CAN_TMI2_IDT                           ((uint32_t)0x00000004)        /*!< Identifier Extension */
#define  CAN_TMI2_EID                           ((uint32_t)0x001FFFF8)        /*!< Extended identifier */
#define  CAN_TMI2_SID                           ((uint32_t)0xFFE00000)        /*!< Standard Identifier or Extended Identifier */

/*******************  Bit definition for CAN_TDT2 register  ******************/
#define  CAN_TDT2_DLC                           ((uint32_t)0x0000000F)        /*!< Data Length Code */
#define  CAN_TDT2_TMEN                          ((uint32_t)0x00000100)        /*!< Transmit Global Time */
#define  CAN_TDT2_TS                            ((uint32_t)0xFFFF0000)        /*!< Message Time Stamp */

/*******************  Bit definition for CAN_TDL2 register  ******************/
#define  CAN_TDL2_D0                            ((uint32_t)0x000000FF)        /*!< Data byte 0 */
#define  CAN_TDL2_D1                            ((uint32_t)0x0000FF00)        /*!< Data byte 1 */
#define  CAN_TDL2_D2                            ((uint32_t)0x00FF0000)        /*!< Data byte 2 */
#define  CAN_TDL2_D3                            ((uint32_t)0xFF000000)        /*!< Data byte 3 */

/*******************  Bit definition for CAN_TDH2 register  ******************/
#define  CAN_TDH2_D4                            ((uint32_t)0x000000FF)        /*!< Data byte 4 */
#define  CAN_TDH2_D5                            ((uint32_t)0x0000FF00)        /*!< Data byte 5 */
#define  CAN_TDH2_D6                            ((uint32_t)0x00FF0000)        /*!< Data byte 6 */
#define  CAN_TDH2_D7                            ((uint32_t)0xFF000000)        /*!< Data byte 7 */

/*******************  Bit definition for CAN_RFI0 register  *******************/
#define  CAN_RFI0_RTR                           ((uint32_t)0x00000002)        /*!< Remote Transmission Request */
#define  CAN_RFI0_IDT                           ((uint32_t)0x00000004)        /*!< Identifier Extension */
#define  CAN_RFI0_EID                           ((uint32_t)0x001FFFF8)        /*!< Extended Identifier */
#define  CAN_RFI0_SID                           ((uint32_t)0xFFE00000)        /*!< Standard Identifier or Extended Identifier */

/*******************  Bit definition for CAN_RDT0 register  ******************/
#define  CAN_RDT0_DLC                           ((uint32_t)0x0000000F)        /*!< Data Length Code */
#define  CAN_RDT0_FID                           ((uint32_t)0x0000FF00)        /*!< Filter Match Index */
#define  CAN_RDT0_TS                            ((uint32_t)0xFFFF0000)        /*!< Message Time Stamp */

/*******************  Bit definition for CAN_RDL0 register  ******************/
#define  CAN_RDL0_D0                            ((uint32_t)0x000000FF)        /*!< Data byte 0 */
#define  CAN_RDL0_D1                            ((uint32_t)0x0000FF00)        /*!< Data byte 1 */
#define  CAN_RDL0_D2                            ((uint32_t)0x00FF0000)        /*!< Data byte 2 */
#define  CAN_RDL0_D3                            ((uint32_t)0xFF000000)        /*!< Data byte 3 */

/*******************  Bit definition for CAN_RDH0 register  ******************/
#define  CAN_RDH0_D4                            ((uint32_t)0x000000FF)        /*!< Data byte 4 */
#define  CAN_RDH0_D5                            ((uint32_t)0x0000FF00)        /*!< Data byte 5 */
#define  CAN_RDH0_D6                            ((uint32_t)0x00FF0000)        /*!< Data byte 6 */
#define  CAN_RDH0_D7                            ((uint32_t)0xFF000000)        /*!< Data byte 7 */

/*******************  Bit definition for CAN_RFI1 register  *******************/
#define  CAN_RFI1_RTR                           ((uint32_t)0x00000002)        /*!< Remote Transmission Request */
#define  CAN_RFI1_IDT                           ((uint32_t)0x00000004)        /*!< Identifier Extension */
#define  CAN_RFI1_EID                           ((uint32_t)0x001FFFF8)        /*!< Extended identifier */
#define  CAN_RFI1_SID                           ((uint32_t)0xFFE00000)        /*!< Standard Identifier or Extended Identifier */

/*******************  Bit definition for CAN_RDT1 register  ******************/
#define  CAN_RDT1_DLC                           ((uint32_t)0x0000000F)        /*!< Data Length Code */
#define  CAN_RDT1_FID                           ((uint32_t)0x0000FF00)        /*!< Filter Match Index */
#define  CAN_RDT1_TS                            ((uint32_t)0xFFFF0000)        /*!< Message Time Stamp */

/*******************  Bit definition for CAN_RDL1 register  ******************/
#define  CAN_RDL1_D0                            ((uint32_t)0x000000FF)        /*!< Data byte 0 */
#define  CAN_RDL1_D1                            ((uint32_t)0x0000FF00)        /*!< Data byte 1 */
#define  CAN_RDL1_D2                            ((uint32_t)0x00FF0000)        /*!< Data byte 2 */
#define  CAN_RDL1_D3                            ((uint32_t)0xFF000000)        /*!< Data byte 3 */

/*******************  Bit definition for CAN_RDH1 register  ******************/
#define  CAN_RDH1_D4                            ((uint32_t)0x000000FF)        /*!< Data byte 4 */
#define  CAN_RDH1_D5                            ((uint32_t)0x0000FF00)        /*!< Data byte 5 */
#define  CAN_RDH1_D6                            ((uint32_t)0x00FF0000)        /*!< Data byte 6 */
#define  CAN_RDH1_D7                            ((uint32_t)0xFF000000)        /*!< Data byte 7 */

/** CAN filter registers */
/*******************  Bit definition for CAN_FM register  ********************/
#define  CAN_FM_FINT                            ((uint8_t)0x01)               /*!< Filter Init Mode */

/*******************  Bit definition for CAN_FM1 register  *******************/
#define  CAN_FM1_FMS                            ((uint16_t)0x3FFF)            /*!< Filter Mode */
#define  CAN_FM1_FMS0                           ((uint16_t)0x0001)            /*!< Filter Init Mode bit 0 */
#define  CAN_FM1_FMS1                           ((uint16_t)0x0002)            /*!< Filter Init Mode bit 1 */
#define  CAN_FM1_FMS2                           ((uint16_t)0x0004)            /*!< Filter Init Mode bit 2 */
#define  CAN_FM1_FMS3                           ((uint16_t)0x0008)            /*!< Filter Init Mode bit 3 */
#define  CAN_FM1_FMS4                           ((uint16_t)0x0010)            /*!< Filter Init Mode bit 4 */
#define  CAN_FM1_FMS5                           ((uint16_t)0x0020)            /*!< Filter Init Mode bit 5 */
#define  CAN_FM1_FMS6                           ((uint16_t)0x0040)            /*!< Filter Init Mode bit 6 */
#define  CAN_FM1_FMS7                           ((uint16_t)0x0080)            /*!< Filter Init Mode bit 7 */
#define  CAN_FM1_FMS8                           ((uint16_t)0x0100)            /*!< Filter Init Mode bit 8 */
#define  CAN_FM1_FMS9                           ((uint16_t)0x0200)            /*!< Filter Init Mode bit 9 */
#define  CAN_FM1_FMS10                          ((uint16_t)0x0400)            /*!< Filter Init Mode bit 10 */
#define  CAN_FM1_FMS11                          ((uint16_t)0x0800)            /*!< Filter Init Mode bit 11 */
#define  CAN_FM1_FMS12                          ((uint16_t)0x1000)            /*!< Filter Init Mode bit 12 */
#define  CAN_FM1_FMS13                          ((uint16_t)0x2000)            /*!< Filter Init Mode bit 13 */

/*******************  Bit definition for CAN_FS1 register  *******************/
#define  CAN_FS1_FBS                            ((uint16_t)0x3FFF)            /*!< Filter Scale Configuration */
#define  CAN_FS1_FBS0                           ((uint16_t)0x0001)            /*!< Filter Scale Configuration bit 0 */
#define  CAN_FS1_FBS1                           ((uint16_t)0x0002)            /*!< Filter Scale Configuration bit 1 */
#define  CAN_FS1_FBS2                           ((uint16_t)0x0004)            /*!< Filter Scale Configuration bit 2 */
#define  CAN_FS1_FBS3                           ((uint16_t)0x0008)            /*!< Filter Scale Configuration bit 3 */
#define  CAN_FS1_FBS4                           ((uint16_t)0x0010)            /*!< Filter Scale Configuration bit 4 */
#define  CAN_FS1_FBS5                           ((uint16_t)0x0020)            /*!< Filter Scale Configuration bit 5 */
#define  CAN_FS1_FBS6                           ((uint16_t)0x0040)            /*!< Filter Scale Configuration bit 6 */
#define  CAN_FS1_FBS7                           ((uint16_t)0x0080)            /*!< Filter Scale Configuration bit 7 */
#define  CAN_FS1_FBS8                           ((uint16_t)0x0100)            /*!< Filter Scale Configuration bit 8 */
#define  CAN_FS1_FBS9                           ((uint16_t)0x0200)            /*!< Filter Scale Configuration bit 9 */
#define  CAN_FS1_FBS10                          ((uint16_t)0x0400)            /*!< Filter Scale Configuration bit 10 */
#define  CAN_FS1_FBS11                          ((uint16_t)0x0800)            /*!< Filter Scale Configuration bit 11 */
#define  CAN_FS1_FBS12                          ((uint16_t)0x1000)            /*!< Filter Scale Configuration bit 12 */
#define  CAN_FS1_FBS13                          ((uint16_t)0x2000)            /*!< Filter Scale Configuration bit 13 */

/******************  Bit definition for CAN_FFA1 register  *******************/
#define  CAN_FFA1_FAF                           ((uint16_t)0x3FFF)            /*!< Filter FIFO Assignment */
#define  CAN_FFA1_FAF0                          ((uint16_t)0x0001)            /*!< Filter FIFO Assignment for Filter 0 */
#define  CAN_FFA1_FAF1                          ((uint16_t)0x0002)            /*!< Filter FIFO Assignment for Filter 1 */
#define  CAN_FFA1_FAF2                          ((uint16_t)0x0004)            /*!< Filter FIFO Assignment for Filter 2 */
#define  CAN_FFA1_FAF3                          ((uint16_t)0x0008)            /*!< Filter FIFO Assignment for Filter 3 */
#define  CAN_FFA1_FAF4                          ((uint16_t)0x0010)            /*!< Filter FIFO Assignment for Filter 4 */
#define  CAN_FFA1_FAF5                          ((uint16_t)0x0020)            /*!< Filter FIFO Assignment for Filter 5 */
#define  CAN_FFA1_FAF6                          ((uint16_t)0x0040)            /*!< Filter FIFO Assignment for Filter 6 */
#define  CAN_FFA1_FAF7                          ((uint16_t)0x0080)            /*!< Filter FIFO Assignment for Filter 7 */
#define  CAN_FFA1_FAF8                          ((uint16_t)0x0100)            /*!< Filter FIFO Assignment for Filter 8 */
#define  CAN_FFA1_FAF9                          ((uint16_t)0x0200)            /*!< Filter FIFO Assignment for Filter 9 */
#define  CAN_FFA1_FAF10                         ((uint16_t)0x0400)            /*!< Filter FIFO Assignment for Filter 10 */
#define  CAN_FFA1_FAF11                         ((uint16_t)0x0800)            /*!< Filter FIFO Assignment for Filter 11 */
#define  CAN_FFA1_FAF12                         ((uint16_t)0x1000)            /*!< Filter FIFO Assignment for Filter 12 */
#define  CAN_FFA1_FAF13                         ((uint16_t)0x2000)            /*!< Filter FIFO Assignment for Filter 13 */

/*******************  Bit definition for CAN_FA1 register  *******************/
#define  CAN_FA1_FEN                            ((uint16_t)0x3FFF)            /*!< Filter Active */
#define  CAN_FA1_FEN0                           ((uint16_t)0x0001)            /*!< Filter 0 Active */
#define  CAN_FA1_FEN1                           ((uint16_t)0x0002)            /*!< Filter 1 Active */
#define  CAN_FA1_FEN2                           ((uint16_t)0x0004)            /*!< Filter 2 Active */
#define  CAN_FA1_FEN3                           ((uint16_t)0x0008)            /*!< Filter 3 Active */
#define  CAN_FA1_FEN4                           ((uint16_t)0x0010)            /*!< Filter 4 Active */
#define  CAN_FA1_FEN5                           ((uint16_t)0x0020)            /*!< Filter 5 Active */
#define  CAN_FA1_FEN6                           ((uint16_t)0x0040)            /*!< Filter 6 Active */
#define  CAN_FA1_FEN7                           ((uint16_t)0x0080)            /*!< Filter 7 Active */
#define  CAN_FA1_FEN8                           ((uint16_t)0x0100)            /*!< Filter 8 Active */
#define  CAN_FA1_FEN9                           ((uint16_t)0x0200)            /*!< Filter 9 Active */
#define  CAN_FA1_FEN10                          ((uint16_t)0x0400)            /*!< Filter 10 Active */
#define  CAN_FA1_FEN11                          ((uint16_t)0x0800)            /*!< Filter 11 Active */
#define  CAN_FA1_FEN12                          ((uint16_t)0x1000)            /*!< Filter 12 Active */
#define  CAN_FA1_FEN13                          ((uint16_t)0x2000)            /*!< Filter 13 Active */

/*******************  Bit definition for CAN_FB0R1 register  *******************/
#define  CAN_FB0R1_FD0                          ((uint32_t)0x00000001)        /*!< Filter bit 0 */
#define  CAN_FB0R1_FD1                          ((uint32_t)0x00000002)        /*!< Filter bit 1 */
#define  CAN_FB0R1_FD2                          ((uint32_t)0x00000004)        /*!< Filter bit 2 */
#define  CAN_FB0R1_FD3                          ((uint32_t)0x00000008)        /*!< Filter bit 3 */
#define  CAN_FB0R1_FD4                          ((uint32_t)0x00000010)        /*!< Filter bit 4 */
#define  CAN_FB0R1_FD5                          ((uint32_t)0x00000020)        /*!< Filter bit 5 */
#define  CAN_FB0R1_FD6                          ((uint32_t)0x00000040)        /*!< Filter bit 6 */
#define  CAN_FB0R1_FD7                          ((uint32_t)0x00000080)        /*!< Filter bit 7 */
#define  CAN_FB0R1_FD8                          ((uint32_t)0x00000100)        /*!< Filter bit 8 */
#define  CAN_FB0R1_FD9                          ((uint32_t)0x00000200)        /*!< Filter bit 9 */
#define  CAN_FB0R1_FD10                         ((uint32_t)0x00000400)        /*!< Filter bit 10 */
#define  CAN_FB0R1_FD11                         ((uint32_t)0x00000800)        /*!< Filter bit 11 */
#define  CAN_FB0R1_FD12                         ((uint32_t)0x00001000)        /*!< Filter bit 12 */
#define  CAN_FB0R1_FD13                         ((uint32_t)0x00002000)        /*!< Filter bit 13 */
#define  CAN_FB0R1_FD14                         ((uint32_t)0x00004000)        /*!< Filter bit 14 */
#define  CAN_FB0R1_FD15                         ((uint32_t)0x00008000)        /*!< Filter bit 15 */
#define  CAN_FB0R1_FD16                         ((uint32_t)0x00010000)        /*!< Filter bit 16 */
#define  CAN_FB0R1_FD17                         ((uint32_t)0x00020000)        /*!< Filter bit 17 */
#define  CAN_FB0R1_FD18                         ((uint32_t)0x00040000)        /*!< Filter bit 18 */
#define  CAN_FB0R1_FD19                         ((uint32_t)0x00080000)        /*!< Filter bit 19 */
#define  CAN_FB0R1_FD20                         ((uint32_t)0x00100000)        /*!< Filter bit 20 */
#define  CAN_FB0R1_FD21                         ((uint32_t)0x00200000)        /*!< Filter bit 21 */
#define  CAN_FB0R1_FD22                         ((uint32_t)0x00400000)        /*!< Filter bit 22 */
#define  CAN_FB0R1_FD23                         ((uint32_t)0x00800000)        /*!< Filter bit 23 */
#define  CAN_FB0R1_FD24                         ((uint32_t)0x01000000)        /*!< Filter bit 24 */
#define  CAN_FB0R1_FD25                         ((uint32_t)0x02000000)        /*!< Filter bit 25 */
#define  CAN_FB0R1_FD26                         ((uint32_t)0x04000000)        /*!< Filter bit 26 */
#define  CAN_FB0R1_FD27                         ((uint32_t)0x08000000)        /*!< Filter bit 27 */
#define  CAN_FB0R1_FD28                         ((uint32_t)0x10000000)        /*!< Filter bit 28 */
#define  CAN_FB0R1_FD29                         ((uint32_t)0x20000000)        /*!< Filter bit 29 */
#define  CAN_FB0R1_FD30                         ((uint32_t)0x40000000)        /*!< Filter bit 30 */
#define  CAN_FB0R1_FD31                         ((uint32_t)0x80000000)        /*!< Filter bit 31 */

