RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/*******************  Bit definition for CAN_FB1R1 register  *******************/
#define  CAN_FB1R1_FD0                          ((uint32_t)0x00000001)        /*!< Filter bit 0 */
#define  CAN_FB1R1_FD1                          ((uint32_t)0x00000002)        /*!< Filter bit 1 */
#define  CAN_FB1R1_FD2                          ((uint32_t)0x00000004)        /*!< Filter bit 2 */
#define  CAN_FB1R1_FD3                          ((uint32_t)0x00000008)        /*!< Filter bit 3 */
#define  CAN_FB1R1_FD4                          ((uint32_t)0x00000010)        /*!< Filter bit 4 */
#define  CAN_FB1R1_FD5                          ((uint32_t)0x00000020)        /*!< Filter bit 5 */
#define  CAN_FB1R1_FD6                          ((uint32_t)0x00000040)        /*!< Filter bit 6 */
#define  CAN_FB1R1_FD7                          ((uint32_t)0x00000080)        /*!< Filter bit 7 */
#define  CAN_FB1R1_FD8                          ((uint32_t)0x00000100)        /*!< Filter bit 8 */
#define  CAN_FB1R1_FD9                          ((uint32_t)0x00000200)        /*!< Filter bit 9 */
#define  CAN_FB1R1_FD10                         ((uint32_t)0x00000400)        /*!< Filter bit 10 */
#define  CAN_FB1R1_FD11                         ((uint32_t)0x00000800)        /*!< Filter bit 11 */
#define  CAN_FB1R1_FD12                         ((uint32_t)0x00001000)        /*!< Filter bit 12 */
#define  CAN_FB1R1_FD13                         ((uint32_t)0x00002000)        /*!< Filter bit 13 */
#define  CAN_FB1R1_FD14                         ((uint32_t)0x00004000)        /*!< Filter bit 14 */
#define  CAN_FB1R1_FD15                         ((uint32_t)0x00008000)        /*!< Filter bit 15 */
#define  CAN_FB1R1_FD16                         ((uint32_t)0x00010000)        /*!< Filter bit 16 */
#define  CAN_FB1R1_FD17                         ((uint32_t)0x00020000)        /*!< Filter bit 17 */
#define  CAN_FB1R1_FD18                         ((uint32_t)0x00040000)        /*!< Filter bit 18 */
#define  CAN_FB1R1_FD19                         ((uint32_t)0x00080000)        /*!< Filter bit 19 */
#define  CAN_FB1R1_FD20                         ((uint32_t)0x00100000)        /*!< Filter bit 20 */
#define  CAN_FB1R1_FD21                         ((uint32_t)0x00200000)        /*!< Filter bit 21 */
#define  CAN_FB1R1_FD22                         ((uint32_t)0x00400000)        /*!< Filter bit 22 */
#define  CAN_FB1R1_FD23                         ((uint32_t)0x00800000)        /*!< Filter bit 23 */
#define  CAN_FB1R1_FD24                         ((uint32_t)0x01000000)        /*!< Filter bit 24 */
#define  CAN_FB1R1_FD25                         ((uint32_t)0x02000000)        /*!< Filter bit 25 */
#define  CAN_FB1R1_FD26                         ((uint32_t)0x04000000)        /*!< Filter bit 26 */
#define  CAN_FB1R1_FD27                         ((uint32_t)0x08000000)        /*!< Filter bit 27 */
#define  CAN_FB1R1_FD28                         ((uint32_t)0x10000000)        /*!< Filter bit 28 */
#define  CAN_FB1R1_FD29                         ((uint32_t)0x20000000)        /*!< Filter bit 29 */
#define  CAN_FB1R1_FD30                         ((uint32_t)0x40000000)        /*!< Filter bit 30 */
#define  CAN_FB1R1_FD31                         ((uint32_t)0x80000000)        /*!< Filter bit 31 */

/*******************  Bit definition for CAN_FB2R1 register  *******************/
#define  CAN_FB2R1_FD0                          ((uint32_t)0x00000001)        /*!< Filter bit 0 */
#define  CAN_FB2R1_FD1                          ((uint32_t)0x00000002)        /*!< Filter bit 1 */
#define  CAN_FB2R1_FD2                          ((uint32_t)0x00000004)        /*!< Filter bit 2 */
#define  CAN_FB2R1_FD3                          ((uint32_t)0x00000008)        /*!< Filter bit 3 */
#define  CAN_FB2R1_FD4                          ((uint32_t)0x00000010)        /*!< Filter bit 4 */
#define  CAN_FB2R1_FD5                          ((uint32_t)0x00000020)        /*!< Filter bit 5 */
#define  CAN_FB2R1_FD6                          ((uint32_t)0x00000040)        /*!< Filter bit 6 */
#define  CAN_FB2R1_FD7                          ((uint32_t)0x00000080)        /*!< Filter bit 7 */
#define  CAN_FB2R1_FD8                          ((uint32_t)0x00000100)        /*!< Filter bit 8 */
#define  CAN_FB2R1_FD9                          ((uint32_t)0x00000200)        /*!< Filter bit 9 */
#define  CAN_FB2R1_FD10                         ((uint32_t)0x00000400)        /*!< Filter bit 10 */
#define  CAN_FB2R1_FD11                         ((uint32_t)0x00000800)        /*!< Filter bit 11 */
#define  CAN_FB2R1_FD12                         ((uint32_t)0x00001000)        /*!< Filter bit 12 */
#define  CAN_FB2R1_FD13                         ((uint32_t)0x00002000)        /*!< Filter bit 13 */
#define  CAN_FB2R1_FD14                         ((uint32_t)0x00004000)        /*!< Filter bit 14 */
#define  CAN_FB2R1_FD15                         ((uint32_t)0x00008000)        /*!< Filter bit 15 */
#define  CAN_FB2R1_FD16                         ((uint32_t)0x00010000)        /*!< Filter bit 16 */
#define  CAN_FB2R1_FD17                         ((uint32_t)0x00020000)        /*!< Filter bit 17 */
#define  CAN_FB2R1_FD18                         ((uint32_t)0x00040000)        /*!< Filter bit 18 */
#define  CAN_FB2R1_FD19                         ((uint32_t)0x00080000)        /*!< Filter bit 19 */
#define  CAN_FB2R1_FD20                         ((uint32_t)0x00100000)        /*!< Filter bit 20 */
#define  CAN_FB2R1_FD21                         ((uint32_t)0x00200000)        /*!< Filter bit 21 */
#define  CAN_FB2R1_FD22                         ((uint32_t)0x00400000)        /*!< Filter bit 22 */
#define  CAN_FB2R1_FD23                         ((uint32_t)0x00800000)        /*!< Filter bit 23 */
#define  CAN_FB2R1_FD24                         ((uint32_t)0x01000000)        /*!< Filter bit 24 */
#define  CAN_FB2R1_FD25                         ((uint32_t)0x02000000)        /*!< Filter bit 25 */
#define  CAN_FB2R1_FD26                         ((uint32_t)0x04000000)        /*!< Filter bit 26 */
#define  CAN_FB2R1_FD27                         ((uint32_t)0x08000000)        /*!< Filter bit 27 */
#define  CAN_FB2R1_FD28                         ((uint32_t)0x10000000)        /*!< Filter bit 28 */
#define  CAN_FB2R1_FD29                         ((uint32_t)0x20000000)        /*!< Filter bit 29 */
#define  CAN_FB2R1_FD30                         ((uint32_t)0x40000000)        /*!< Filter bit 30 */
#define  CAN_FB2R1_FD31                         ((uint32_t)0x80000000)        /*!< Filter bit 31 */

