RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/*******************  Bit definition for CAN_FB13R2 register  ******************/
#define  CAN_FB13R2_FD0                        ((uint32_t)0x00000001)        /*!< Filter bit 0 */
#define  CAN_FB13R2_FD1                        ((uint32_t)0x00000002)        /*!< Filter bit 1 */
#define  CAN_FB13R2_FD2                        ((uint32_t)0x00000004)        /*!< Filter bit 2 */
#define  CAN_FB13R2_FD3                        ((uint32_t)0x00000008)        /*!< Filter bit 3 */
#define  CAN_FB13R2_FD4                        ((uint32_t)0x00000010)        /*!< Filter bit 4 */
#define  CAN_FB13R2_FD5                        ((uint32_t)0x00000020)        /*!< Filter bit 5 */
#define  CAN_FB13R2_FD6                        ((uint32_t)0x00000040)        /*!< Filter bit 6 */
#define  CAN_FB13R2_FD7                        ((uint32_t)0x00000080)        /*!< Filter bit 7 */
#define  CAN_FB13R2_FD8                        ((uint32_t)0x00000100)        /*!< Filter bit 8 */
#define  CAN_FB13R2_FD9                        ((uint32_t)0x00000200)        /*!< Filter bit 9 */
#define  CAN_FB13R2_FD10                       ((uint32_t)0x00000400)        /*!< Filter bit 10 */
#define  CAN_FB13R2_FD11                       ((uint32_t)0x00000800)        /*!< Filter bit 11 */
#define  CAN_FB13R2_FD12                       ((uint32_t)0x00001000)        /*!< Filter bit 12 */
#define  CAN_FB13R2_FD13                       ((uint32_t)0x00002000)        /*!< Filter bit 13 */
#define  CAN_FB13R2_FD14                       ((uint32_t)0x00004000)        /*!< Filter bit 14 */
#define  CAN_FB13R2_FD15                       ((uint32_t)0x00008000)        /*!< Filter bit 15 */
#define  CAN_FB13R2_FD16                       ((uint32_t)0x00010000)        /*!< Filter bit 16 */
#define  CAN_FB13R2_FD17                       ((uint32_t)0x00020000)        /*!< Filter bit 17 */
#define  CAN_FB13R2_FD18                       ((uint32_t)0x00040000)        /*!< Filter bit 18 */
#define  CAN_FB13R2_FD19                       ((uint32_t)0x00080000)        /*!< Filter bit 19 */
#define  CAN_FB13R2_FD20                       ((uint32_t)0x00100000)        /*!< Filter bit 20 */
#define  CAN_FB13R2_FD21                       ((uint32_t)0x00200000)        /*!< Filter bit 21 */
#define  CAN_FB13R2_FD22                       ((uint32_t)0x00400000)        /*!< Filter bit 22 */
#define  CAN_FB13R2_FD23                       ((uint32_t)0x00800000)        /*!< Filter bit 23 */
#define  CAN_FB13R2_FD24                       ((uint32_t)0x01000000)        /*!< Filter bit 24 */
#define  CAN_FB13R2_FD25                       ((uint32_t)0x02000000)        /*!< Filter bit 25 */
#define  CAN_FB13R2_FD26                       ((uint32_t)0x04000000)        /*!< Filter bit 26 */
#define  CAN_FB13R2_FD27                       ((uint32_t)0x08000000)        /*!< Filter bit 27 */
#define  CAN_FB13R2_FD28                       ((uint32_t)0x10000000)        /*!< Filter bit 28 */
#define  CAN_FB13R2_FD29                       ((uint32_t)0x20000000)        /*!< Filter bit 29 */
#define  CAN_FB13R2_FD30                       ((uint32_t)0x40000000)        /*!< Filter bit 30 */
#define  CAN_FB13R2_FD31                       ((uint32_t)0x80000000)        /*!< Filter bit 31 */

/******************************************************************************/
/*                                                                            */
/*                        Serial Peripheral Interface                         */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for SPI_CTRL1 register  ********************/
#define  SPI_CTRL1_CPHA                         ((uint16_t)0x0001)            /*!< Clock Phase */
#define  SPI_CTRL1_CPOL                         ((uint16_t)0x0002)            /*!< Clock Polarity */
#define  SPI_CTRL1_MSTEN                        ((uint16_t)0x0004)            /*!< Master Selection */

#define  SPI_CTRL1_MCLKP                        ((uint16_t)0x0038)            /*!< BR[2:0] bits (Baud Rate Control) */
#define  SPI_CTRL1_MCLKP_0                      ((uint16_t)0x0008)            /*!< Bit 0 */
#define  SPI_CTRL1_MCLKP_1                      ((uint16_t)0x0010)            /*!< Bit 1 */
#define  SPI_CTRL1_MCLKP_2                      ((uint16_t)0x0020)            /*!< Bit 2 */

#define  SPI_CTRL1_SPIEN                        ((uint16_t)0x0040)            /*!< SPI Enable */
#define  SPI_CTRL1_LSBEN                        ((uint16_t)0x0080)            /*!< Frame Format */
#define  SPI_CTRL1_ISS                          ((uint16_t)0x0100)            /*!< Internal slave select */
#define  SPI_CTRL1_SWNSSEN                      ((uint16_t)0x0200)            /*!< Software slave management */
#define  SPI_CTRL1_RONLY                        ((uint16_t)0x0400)            /*!< Receive only */
#define  SPI_CTRL1_DFF16                        ((uint16_t)0x0800)            /*!< Data Frame Format */
#define  SPI_CTRL1_CTN                          ((uint16_t)0x1000)            /*!< Transmit CRC next */
#define  SPI_CTRL1_CCE                          ((uint16_t)0x2000)            /*!< Hardware CRC calculation enable */
#define  SPI_CTRL1_BDOE                         ((uint16_t)0x4000)            /*!< Output enable in bidirectional mode */
#define  SPI_CTRL1_BDMODE                       ((uint16_t)0x8000)            /*!< Bidirectional data mode enable */

/*******************  Bit definition for SPI_CTRL2 register  ********************/
#define  SPI_CTRL2_DMAREN                       ((uint16_t)0x0001)            /*!< Rx Buffer DMA Enable */
#define  SPI_CTRL2_DMATEN                       ((uint16_t)0x0002)            /*!< Tx Buffer DMA Enable */
#define  SPI_CTRL2_NSSOE                        ((uint16_t)0x0004)            /*!< SS Output Enable */
#define  SPI_CTRL2_ERRIE                        ((uint16_t)0x0020)            /*!< Error Interrupt Enable */
#define  SPI_CTRL2_RNEIE                        ((uint16_t)0x0040)            /*!< RX buffer Not Empty Interrupt Enable */
#define  SPI_CTRL2_TEIE                         ((uint16_t)0x0080)            /*!< Tx buffer Empty Interrupt Enable */
#define  SPI_CTRL2_MCLKP_EXT                    ((uint16_t)0x0100)            /*!< BR[3] bits (Baud Rate Control) */
#define  SPI_CTRL2_MCLKP_3                      ((uint16_t)0x0100)            /*!< Bit 3 */

