RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/********************  Bit definition for SPI_STS register  ********************/
#define  SPI_STS_RNE                            ((uint8_t)0x01)               /*!< Receive buffer Not Empty */
#define  SPI_STS_TE                             ((uint8_t)0x02)               /*!< Transmit buffer Empty */
#define  SPI_STS_I2SCS                          ((uint8_t)0x04)               /*!< Channel side */
#define  SPI_STS_UDR                            ((uint8_t)0x08)               /*!< Underrun flag */
#define  SPI_STS_CERR                           ((uint8_t)0x10)               /*!< CRC Error flag */
#define  SPI_STS_MODF                           ((uint8_t)0x20)               /*!< Mode fault */
#define  SPI_STS_OVR                            ((uint8_t)0x40)               /*!< Overrun flag */
#define  SPI_STS_BSY                            ((uint8_t)0x80)               /*!< Busy flag */

/********************  Bit definition for SPI_DT register  ********************/
#define  SPI_DT_DT                              ((uint16_t)0xFFFF)            /*!< Data Register */

/*******************  Bit definition for SPI_CPOLY register  ******************/
#define  SPI_CPOLY_CPOLY                        ((uint16_t)0xFFFF)            /*!< CRC polynomial register */

/******************  Bit definition for SPI_RCRC register  ******************/
#define  SPI_RCRC_RCRC                          ((uint16_t)0xFFFF)            /*!< Rx CRC Register */

/******************  Bit definition for SPI_TCRC register  ******************/
#define  SPI_TCRC_TCRC                          ((uint16_t)0xFFFF)            /*!< Tx CRC Register */

/******************  Bit definition for SPI_I2SCTRL register  *****************/
#define  SPI_I2SCTRL_CHLEN                      ((uint16_t)0x0001)            /*!< Channel length (number of bits per audio channel) */

#define  SPI_I2SCTRL_DLEN                       ((uint16_t)0x0006)            /*!< DATLEN[1:0] bits (Data length to be transferred) */
#define  SPI_I2SCTRL_DLEN_0                     ((uint16_t)0x0002)            /*!< Bit 0 */
#define  SPI_I2SCTRL_DLEN_1                     ((uint16_t)0x0004)            /*!< Bit 1 */

#define  SPI_I2SCTRL_CPOL                       ((uint16_t)0x0008)            /*!< steady state clock polarity */

#define  SPI_I2SCTRL_I2SAP                      ((uint16_t)0x0030)            /*!< I2SSTD[1:0] bits (I2S standard selection) */
#define  SPI_I2SCTRL_I2SAP_0                    ((uint16_t)0x0010)            /*!< Bit 0 */
#define  SPI_I2SCTRL_I2SAP_1                    ((uint16_t)0x0020)            /*!< Bit 1 */

#define  SPI_I2SCTRL_PCMSYNCSEL                 ((uint16_t)0x0080)            /*!< PCM frame synchronization */

#define  SPI_I2SCTRL_I2SMOD                     ((uint16_t)0x0300)            /*!< I2SCFG[1:0] bits (I2S configuration mode) */
#define  SPI_I2SCTRL_I2SMOD_0                   ((uint16_t)0x0100)            /*!< Bit 0 */
#define  SPI_I2SCTRL_I2SMOD_1                   ((uint16_t)0x0200)            /*!< Bit 1 */

#define  SPI_I2SCTRL_I2SEN                      ((uint16_t)0x0400)            /*!< I2S Enable */
#define  SPI_I2SCTRL_I2SSEL                     ((uint16_t)0x0800)            /*!< I2S mode selection */

/******************  Bit definition for SPI_I2SCLKP register  *******************/
#define  SPI_I2SCLKP_I2SDIV                     ((uint16_t)0x0CFF)            /*!< I2S Linear prescaler */
#define  SPI_I2SCLKP_I2SODD                     ((uint16_t)0x0100)            /*!< Odd factor for the prescaler */
#define  SPI_I2SCLKP_I2SMCLKOE                  ((uint16_t)0x0200)            /*!< Master Clock Output Enable */




/******************************************************************************/
/*                                                                            */
/*                      Inter-integrated Circuit Interface                    */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for I2C_CTRL1 register  ********************/
#define  I2C_CTRL1_PEN                          ((uint16_t)0x0001)            /*!< Peripheral Enable */
#define  I2C_CTRL1_SMBMODE                      ((uint16_t)0x0002)            /*!< SMBus Mode */
#define  I2C_CTRL1_SMBTYPE                      ((uint16_t)0x0008)            /*!< SMBus Type */
#define  I2C_CTRL1_ARPEN                        ((uint16_t)0x0010)            /*!< ARP Enable */
#define  I2C_CTRL1_PECEN                        ((uint16_t)0x0020)            /*!< PEC Enable */
#define  I2C_CTRL1_GCEN                         ((uint16_t)0x0040)            /*!< General Call Enable */
#define  I2C_CTRL1_NOCLKSTRETCH                 ((uint16_t)0x0080)            /*!< Clock Stretching Disable (Slave mode) */
#define  I2C_CTRL1_STARTGEN                     ((uint16_t)0x0100)            /*!< Start Generation */
#define  I2C_CTRL1_STOPGEN                      ((uint16_t)0x0200)            /*!< Stop Generation */
#define  I2C_CTRL1_ACKEN                        ((uint16_t)0x0400)            /*!< Acknowledge Enable */
#define  I2C_CTRL1_POSEN                        ((uint16_t)0x0800)            /*!< Acknowledge/PEC Position (for data reception) */
#define  I2C_CTRL1_PECTRA                       ((uint16_t)0x1000)            /*!< Packet Error Checking */
#define  I2C_CTRL1_SMBALERT                     ((uint16_t)0x2000)            /*!< SMBus Alert */
#define  I2C_CTRL1_SWRESET                      ((uint16_t)0x8000)            /*!< Software Reset */

/*******************  Bit definition for I2C_CTRL2 register  ********************/
#define  I2C_CTRL2_CLKFREQ                      ((uint16_t)0x003F)            /*!< FREQ[7:0] bits (Peripheral Clock Frequency) */
#define  I2C_CTRL2_CLKFREQ_B0                   ((uint16_t)0x0001)            /*!< Bit 0 */
#define  I2C_CTRL2_CLKFREQ_B1                   ((uint16_t)0x0002)            /*!< Bit 1 */
#define  I2C_CTRL2_CLKFREQ_B2                   ((uint16_t)0x0004)            /*!< Bit 2 */
#define  I2C_CTRL2_CLKFREQ_B3                   ((uint16_t)0x0008)            /*!< Bit 3 */
#define  I2C_CTRL2_CLKFREQ_B4                   ((uint16_t)0x0010)            /*!< Bit 4 */
#define  I2C_CTRL2_CLKFREQ_B5                   ((uint16_t)0x0020)            /*!< Bit 5 */
#define  I2C_CTRL2_CLKFREQ_B6                   ((uint16_t)0x0040)            /*!< Bit 6 */
#define  I2C_CTRL2_CLKFREQ_B7                   ((uint16_t)0x0080)            /*!< Bit 7 */

#define  I2C_CTRL2_ERRITEN                      ((uint16_t)0x0100)            /*!< Error Interrupt Enable */
#define  I2C_CTRL2_EVTITEN                      ((uint16_t)0x0200)            /*!< Event Interrupt Enable */
#define  I2C_CTRL2_BUFITEN                      ((uint16_t)0x0400)            /*!< Buffer Interrupt Enable */
#define  I2C_CTRL2_DMAEN                        ((uint16_t)0x0800)            /*!< DMA Requests Enable */
#define  I2C_CTRL2_DMALAST                      ((uint16_t)0x1000)            /*!< DMA Last Transfer */

/*******************  Bit definition for I2C_OADDR1 register  *******************/
#define  I2C_OADDR1_ADDR1_7                     ((uint16_t)0x00FE)            /*!< Interface Address */
#define  I2C_OADDR1_ADDR8_9                     ((uint16_t)0x0300)            /*!< Interface Address */

#define  I2C_OADDR1_ADDR_B0                     ((uint16_t)0x0001)            /*!< Bit 0 */
#define  I2C_OADDR1_ADDR_B1                     ((uint16_t)0x0002)            /*!< Bit 1 */
#define  I2C_OADDR1_ADDR_B2                     ((uint16_t)0x0004)            /*!< Bit 2 */
#define  I2C_OADDR1_ADDR_B3                     ((uint16_t)0x0008)            /*!< Bit 3 */
#define  I2C_OADDR1_ADDR_B4                     ((uint16_t)0x0010)            /*!< Bit 4 */
#define  I2C_OADDR1_ADDR_B5                     ((uint16_t)0x0020)            /*!< Bit 5 */
#define  I2C_OADDR1_ADDR_B6                     ((uint16_t)0x0040)            /*!< Bit 6 */
#define  I2C_OADDR1_ADDR_B7                     ((uint16_t)0x0080)            /*!< Bit 7 */
#define  I2C_OADDR1_ADDR_B8                     ((uint16_t)0x0100)            /*!< Bit 8 */
#define  I2C_OADDR1_ADDR_B9                     ((uint16_t)0x0200)            /*!< Bit 9 */

