RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#define  I2C_OADDR1_ADDRMODE                    ((uint16_t)0x8000)            /*!< Addressing Mode (Slave mode) */

/*******************  Bit definition for I2C_OADDR2 register  *******************/
#define  I2C_OADDR2_DUALEN                      ((uint8_t)0x01)               /*!< Dual addressing mode enable */
#define  I2C_OADDR2_ADDR2                       ((uint8_t)0xFE)               /*!< Interface address */

/********************  Bit definition for I2C_DT register  ********************/
#define  I2C_DT_DT                              ((uint8_t)0xFF)               /*!< 8-bit Data Register */

/*******************  Bit definition for I2C_STS1 register  ********************/
#define  I2C_STS1_STARTF                        ((uint16_t)0x0001)            /*!< Start Bit (Master mode) */
#define  I2C_STS1_ADDRF                         ((uint16_t)0x0002)            /*!< Address sent (master mode)/matched (slave mode) */
#define  I2C_STS1_BTFF                          ((uint16_t)0x0004)            /*!< Byte Transfer Finished */
#define  I2C_STS1_ADDR10F                       ((uint16_t)0x0008)            /*!< 10-bit header sent (Master mode) */
#define  I2C_STS1_STOPF                         ((uint16_t)0x0010)            /*!< Stop detection (Slave mode) */
#define  I2C_STS1_RDNE                          ((uint16_t)0x0040)            /*!< Data Register not Empty (receivers) */
#define  I2C_STS1_TDE                           ((uint16_t)0x0080)            /*!< Data Register Empty (transmitters) */
#define  I2C_STS1_BUSERR                        ((uint16_t)0x0100)            /*!< Bus Error */
#define  I2C_STS1_ARLOST                        ((uint16_t)0x0200)            /*!< Arbitration Lost (master mode) */
#define  I2C_STS1_ACKFAIL                       ((uint16_t)0x0400)            /*!< Acknowledge Failure */
#define  I2C_STS1_OVRUN                         ((uint16_t)0x0800)            /*!< Overrun/Underrun */
#define  I2C_STS1_PECERR                        ((uint16_t)0x1000)            /*!< PEC Error in reception */
#define  I2C_STS1_TIMOUT                        ((uint16_t)0x4000)            /*!< Timeout or Tlow Error */
#define  I2C_STS1_SMBALERTF                     ((uint16_t)0x8000)            /*!< SMBus Alert */

/*******************  Bit definition for I2C_STS2 register  ********************/
#define  I2C_STS2_MSF                           ((uint16_t)0x0001)            /*!< Master/Slave */
#define  I2C_STS2_BUSYF                         ((uint16_t)0x0002)            /*!< Bus Busy */
#define  I2C_STS2_TRF                           ((uint16_t)0x0004)            /*!< Transmitter/Receiver */
#define  I2C_STS2_GCADDRF                       ((uint16_t)0x0010)            /*!< General Call Address (Slave mode) */
#define  I2C_STS2_SMBDEFTADDRF                  ((uint16_t)0x0020)            /*!< SMBus Device Default Address (Slave mode) */
#define  I2C_STS2_SMBHOSTADDRF                  ((uint16_t)0x0040)            /*!< SMBus Host Header (Slave mode) */
#define  I2C_STS2_DUALF                         ((uint16_t)0x0080)            /*!< Dual Flag (Slave mode) */
#define  I2C_STS2_PECVAL                        ((uint16_t)0xFF00)            /*!< Packet Error Checking Register */

/*******************  Bit definition for I2C_CLKCTRL register  ********************/
#define  I2C_CLKCTRL_CLKCTRL                    ((uint16_t)0x0FFF)            /*!< Clock Control Register in Fast/Standard mode (Master mode) */
#define  I2C_CLKCTRL_FMDUTY                     ((uint16_t)0x4000)            /*!< Fast Mode Duty Cycle */
#define  I2C_CLKCTRL_FSMODE                     ((uint16_t)0x8000)            /*!< I2C Master Mode Selection */

/******************  Bit definition for I2C_TMRISE register  *******************/
#define  I2C_TMRISE_TMRISE                      ((uint8_t)0x3F)               /*!< Maximum Rise Time in Fast/Standard mode (Master mode) */

/******************************************************************************/
/*                                                                            */
/*         Universal Synchronous Asynchronous Receiver Transmitter            */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for USART_STS register  *******************/
#define  USART_STS_PERR                         ((uint16_t)0x0001)            /*!< Parity Error */
#define  USART_STS_FERR                         ((uint16_t)0x0002)            /*!< Framing Error */
#define  USART_STS_NERR                         ((uint16_t)0x0004)            /*!< Noise Error Flag */
#define  USART_STS_ORERR                        ((uint16_t)0x0008)            /*!< OverRun Error */
#define  USART_STS_IDLEF                        ((uint16_t)0x0010)            /*!< IDLE line detected */
#define  USART_STS_RDNE                         ((uint16_t)0x0020)            /*!< Read Data Register Not Empty */
#define  USART_STS_TRAC                         ((uint16_t)0x0040)            /*!< Transmission Complete */
#define  USART_STS_TDE                          ((uint16_t)0x0080)            /*!< Transmit Data Register Empty */
#define  USART_STS_LBDF                         ((uint16_t)0x0100)            /*!< LIN Break Detection Flag */
#define  USART_STS_CTSF                         ((uint16_t)0x0200)            /*!< CTS Flag */

/*******************  Bit definition for USART_DT register  *******************/
#define  USART_DT_DT                            ((uint16_t)0x01FF)            /*!< Data value */

/******************  Bit definition for USART_BAUDR register  *******************/
#define  USART_BAUDR_DIV_Decimal                ((uint16_t)0x000F)            /*!< Fraction of USARTDIV */
#define  USART_BAUDR_DIV_Integer                ((uint16_t)0xFFF0)            /*!< Mantissa of USARTDIV */

/******************  Bit definition for USART_CTRL1 register  *******************/
#define  USART_CTRL1_SBRK                       ((uint16_t)0x0001)            /*!< Send Break */
#define  USART_CTRL1_RECMUTE                    ((uint16_t)0x0002)            /*!< Receiver wakeup */
#define  USART_CTRL1_REN                        ((uint16_t)0x0004)            /*!< Receiver Enable */
#define  USART_CTRL1_TEN                        ((uint16_t)0x0008)            /*!< Transmitter Enable */
#define  USART_CTRL1_IDLEIEN                    ((uint16_t)0x0010)            /*!< IDLE Interrupt Enable */
#define  USART_CTRL1_RDNEIEN                    ((uint16_t)0x0020)            /*!< RXNE Interrupt Enable */
#define  USART_CTRL1_TRACIEN                    ((uint16_t)0x0040)            /*!< Transmission Complete Interrupt Enable */
#define  USART_CTRL1_TDEIEN                     ((uint16_t)0x0080)            /*!< PE Interrupt Enable */
#define  USART_CTRL1_PERRIEN                    ((uint16_t)0x0100)            /*!< PE Interrupt Enable */
#define  USART_CTRL1_PSEL                       ((uint16_t)0x0200)            /*!< Parity Selection */
#define  USART_CTRL1_PCEN                       ((uint16_t)0x0400)            /*!< Parity Control Enable */
#define  USART_CTRL1_WUMODE                     ((uint16_t)0x0800)            /*!< Wakeup method */
#define  USART_CTRL1_LEN                        ((uint16_t)0x1000)            /*!< Word length */
#define  USART_CTRL1_UEN                        ((uint16_t)0x2000)            /*!< USART Enable */
#define  USART_CTRL1_OVER8                      ((uint16_t)0x8000)            /*!< USART Oversmapling 8-bits */

/******************  Bit definition for USART_CTRL2 register  *******************/
#define  USART_CTRL2_ADDR                       ((uint16_t)0x000F)            /*!< Address of the USART node */
#define  USART_CTRL2_LBDLEN                     ((uint16_t)0x0020)            /*!< LIN Break Detection Length */
#define  USART_CTRL2_LBDIEN                     ((uint16_t)0x0040)            /*!< LIN Break Detection Interrupt Enable */
#define  USART_CTRL2_LBCP                       ((uint16_t)0x0100)            /*!< Last Bit Clock pulse */
#define  USART_CTRL2_CLKPHA                     ((uint16_t)0x0200)            /*!< Clock Phase */
#define  USART_CTRL2_CLKPOL                     ((uint16_t)0x0400)            /*!< Clock Polarity */
#define  USART_CTRL2_CLKEN                      ((uint16_t)0x0800)            /*!< Clock Enable */

#define  USART_CTRL2_STOPB                      ((uint16_t)0x3000)            /*!< STOP[1:0] bits (STOP bits) */
#define  USART_CTRL2_STOP_B0                    ((uint16_t)0x1000)            /*!< Bit 0 */
#define  USART_CTRL2_STOP_B1                    ((uint16_t)0x2000)            /*!< Bit 1 */

#define  USART_CTRL2_LINEN                      ((uint16_t)0x4000)            /*!< LIN mode enable */

