RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/******************  Bit definition for USART_CTRL3 register  *******************/
#define  USART_CTRL3_ERRIEN                     ((uint16_t)0x0001)            /*!< Error Interrupt Enable */
#define  USART_CTRL3_IRDAEN                     ((uint16_t)0x0002)            /*!< IrDA mode Enable */
#define  USART_CTRL3_IRDALP                     ((uint16_t)0x0004)            /*!< IrDA Low-Power */
#define  USART_CTRL3_HALFSEL                    ((uint16_t)0x0008)            /*!< Half-Duplex Selection */
#define  USART_CTRL3_NACKEN                     ((uint16_t)0x0010)            /*!< Smartcard NACK enable */
#define  USART_CTRL3_SCMEN                      ((uint16_t)0x0020)            /*!< Smartcard mode enable */
#define  USART_CTRL3_DMAREN                     ((uint16_t)0x0040)            /*!< DMA Enable Receiver */
#define  USART_CTRL3_DMATEN                     ((uint16_t)0x0080)            /*!< DMA Enable Transmitter */
#define  USART_CTRL3_RTSEN                      ((uint16_t)0x0100)            /*!< RTS Enable */
#define  USART_CTRL3_CTSEN                      ((uint16_t)0x0200)            /*!< CTS Enable */
#define  USART_CTRL3_CTSIEN                     ((uint16_t)0x0400)            /*!< CTS Interrupt Enable */
#define  USART_CTRL3_ONEBIT                     ((uint16_t)0x0800)            /*!< One Bit method */

/******************  Bit definition for USART_GTP register  ******************/
#define  USART_GTP_PSC                          ((uint16_t)0x00FF)            /*!< PSC[7:0] bits (Prescaler value) */
#define  USART_GTP_PSC_B0                       ((uint16_t)0x0001)            /*!< Bit 0 */
#define  USART_GTP_PSC_B1                       ((uint16_t)0x0002)            /*!< Bit 1 */
#define  USART_GTP_PSC_B2                       ((uint16_t)0x0004)            /*!< Bit 2 */
#define  USART_GTP_PSC_B3                       ((uint16_t)0x0008)            /*!< Bit 3 */
#define  USART_GTP_PSC_B4                       ((uint16_t)0x0010)            /*!< Bit 4 */
#define  USART_GTP_PSC_B5                       ((uint16_t)0x0020)            /*!< Bit 5 */
#define  USART_GTP_PSC_B6                       ((uint16_t)0x0040)            /*!< Bit 6 */
#define  USART_GTP_PSC_B7                       ((uint16_t)0x0080)            /*!< Bit 7 */

#define  USART_GTP_GTVAL                        ((uint16_t)0xFF00)            /*!< Guard time value */

/******************************************************************************/
/*                                                                            */
/*                                 Debug MCU                                  */
/*                                                                            */
/******************************************************************************/

/****************  Bit definition for DBGMCU_IDCR register  *****************/
#define  MCUDBG_IDCR_DEV_ID                     ((uint32_t)0x00000FFF)        /*!< Device Identifier */

#define  MCUDBG_IDCR_REV_ID                     ((uint32_t)0xFFFF0000)        /*!< REV_ID[15:0] bits (Revision Identifier) */
#define  MCUDBG_IDCR_REV_ID_0                   ((uint32_t)0x00010000)        /*!< Bit 0 */
#define  MCUDBG_IDCR_REV_ID_1                   ((uint32_t)0x00020000)        /*!< Bit 1 */
#define  MCUDBG_IDCR_REV_ID_2                   ((uint32_t)0x00040000)        /*!< Bit 2 */
#define  MCUDBG_IDCR_REV_ID_3                   ((uint32_t)0x00080000)        /*!< Bit 3 */
#define  MCUDBG_IDCR_REV_ID_4                   ((uint32_t)0x00100000)        /*!< Bit 4 */
#define  MCUDBG_IDCR_REV_ID_5                   ((uint32_t)0x00200000)        /*!< Bit 5 */
#define  MCUDBG_IDCR_REV_ID_6                   ((uint32_t)0x00400000)        /*!< Bit 6 */
#define  MCUDBG_IDCR_REV_ID_7                   ((uint32_t)0x00800000)        /*!< Bit 7 */
#define  MCUDBG_IDCR_REV_ID_8                   ((uint32_t)0x01000000)        /*!< Bit 8 */
#define  MCUDBG_IDCR_REV_ID_9                   ((uint32_t)0x02000000)        /*!< Bit 9 */
#define  MCUDBG_IDCR_REV_ID_10                  ((uint32_t)0x04000000)        /*!< Bit 10 */
#define  MCUDBG_IDCR_REV_ID_11                  ((uint32_t)0x08000000)        /*!< Bit 11 */
#define  MCUDBG_IDCR_REV_ID_12                  ((uint32_t)0x10000000)        /*!< Bit 12 */
#define  MCUDBG_IDCR_REV_ID_13                  ((uint32_t)0x20000000)        /*!< Bit 13 */
#define  MCUDBG_IDCR_REV_ID_14                  ((uint32_t)0x40000000)        /*!< Bit 14 */
#define  MCUDBG_IDCR_REV_ID_15                  ((uint32_t)0x80000000)        /*!< Bit 15 */

/******************  Bit definition for DBGMCU_CTRL register  *******************/
#define  MCUDBG_CTRL_DBG_SLEEP                  ((uint32_t)0x00000001)        /*!< Debug Sleep Mode */
#define  MCUDBG_CTRL_DBG_STOP                   ((uint32_t)0x00000002)        /*!< Debug Stop Mode */
#define  MCUDBG_CTRL_DBG_STANDBY                ((uint32_t)0x00000004)        /*!< Debug Standby mode */
#define  MCUDBG_CTRL_TRACE_IOEN                 ((uint32_t)0x00000020)        /*!< Trace Pin Assignment Control */

#define  MCUDBG_CTRL_TRACE_MODE                 ((uint32_t)0x000000C0)        /*!< TRACE_MODE[1:0] bits (Trace Pin Assignment Control) */
#define  MCUDBG_CTRL_TRACE_MODE_0               ((uint32_t)0x00000040)        /*!< Bit 0 */
#define  MCUDBG_CTRL_TRACE_MODE_1               ((uint32_t)0x00000080)        /*!< Bit 1 */

#define  MCUDBG_CTRL_DBG_IWDG_STOP              ((uint32_t)0x00000100)        /*!< Debug Independent Watchdog stopped when Core is halted */
#define  MCUDBG_CTRL_DBG_WWDG_STOP              ((uint32_t)0x00000200)        /*!< Debug Window Watchdog stopped when Core is halted */
#define  MCUDBG_CTRL_DBG_TMR1_STOP              ((uint32_t)0x00000400)        /*!< TMR1 counter stopped when core is halted */
#define  MCUDBG_CTRL_DBG_TMR2_STOP              ((uint32_t)0x00000800)        /*!< TMR2 counter stopped when core is halted */
#define  MCUDBG_CTRL_DBG_TMR3_STOP              ((uint32_t)0x00001000)        /*!< TMR3 counter stopped when core is halted */
#define  MCUDBG_CTRL_DBG_TMR4_STOP              ((uint32_t)0x00002000)        /*!< TMR4 counter stopped when core is halted */
#define  MCUDBG_CTRL_DBG_CAN1_STOP              ((uint32_t)0x00004000)        /*!< Debug CAN1 stopped when Core is halted */
#define  MCUDBG_CTRL_DBG_I2C1_SMBUS_TIMEOUT     ((uint32_t)0x00008000)        /*!< SMBUS timeout mode stopped when Core is halted */
#define  MCUDBG_CTRL_DBG_I2C2_SMBUS_TIMEOUT     ((uint32_t)0x00010000)        /*!< SMBUS timeout mode stopped when Core is halted */
#define  MCUDBG_CTRL_DBG_TMR8_STOP              ((uint32_t)0x00020000)        /*!< TMR8 counter stopped when core is halted */
#define  MCUDBG_CTRL_DBG_TMR5_STOP              ((uint32_t)0x00040000)        /*!< TMR5 counter stopped when core is halted */


#define  MCUDBG_CTRL_DBG_TMR9_STOP              ((uint32_t)0x10000000)        /*!< Debug TMR9 stopped when Core is halted */
#define  MCUDBG_CTRL_DBG_TMR10_STOP             ((uint32_t)0x20000000)        /*!< Debug TMR10 stopped when Core is halted */
#define  MCUDBG_CTRL_DBG_TMR11_STOP             ((uint32_t)0x40000000)        /*!< Debug TMR11 stopped when Core is halted */

