RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#ifdef AT32F413xx
#if !defined (AT32FEBKCx_MD)
#define  MCUDBG_CTRL_DBG_CAN2_STOP              ((uint32_t)0x00200000)        /*!< Debug CAN2 stopped when Core is halted */
#endif
#else
#define  MCUDBG_CTRL_DBG_TMR6_STOP              ((uint32_t)0x00080000)        /*!< TMR6 counter stopped when core is halted */
#define  MCUDBG_CTRL_DBG_TMR7_STOP              ((uint32_t)0x00100000)        /*!< TMR7 counter stopped when core is halted */
#define  MCUDBG_CTRL_DBG_TMR15_STOP             ((uint32_t)0x00400000)        /*!< Debug TMR15 stopped when Core is halted */
#define  MCUDBG_CTRL_DBG_TMR12_STOP             ((uint32_t)0x02000000)        /*!< Debug TMR12 stopped when Core is halted */
#define  MCUDBG_CTRL_DBG_TMR13_STOP             ((uint32_t)0x04000000)        /*!< Debug TMR13 stopped when Core is halted */
#define  MCUDBG_CTRL_DBG_TMR14_STOP             ((uint32_t)0x08000000)        /*!< Debug TMR14 stopped when Core is halted */
#define  MCUDBG_CTRL_DBG_I2C3_SMBUS_TIMEOUT     ((uint32_t)0x80000000)        /*!< SMBUS timeout mode stopped when Core is halted */
#endif

/******************************************************************************/
/*                                                                            */
/*                      FLASH and Option Bytes Registers                      */
/*                                                                            */
/******************************************************************************/

/*******************  Bit definition for FLASH_ACR register  ******************/
#define  FLASH_ACR_LATENCY                      ((uint8_t)0x07)               /*!< LATENCY[2:0] bits (Latency) */
#define  FLASH_ACR_LATENCY_0                    ((uint8_t)0x00)               /*!< Bit 0 */
#define  FLASH_ACR_LATENCY_1                    ((uint8_t)0x01)               /*!< Bit 0 */
#define  FLASH_ACR_LATENCY_2                    ((uint8_t)0x02)               /*!< Bit 1 */
#define  FLASH_ACR_LATENCY_3                    ((uint8_t)0x03)               /*!< Bit 1 & Bit 0 */
#define  FLASH_ACR_LATENCY_4                    ((uint8_t)0x04)               /*!< Bit 2 */
#define  FLASH_ACR_LATENCY_5                    ((uint8_t)0x05)               /*!< Bit 2 & Bit 0 */

#define  FLASH_ACR_HLFCYA                       ((uint8_t)0x08)               /*!< Flash Half Cycle Access Enable */
#define  FLASH_ACR_PRFTBE                       ((uint8_t)0x10)               /*!< Prefetch Buffer Enable */
#define  FLASH_ACR_PRFTBS                       ((uint8_t)0x20)               /*!< Prefetch Buffer Status */

/******************  Bit definition for FLASH_FCKEY register  ******************/
#define  FLASH_FCKEY_KEY                        ((uint32_t)0xFFFFFFFF)        /*!< FPEC Key */

/*****************  Bit definition for FLASH_UOBKEY register  ****************/
#define  FLASH_UOBKEY_KEY                       ((uint32_t)0xFFFFFFFF)        /*!< Option Byte Key */

/******************  Bit definition for FLASH_STS register  *******************/
#define  FLASH_STS_BSY                          ((uint8_t)0x01)               /*!< Busy */
#define  FLASH_STS_PRGMFLR                      ((uint8_t)0x04)               /*!< Programming Error */
#define  FLASH_STS_WRPRTFLR                     ((uint8_t)0x10)               /*!< Write Protection Error */
#define  FLASH_STS_PRCDN                        ((uint8_t)0x20)               /*!< End of operation */

/*******************  Bit definition for FLASH_CTRL register  *******************/
#define  FLASH_CTRL_PRGM                        ((uint16_t)0x0001)            /*!< Programming */
#define  FLASH_CTRL_PGERS                       ((uint16_t)0x0002)            /*!< Page Erase */
#define  FLASH_CTRL_CHPERS                      ((uint16_t)0x0004)            /*!< Mass Erase */
#define  FLASH_CTRL_UOBPRGM                     ((uint16_t)0x0010)            /*!< Option Byte Programming */
#define  FLASH_CTRL_UOBERS                      ((uint16_t)0x0020)            /*!< Option Byte Erase */
#define  FLASH_CTRL_STRT                        ((uint16_t)0x0040)            /*!< Start */
#define  FLASH_CTRL_LCK                         ((uint16_t)0x0080)            /*!< Lock */
#define  FLASH_CTRL_UOBWE                       ((uint16_t)0x0200)            /*!< Option Bytes Write Enable */
#define  FLASH_CTRL_FLRIE                       ((uint16_t)0x0400)            /*!< Error Interrupt Enable */
#define  FLASH_CTRL_PRCDNIE                     ((uint16_t)0x1000)            /*!< End of operation interrupt enable */
#define  FLASH_CTRL_OPTION_BYTE_PRT_DIS_TRIG    ((uint32_t)0x00010000)        /*!< Disable Option Byte Protection */

/*******************  Bit definition for FLASH_ADDR register  *******************/
#define  FLASH_ADDR_TA                          ((uint32_t)0xFFFFFFFF)        /*!< Flash Address */

/******************  Bit definition for FLASH_UOB register  *******************/
#define  FLASH_UOB_UOBFLR                       ((uint16_t)0x0001)            /*!< Option Byte Error */
#define  FLASH_UOB_RDPRTEN                      ((uint16_t)0x0002)            /*!< Read protection */

#define  FLASH_UOB_USR                          ((uint16_t)0x03FC)            /*!< User Option Bytes */
#define  FLASH_UOB_SW_WDG                       ((uint16_t)0x0004)            /*!< WDG_SW */
#define  FLASH_UOB_nSTP_RST                     ((uint16_t)0x0008)            /*!< nRST_STOP */
#define  FLASH_UOB_nSTDBY_RST                   ((uint16_t)0x0010)            /*!< nRST_STDBY */
#define  FLASH_UOB_BTOPT                        ((uint16_t)0x0020)            /*!< BFB2 */

#define  FLASH_UOB_DATA0                        ((uint32_t)0x0003FC00)        /*!< User data 0 */
#define  FLASH_UOB_DATA1                        ((uint32_t)0x03FC0000)        /*!< User data 1 */
#define  FLASH_UOB_OPTION_BYTE_PRT_EN           ((uint32_t)0x04000000)        /*!< Option Byte Protection */

/******************  Bit definition for FLASH_WRPRT register  ******************/
#define  FLASH_WRPRT_WRPRTBMP                   ((uint32_t)0xFFFFFFFF)        /*!< Write Protect */

/******************  Bit definition for FSLIB_CDR0 register  ******************/
#define  FLASH_SLIB_CDR0_BOOT_DIS               ((uint8_t)0x01)               /*!< Boot mode disable in System Memory */
#define  FLASH_SLIB_CDR0_SYS_SLIB_EN            ((uint8_t)0x04)               /*!< SLIB code enable in System Memory */
#define  FLASH_SLIB_CDR0_SLIB_EN                ((uint8_t)0x08)               /*!< SLIB code enable in Flash */

/******************  Bit definition for FSLIB_CDR1 register  ******************/
#define  FLASH_SLIB_START_PAGE                  ((uint32_t)0x000007FF)        /*!< SLIB Start Page */
#define  FLASH_SLIB_DATA_START_PAGE             ((uint32_t)0x003FF800)        /*!< SLIB Data Start Page */
#define  FLASH_SLIB_END_PAGE                    ((uint32_t)0xFFC00000)        /*!< SLIB End Page */
/******************  Bit definition for FSLIB_PSW register  ******************/
#define  FLASH_SLIB_PSW_PSW                     ((uint32_t)0xFFFFFFFF)        /*!< SLIB password */

/******************  Bit definition for FSLIB_PSWSTS register  ******************/
#define  FLASH_SLIB_PSWSTS_PSW_ERR              ((uint8_t)0x01)               /*!< SLIB password mismatch */
#define  FLASH_SLIB_PSWSTS_PSW_OK               ((uint8_t)0x02)               /*!< SLIB password match */
#define  FLASH_SLIB_UNLOCK                      ((uint8_t)0x04)               /*!< SLIB unlock status */
#define  FLASH_SLIB_CNT                         ((uint32_t)0x01FF0000)        /*!< SLIB remaining CFG count */

