RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/*----------------------------------------------------------------------------*/

/******************  Bit definition for FLASH_RDPRT register  *******************/
#define  FLASH_RDPRT_RDPRT                      ((uint32_t)0x000000FF)        /*!< Read protection option byte */
#define  FLASH_RDPRT_nRDPRT                     ((uint32_t)0x0000FF00)        /*!< Read protection complemented option byte */

/******************  Bit definition for FLASH_USR register  ******************/
#define  FLASH_USR_USR                          ((uint32_t)0x00FF0000)        /*!< User option byte */
#define  FLASH_USR_nUSR                         ((uint32_t)0xFF000000)        /*!< User complemented option byte */

/******************  Bit definition for FLASH_DT0 register  *****************/
#define  FLASH_DT0_DT0                          ((uint32_t)0x000000FF)        /*!< User data storage option byte */
#define  FLASH_DT0_nDT0                         ((uint32_t)0x0000FF00)        /*!< User data storage complemented option byte */

/******************  Bit definition for FLASH_DT1 register  *****************/
#define  FLASH_DT1_DT1                          ((uint32_t)0x00FF0000)        /*!< User data storage option byte */
#define  FLASH_DT1_nDT1                         ((uint32_t)0xFF000000)        /*!< User data storage complemented option byte */

/******************  Bit definition for FLASH_WRPRT0 register  ******************/
#define  FLASH_WRPRT0_WRPRT0                    ((uint32_t)0x000000FF)        /*!< Flash memory write protection option bytes */
#define  FLASH_WRPRT0_nWRPRT0                   ((uint32_t)0x0000FF00)        /*!< Flash memory write protection complemented option bytes */

/******************  Bit definition for FLASH_WRPRT1 register  ******************/
#define  FLASH_WRPRT1_WRPRT1                    ((uint32_t)0x00FF0000)        /*!< Flash memory write protection option bytes */
#define  FLASH_WRPRT1_nWRPRT1                   ((uint32_t)0xFF000000)        /*!< Flash memory write protection complemented option bytes */

/******************  Bit definition for FLASH_WRPRT2 register  ******************/
#define  FLASH_WRPRT2_WRPRT2                    ((uint32_t)0x000000FF)        /*!< Flash memory write protection option bytes */
#define  FLASH_WRPRT2_nWRPRT2                   ((uint32_t)0x0000FF00)        /*!< Flash memory write protection complemented option bytes */

/******************  Bit definition for FLASH_WRPRT3 register  ******************/
#define  FLASH_WRPRT3_WRPRT3                    ((uint32_t)0x00FF0000)        /*!< Flash memory write protection option bytes */
#define  FLASH_WRPRT3_nWRPRT3                   ((uint32_t)0xFF000000)        /*!< Flash memory write protection complemented option bytes */

/****************** Bit definition for FSLIB_SET_PSW register ******************/
#define  FLASH_SLIB_SET_PSW                     ((uint32_t)0xFFFFFFFF)        /*!< SLIB Password */

/****************** Bit definition for FSLIB_SET_RANGE register ******************/
#define  FLASH_SLIB_SET_START_PAGE              ((uint32_t)0x000007FF)        /*!< SLIB Start Page */
#define  FLASH_SLIB_SET_DATA_START_PAGE         ((uint32_t)0x003FF800)        /*!< SLIB Data Start Page */
#define  FLASH_SLIB_SET_END_PAGE                ((uint32_t)0xFFC00000)        /*!< SLIB End Page */

/****************** Bit definition for SLIB_KEYR register ******************/
#define  FLASH_SLIB_KEYR                        ((uint32_t)0xFFFFFFFF)        /*!< SLIB Unlock Key Register */

#if defined (AT32F407xx)
/******************************************************************************/
/*                                                                            */
/*               Ethernet MAC Registers bits definitions                      */
/*                                                                            */
/******************************************************************************/
/********** Bit definition for Ethernet MAC Control Register register ***********/
#define ETH_MACCTRL_WDOGD                          ((uint32_t)0x00800000)        /*!< Watchdog disable */
#define ETH_MACCTRL_JAD                            ((uint32_t)0x00400000)        /*!< Jabber disable */

#define ETH_MACCTRL_FG                             ((uint32_t)0x000E0000)        /*!< Inter-frame gap */
#define ETH_MACCTRL_FG_96Bit                       ((uint32_t)0x00000000)        /*!< Minimum IFG between frames during transmission is 96Bit */
#define ETH_MACCTRL_FG_88Bit                       ((uint32_t)0x00020000)        /*!< Minimum IFG between frames during transmission is 88Bit */
#define ETH_MACCTRL_FG_80Bit                       ((uint32_t)0x00040000)        /*!< Minimum IFG between frames during transmission is 80Bit */
#define ETH_MACCTRL_FG_72Bit                       ((uint32_t)0x00060000)        /*!< Minimum IFG between frames during transmission is 72Bit */
#define ETH_MACCTRL_FG_64Bit                       ((uint32_t)0x00080000)        /*!< Minimum IFG between frames during transmission is 64Bit */
#define ETH_MACCTRL_FG_56Bit                       ((uint32_t)0x000A0000)        /*!< Minimum IFG between frames during transmission is 56Bit */
#define ETH_MACCTRL_FG_48Bit                       ((uint32_t)0x000C0000)        /*!< Minimum IFG between frames during transmission is 48Bit */
#define ETH_MACCTRL_FG_40Bit                       ((uint32_t)0x000E0000)        /*!< Minimum IFG between frames during transmission is 40Bit */

#define ETH_MACCTRL_CSD                            ((uint32_t)0x00010000)        /*!< Carrier sense disable (during transmission) */
#define ETH_MACCTRL_FESM                           ((uint32_t)0x00004000)        /*!< Fast ethernet speed */
#define ETH_MACCTRL_ROD                            ((uint32_t)0x00002000)        /*!< Receive own disable */
#define ETH_MACCTRL_LBM                            ((uint32_t)0x00001000)        /*!< loopback mode */
#define ETH_MACCTRL_DM                             ((uint32_t)0x00000800)        /*!< Duplex mode */
#define ETH_MACCTRL_IP4CO                          ((uint32_t)0x00000400)        /*!< IP Checksum offload */
#define ETH_MACCTRL_RD                             ((uint32_t)0x00000200)        /*!< Retry disable */
#define ETH_MACCTRL_AUPCS                          ((uint32_t)0x00000080)        /*!< Automatic Pad/CRC stripping */

#define ETH_MACCTRL_BOL                            ((uint32_t)0x00000060)        /*!< Back-off limit: random integer number (r) of slot time delays before rescheduling
                                                                                   a transmission attempt during retries after a collision: 0 =< r <2^k */
#define ETH_MACCTRL_BOL_10                         ((uint32_t)0x00000000)        /*!< k = min (n, 10) */
#define ETH_MACCTRL_BOL_8                          ((uint32_t)0x00000020)        /*!< k = min (n, 8) */
#define ETH_MACCTRL_BOL_4                          ((uint32_t)0x00000040)        /*!< k = min (n, 4) */
#define ETH_MACCTRL_BOL_1                          ((uint32_t)0x00000060)        /*!< k = min (n, 1) */

#define ETH_MACCTRL_DC                             ((uint32_t)0x00000010)        /*!< Defferal check */
#define ETH_MACCTRL_TE                             ((uint32_t)0x00000008)        /*!< Transmitter enable */
#define ETH_MACCTRL_RE                             ((uint32_t)0x00000004)        /*!< Receiver enable */

/************** Bit definition for Ethernet MAC Frame Filter Register ***************/
#define ETH_MACFRMF_RALL                           ((uint32_t)0x80000000)        /*!< Receive all */
#define ETH_MACFRMF_HOPF                           ((uint32_t)0x00000400)        /*!< Hash or perfect filter */
#define ETH_MACFRMF_SADDRF                         ((uint32_t)0x00000200)        /*!< Source address filter enable */
#define ETH_MACFRMF_SADDRIF                        ((uint32_t)0x00000100)        /*!< SA inverse filtering */

#define ETH_MACFRMF_PCF                            ((uint32_t)0x000000C0)        /*!< Pass control frames: 3 cases */
#define ETH_MACFRMF_PCF_BlockAll                   ((uint32_t)0x00000040)        /*!< MAC filters all control frames from reaching the application */
#define ETH_MACFRMF_PCF_ForwardAll                 ((uint32_t)0x00000080)        /*!< MAC forwards all control frames to application even if they fail the Address Filter */
#define ETH_MACFRMF_ForwardPassedAddrFilter        ((uint32_t)0x000000C0)        /*!< MAC forwards control frames that pass the Address Filter. */

#define ETH_MACFRMF_BFD                            ((uint32_t)0x00000020)        /*!< Broadcast frame disable */
#define ETH_MACFRMF_PALLM                          ((uint32_t)0x00000010)        /*!< Pass all mutlicast */
#define ETH_MACFRMF_DADDRIF                        ((uint32_t)0x00000008)        /*!< DA Inverse filtering */
#define ETH_MACFRMF_HM                             ((uint32_t)0x00000004)        /*!< Hash multicast */
#define ETH_MACFRMF_HU                             ((uint32_t)0x00000002)        /*!< Hash unicast */
#define ETH_MACFRMF_PM                             ((uint32_t)0x00000001)        /*!< Promiscuous mode */

