RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/************ Bit definition for Ethernet MAC Hash Table High Register *************/
#define ETH_MACHTH_HTH                             ((uint32_t)0xFFFFFFFF)        /*!< Hash table high */

/************* Bit definition for Ethernet MAC Hash Table Low Register *************/
#define ETH_MACHTL_HTL                             ((uint32_t)0xFFFFFFFF)        /*!< Hash table low */

/************** Bit definition for Ethernet MAC MII Address Register ***************/
#define ETH_MACMIIADDR_PA                          ((uint32_t)0x0000F800)        /*!< Physical layer address */
#define ETH_MACMIIADDR_MII                         ((uint32_t)0x000007C0)        /*!< MII register in the selected PHY */

#define ETH_MACMIIADDR_CLKR                        ((uint32_t)0x0000001C)        /*!< CR clock range: 6 cases */
#define ETH_MACMIIADDR_CLKR_DIV42                  ((uint32_t)0x00000000)        /*!< HCLK:60-72 MHz; MDC clock= HCLK/42 */
#define ETH_MACMIIADDR_CLKR_DIV62                  ((uint32_t)0x00000004)        /*!< HCLK:100-150 MHz; MDC clock= HCLK/62 */
#define ETH_MACMIIADDR_CLKR_DIV16                  ((uint32_t)0x00000008)        /*!< HCLK:20-35 MHz; MDC clock= HCLK/16 */
#define ETH_MACMIIADDR_CLKR_DIV26                  ((uint32_t)0x0000000C)        /*!< HCLK:35-60 MHz; MDC clock= HCLK/26 */
#define ETH_MACMIIADDR_CLKR_DIV102                 ((uint32_t)0x00000010)        /*!< HCLK:150-250 MHz; MDC clock= HCLK/102 */
#define ETH_MACMIIADDR_CLKR_DIV124                 ((uint32_t)0x00000014)        /*!< HCLK:250-300 MHz; MDC clock= HCLK/124 */

#define ETH_MACMIIADDR_MIIW                        ((uint32_t)0x00000002)        /*!< MII write */
#define ETH_MACMIIADDR_MIIB                        ((uint32_t)0x00000001)        /*!< MII busy */

/**************** Bit definition for Ethernet MAC MII Data Register ****************/
#define ETH_MACMIIDT_MIID                          ((uint32_t)0x0000FFFF)        /*!< MII data: read/write data from/to PHY */

/************** Bit definition for Ethernet MAC Flow Control Register **************/
#define ETH_MACFCTRL_PTM                           ((uint32_t)0xFFFF0000)        /*!< Pause time */
#define ETH_MACFCTRL_ZQPD                          ((uint32_t)0x00000080)        /*!< Zero-quanta pause disable */

#define ETH_MACFCTRL_PLT                           ((uint32_t)0x00000030)        /*!< Pause low threshold: 4 cases */
#define ETH_MACFCTRL_PLT_Minus4                    ((uint32_t)0x00000000)        /*!< Pause time minus 4 slot times */
#define ETH_MACFCTRL_PLT_Minus28                   ((uint32_t)0x00000010)        /*!< Pause time minus 28 slot times */
#define ETH_MACFCTRL_PLT_Minus144                  ((uint32_t)0x00000020)        /*!< Pause time minus 144 slot times */
#define ETH_MACFCTRL_PLT_Minus256                  ((uint32_t)0x00000030)        /*!< Pause time minus 256 slot times */

#define ETH_MACFCTRL_UPFD                          ((uint32_t)0x00000008)        /*!< Unicast pause frame detect */
#define ETH_MACFCTRL_RFCEN                         ((uint32_t)0x00000004)        /*!< Receive flow control enable */
#define ETH_MACFCTRL_TFCEN                         ((uint32_t)0x00000002)        /*!< Transmit flow control enable */
#define ETH_MACFCTRL_FCBBPA                        ((uint32_t)0x00000001)        /*!< Flow control busy/backpressure activate */

/************** Bit definition for Ethernet MAC VLAN Tag Register ****************/
#define ETH_MACVLT_VLTC                            ((uint32_t)0x00010000)        /*!< 12-bit VLAN tag comparison */
#define ETH_MACVLT_VLTI                            ((uint32_t)0x0000FFFF)        /*!< VLAN tag identifier (for receive frames) */

/****** Bit definition for Ethernet MAC Remote Wake-UpFrame Filter Register ******/
#define ETH_MACRWFF_D                              ((uint32_t)0xFFFFFFFF)        /*!< Wake-up frame filter register data */

/*!< Eight sequential Writes to this address (offset 0x28) will write all Wake-UpFrame Filter Registers.
   Eight sequential Reads from this address (offset 0x28) will read all Wake-UpFrame Filter Registers. */
/*!< Wake-UpFrame Filter Reg0 : Filter 0 Byte Mask
   Wake-UpFrame Filter Reg1 : Filter 1 Byte Mask
   Wake-UpFrame Filter Reg2 : Filter 2 Byte Mask
   Wake-UpFrame Filter Reg3 : Filter 3 Byte Mask
   Wake-UpFrame Filter Reg4 : RSVD - Filter3 Command - RSVD - Filter2 Command -
                              RSVD - Filter1 Command - RSVD - Filter0 Command
   Wake-UpFrame Filter Re5 : Filter3 Offset - Filter2 Offset - Filter1 Offset - Filter0 Offset
   Wake-UpFrame Filter Re6 : Filter1 CRC16 - Filter0 CRC16
   Wake-UpFrame Filter Re7 : Filter3 CRC16 - Filter2 CRC16 */

/******** Bit definition for Ethernet MAC PMT Control and Status Register **********/
#define ETH_MACPMTCTRLSTS_WFFPR                    ((uint32_t)0x80000000)        /*!< Wake-Up Frame Filter Register Pointer Reset */
#define ETH_MACPMTCTRLSTS_GLBU                     ((uint32_t)0x00000200)        /*!< Global Unicast */
#define ETH_MACPMTCTRLSTS_WFR                      ((uint32_t)0x00000040)        /*!< Wake-Up Frame Received */
#define ETH_MACPMTCTRLSTS_MPR                      ((uint32_t)0x00000020)        /*!< Magic Packet Received */
#define ETH_MACPMTCTRLSTS_WFEN                     ((uint32_t)0x00000004)        /*!< Wake-Up Frame Enable */
#define ETH_MACPMTCTRLSTS_MPEN                     ((uint32_t)0x00000002)        /*!< Magic Packet Enable */
#define ETH_MACPMTCTRLSTS_PD                       ((uint32_t)0x00000001)        /*!< Power Down */

/**************** Bit definition for Ethernet MAC Status Register ******************/
#define ETH_MACISTS_TSTS                           ((uint32_t)0x00000200)        /*!< Time stamp trigger status */
#define ETH_MACISTS_MMCTS                          ((uint32_t)0x00000040)        /*!< MMC transmit status */
#define ETH_MACISTS_MMCRS                          ((uint32_t)0x00000020)        /*!< MMC receive status */
#define ETH_MACISTS_MMCS                           ((uint32_t)0x00000010)        /*!< MMC status */
#define ETH_MACISTS_PMTS                           ((uint32_t)0x00000008)        /*!< PMT status */

