RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/************ Bit definition for Ethernet MAC Interrupt Mask Register **************/
#define ETH_MACIM_TSTINTM                          ((uint32_t)0x00000200)        /*!< Time stamp trigger interrupt mask */
#define ETH_MACIM_PMTINTM                          ((uint32_t)0x00000008)        /*!< PMT interrupt mask */

/************ Bit definition for Ethernet MAC Address0 High Register ***************/
#define ETH_MACA0H_MACADDR0H                       ((uint32_t)0x0000FFFF)        /*!< MAC address0 high */

/************* Bit definition for Ethernet MAC Address0 Low Register ***************/
#define ETH_MACA0L_MACADDR0L                       ((uint32_t)0xFFFFFFFF)        /*!< MAC address0 low */

/************* Bit definition for Ethernet MAC Address1 High Register **************/
#define ETH_MACA1H_AEN                             ((uint32_t)0x80000000)        /*!< Address enable */
#define ETH_MACA1H_SADDR                           ((uint32_t)0x40000000)        /*!< Source address */

#define ETH_MACA1H_MBCTRL                          ((uint32_t)0x3F000000)        /*!< Mask byte control: bits to mask for comparison of the MAC Address bytes */
#define ETH_MACA1H_MBCTRL_HBits15_8                ((uint32_t)0x20000000)        /*!< Mask MAC Address high reg bits [15:8] */
#define ETH_MACA1H_MBCTRL_HBits7_0                 ((uint32_t)0x10000000)        /*!< Mask MAC Address high reg bits [7:0] */
#define ETH_MACA1H_MBCTRL_LBits31_24               ((uint32_t)0x08000000)        /*!< Mask MAC Address low reg bits [31:24] */
#define ETH_MACA1H_MBCTRL_LBits23_16               ((uint32_t)0x04000000)        /*!< Mask MAC Address low reg bits [23:16] */
#define ETH_MACA1H_MBCTRL_LBits15_8                ((uint32_t)0x02000000)        /*!< Mask MAC Address low reg bits [15:8] */
#define ETH_MACA1H_MBCTRL_LBits7_0                 ((uint32_t)0x01000000)        /*!< Mask MAC Address low reg bits [7:0] */

#define ETH_MACA1H_MACADDR1H                       ((uint32_t)0x0000FFFF)        /*!< MAC address1 high */
/************** Bit definition for Ethernet MAC Address1 Low Register **************/

#define ETH_MACA1L_MACADDR1L                       ((uint32_t)0xFFFFFFFF)        /*!< MAC address1 low */

/************** Bit definition for Ethernet MAC Address2 High Register *************/
#define ETH_MACA2H_AEN                             ((uint32_t)0x80000000)        /*!< Address enable */
#define ETH_MACA2H_SADDR                           ((uint32_t)0x40000000)        /*!< Source address */

#define ETH_MACA2H_MBCTRL                          ((uint32_t)0x3F000000)        /*!< Mask byte control */
#define ETH_MACA2H_MBCTRL_HBits15_8                ((uint32_t)0x20000000)        /*!< Mask MAC Address high reg bits [15:8] */
#define ETH_MACA2H_MBCTRL_HBits7_0                 ((uint32_t)0x10000000)        /*!< Mask MAC Address high reg bits [7:0] */
#define ETH_MACA2H_MBCTRL_LBits31_24               ((uint32_t)0x08000000)        /*!< Mask MAC Address low reg bits [31:24] */
#define ETH_MACA2H_MBCTRL_LBits23_16               ((uint32_t)0x04000000)        /*!< Mask MAC Address low reg bits [23:16] */
#define ETH_MACA2H_MBCTRL_LBits15_8                ((uint32_t)0x02000000)        /*!< Mask MAC Address low reg bits [15:8] */
#define ETH_MACA2H_MBCTRL_LBits7_0                 ((uint32_t)0x01000000)        /*!< Mask MAC Address low reg bits [70] */

#define ETH_MACA2H_MACADDR2H                       ((uint32_t)0x0000FFFF)        /*!< MAC address1 high */

/************** Bit definition for Ethernet MAC Address2 Low Register **************/
#define ETH_MACA2L_MACADDR2L                       ((uint32_t)0xFFFFFFFF)        /*!< MAC address2 low */

/************** Bit definition for Ethernet MAC Address3 High Register *************/
#define ETH_MACA3H_AEN                             ((uint32_t)0x80000000)        /*!< Address enable */
#define ETH_MACA3H_SADDR                           ((uint32_t)0x40000000)        /*!< Source address */

#define ETH_MACA3H_MBCTRL                          ((uint32_t)0x3F000000)        /*!< Mask byte control */
#define ETH_MACA3H_MBCTRL_HBits15_8                ((uint32_t)0x20000000)        /*!< Mask MAC Address high reg bits [15:8] */
#define ETH_MACA3H_MBCTRL_HBits7_0                 ((uint32_t)0x10000000)        /*!< Mask MAC Address high reg bits [7:0] */
#define ETH_MACA3H_MBCTRL_LBits31_24               ((uint32_t)0x08000000)        /*!< Mask MAC Address low reg bits [31:24] */
#define ETH_MACA3H_MBCTRL_LBits23_16               ((uint32_t)0x04000000)        /*!< Mask MAC Address low reg bits [23:16] */
#define ETH_MACA3H_MBCTRL_LBits15_8                ((uint32_t)0x02000000)        /*!< Mask MAC Address low reg bits [15:8] */
#define ETH_MACA3H_MBCTRL_LBits7_0                 ((uint32_t)0x01000000)        /*!< Mask MAC Address low reg bits [70] */

#define ETH_MACA3H_MACADDR3H                       ((uint32_t)0x0000FFFF)        /*!< MAC address3 high */

/************** Bit definition for Ethernet MAC Address3 Low Register **************/
#define ETH_MACA3L_MACADDR3L                       ((uint32_t)0xFFFFFFFF)        /*!< MAC address3 low */

/******************************************************************************/
/*                                                                            */
/*               Ethernet MMC Registers bits definition                       */
/*                                                                            */
/******************************************************************************/

/***************** Bit definition for Ethernet MMC Contol Register *****************/
#define ETH_MMCCTRL_MCNTF                         ((uint32_t)0x00000008)        /*!< MMC Counter Freeze */
#define ETH_MMCCTRL_RSTOR                         ((uint32_t)0x00000004)        /*!< Reset on Read */
#define ETH_MMCCTRL_CSR                           ((uint32_t)0x00000002)        /*!< Counter Stop Rollover */
#define ETH_MMCCTRL_CNTR                          ((uint32_t)0x00000001)        /*!< Counters Reset */

/*********** Bit definition for Ethernet MMC Receive Interrupt Register ************/
#define ETH_MMCRI_RGUF                            ((uint32_t)0x00020000)        /*!< Set when Rx good unicast frames counter reaches half the maximum value */
#define ETH_MMCRI_RFAE                            ((uint32_t)0x00000040)        /*!< Set when Rx alignment error counter reaches half the maximum value */
#define ETH_MMCRI_RFCE                            ((uint32_t)0x00000020)        /*!< Set when Rx crc error counter reaches half the maximum value */

/*********** Bit definition for Ethernet MMC Transmit Interrupt Register ***********/
#define ETH_MMCTI_TGF                             ((uint32_t)0x00200000)        /*!< Set when Tx good frame count counter reaches half the maximum value */
#define ETH_MMCTI_TGFMSC                          ((uint32_t)0x00008000)        /*!< Set when Tx good multi col counter reaches half the maximum value */
#define ETH_MMCTI_TGFSC                           ((uint32_t)0x00004000)        /*!< Set when Tx good single col counter reaches half the maximum value */

/********* Bit definition for Ethernet MMC Receive Interrupt Mask Register *********/
#define ETH_MMCRIM_RGUFM                          ((uint32_t)0x00020000)        /*!< Mask the interrupt when Rx good unicast frames counter reaches half the maximum value */
#define ETH_MMCRIM_RFAEM                          ((uint32_t)0x00000040)        /*!< Mask the interrupt when when Rx alignment error counter reaches half the maximum value */
#define ETH_MMCRIM_RFCEM                          ((uint32_t)0x00000020)        /*!< Mask the interrupt when Rx crc error counter reaches half the maximum value */

/********* Bit definition for Ethernet MMC Transmit Interrupt Mask Register ********/
#define ETH_MMCTIM_TGFM                           ((uint32_t)0x00200000)        /*!< Mask the interrupt when Tx good frame count counter reaches half the maximum value */
#define ETH_MMCTIM_TGFMSCM                        ((uint32_t)0x00008000)        /*!< Mask the interrupt when Tx good multi col counter reaches half the maximum value */
#define ETH_MMCTIM_TGFSCM                         ((uint32_t)0x00004000)        /*!< Mask the interrupt when Tx good single col counter reaches half the maximum value */

