RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/** Bit definition for Ethernet MMC Transmitted Good Frames after Single Collision Counter Register */
#define ETH_MMCTFSCC_TGFSCC                       ((uint32_t)0xFFFFFFFF)        /*!< Number of successfully transmitted frames after a single collision in Half-duplex mode. */

/** Bit definition for Ethernet MMC Transmitted Good Frames after More than a Single Collision Counter Register */
#define ETH_MMCTFMSCC_TGFMSCC                     ((uint32_t)0xFFFFFFFF)        /*!< Number of successfully transmitted frames after more than a single collision in Half-duplex mode. */

/***** Bit definition for Ethernet MMC Transmitted Good Frames Counter Register ****/
#define ETH_MMCTFCNT_TGFC                         ((uint32_t)0xFFFFFFFF)        /*!< Number of good frames transmitted. */
/** Bit definition for Ethernet MMC Received Frames with CRC Error Counter Register */
#define ETH_MMCRFCECNT_RFCEC                      ((uint32_t)0xFFFFFFFF)        /*!< Number of frames received with CRC error. */

/** Bit definition for Ethernet MMC Received Frames with Alignement Error Counter Register */
#define ETH_MMCRFAECNT_RFAEC                      ((uint32_t)0xFFFFFFFF)        /*!< Number of frames received with alignment (dribble) error */

/** Bit definition for Ethernet MMC Received Good Unicast Frames Counter Register */
#define ETH_MMCRGUFCNT_RGUFC                      ((uint32_t)0xFFFFFFFF)        /*!< Number of good unicast frames received. */

/******************************************************************************/
/*                                                                            */
/*               Ethernet PTP Registers bits definition                       */
/*                                                                            */
/******************************************************************************/

/************ Bit definition for Ethernet PTP Time Stamp Contol Register ***********/
#define ETH_PTPTSCTRL_TSARU                       ((uint32_t)0x00000020)        /*!< Addend register update */
#define ETH_PTPTSCTRL_TSITE                       ((uint32_t)0x00000010)        /*!< Time stamp interrupt trigger enable */
#define ETH_PTPTSCTRL_TSSTU                       ((uint32_t)0x00000008)        /*!< Time stamp update */
#define ETH_PTPTSCTRL_TSSTI                       ((uint32_t)0x00000004)        /*!< Time stamp initialize */
#define ETH_PTPTSCTRL_TSFCU                       ((uint32_t)0x00000002)        /*!< Time stamp fine or coarse update */
#define ETH_PTPTSCTRL_TSE                         ((uint32_t)0x00000001)        /*!< Time stamp enable */

/********** Bit definition for Ethernet PTP Sub-Second Increment Register **********/
#define ETH_PTPSSINC_STSINC                       ((uint32_t)0x000000FF)        /*!< System time Sub-second increment value */

/************ Bit definition for Ethernet PTP Time Stamp High Register *************/
#define ETH_PTPTSH_STS                            ((uint32_t)0xFFFFFFFF)        /*!< System Time second */

/************ Bit definition for Ethernet PTP Time Stamp Low Register **************/
#define ETH_PTPTSL_STPNS                          ((uint32_t)0x80000000)        /*!< System Time Positive or negative time */
#define ETH_PTPTSL_STSS                           ((uint32_t)0x7FFFFFFF)        /*!< System Time sub-seconds */

/********* Bit definition for Ethernet PTP Time Stamp High Update Register *********/
#define ETH_PTPTSHUD_TSUS                         ((uint32_t)0xFFFFFFFF)        /*!< Time stamp update seconds */

/********* Bit definition for Ethernet PTP Time Stamp Low Update Register **********/
#define ETH_PTPTSLUD_TSUPNS                       ((uint32_t)0x80000000)        /*!< Time stamp update Positive or negative time */
#define ETH_PTPTSLUD_TSUSS                        ((uint32_t)0x7FFFFFFF)        /*!< Time stamp update sub-seconds */

/*********** Bit definition for Ethernet PTP Time Stamp Addend Register ************/
#define ETH_PTPTSAD_TSA                           ((uint32_t)0xFFFFFFFF)        /*!< Time stamp addend */

/*********** Bit definition for Ethernet PTP Target Time High Register *************/
#define ETH_PTPTTH_TTSH                           ((uint32_t)0xFFFFFFFF)        /*!< Target time stamp high */

/************ Bit definition for Ethernet PTP Target Time Low Register *************/
#define ETH_PTPTTL_TTSL                           ((uint32_t)0xFFFFFFFF)        /*!< Target time stamp low */

/******************************************************************************/
/*                                                                            */
/*               Ethernet DMA Registers bits definition                       */
/*                                                                            */
/******************************************************************************/

/**************** Bit definition for Ethernet DMA Bus Mode Register ****************/
#define ETH_DMABM_AAB                          ((uint32_t)0x02000000)        /*!< Address-Aligned beats */
#define ETH_DMABM_FPBLM                        ((uint32_t)0x01000000)        /*!< 4xPBL mode */
#define ETH_DMABM_USP                          ((uint32_t)0x00800000)        /*!< Use separate PBL */

#define ETH_DMABM_RDPBL                        ((uint32_t)0x007E0000)        /*!< RxDMA PBL */
#define ETH_DMABM_RDPBL_1Beat                  ((uint32_t)0x00020000)        /*!< maximum number of beats to be transferred in one RxDMA transaction is 1 */
#define ETH_DMABM_RDPBL_2Beat                  ((uint32_t)0x00040000)        /*!< maximum number of beats to be transferred in one RxDMA transaction is 2 */
#define ETH_DMABM_RDPBL_4Beat                  ((uint32_t)0x00080000)        /*!< maximum number of beats to be transferred in one RxDMA transaction is 4 */
#define ETH_DMABM_RDPBL_8Beat                  ((uint32_t)0x00100000)        /*!< maximum number of beats to be transferred in one RxDMA transaction is 8 */
#define ETH_DMABM_RDPBL_16Beat                 ((uint32_t)0x00200000)        /*!< maximum number of beats to be transferred in one RxDMA transaction is 16 */
#define ETH_DMABM_RDPBL_32Beat                 ((uint32_t)0x00400000)        /*!< maximum number of beats to be transferred in one RxDMA transaction is 32 */
#define ETH_DMABM_RDPBL_4xPBL_4Beat            ((uint32_t)0x01020000)        /*!< maximum number of beats to be transferred in one RxDMA transaction is 4 */
#define ETH_DMABM_RDPBL_4xPBL_8Beat            ((uint32_t)0x01040000)        /*!< maximum number of beats to be transferred in one RxDMA transaction is 8 */
#define ETH_DMABM_RDPBL_4xPBL_16Beat           ((uint32_t)0x01080000)        /*!< maximum number of beats to be transferred in one RxDMA transaction is 16 */
#define ETH_DMABM_RDPBL_4xPBL_32Beat           ((uint32_t)0x01100000)        /*!< maximum number of beats to be transferred in one RxDMA transaction is 32 */
#define ETH_DMABM_RDPBL_4xPBL_64Beat           ((uint32_t)0x01200000)        /*!< maximum number of beats to be transferred in one RxDMA transaction is 64 */
#define ETH_DMABM_RDPBL_4xPBL_128Beat          ((uint32_t)0x01400000)        /*!< maximum number of beats to be transferred in one RxDMA transaction is 128 */

#define ETH_DMABM_FB                           ((uint32_t)0x00010000)        /*!< Fixed Burst */

#define ETH_DMABM_RTPR                         ((uint32_t)0x0000C000)        /*!< Rx Tx priority ratio */
#define ETH_DMABM_RTPR_1_1                     ((uint32_t)0x00000000)        /*!< Rx Tx priority ratio */
#define ETH_DMABM_RTPR_2_1                     ((uint32_t)0x00004000)        /*!< Rx Tx priority ratio */
#define ETH_DMABM_RTPR_3_1                     ((uint32_t)0x00008000)        /*!< Rx Tx priority ratio */
#define ETH_DMABM_RTPR_4_1                     ((uint32_t)0x0000C000)        /*!< Rx Tx priority ratio */

#define ETH_DMABM_PBL                          ((uint32_t)0x00003F00)        /*!< Programmable burst length */
#define ETH_DMABM_PBL_1Beat                    ((uint32_t)0x00000100)        /*!< maximum number of beats to be transferred in one TxDMA (or both) transaction is 1 */
#define ETH_DMABM_PBL_2Beat                    ((uint32_t)0x00000200)        /*!< maximum number of beats to be transferred in one TxDMA (or both) transaction is 2 */
#define ETH_DMABM_PBL_4Beat                    ((uint32_t)0x00000400)        /*!< maximum number of beats to be transferred in one TxDMA (or both) transaction is 4 */
#define ETH_DMABM_PBL_8Beat                    ((uint32_t)0x00000800)        /*!< maximum number of beats to be transferred in one TxDMA (or both) transaction is 8 */
#define ETH_DMABM_PBL_16Beat                   ((uint32_t)0x00001000)        /*!< maximum number of beats to be transferred in one TxDMA (or both) transaction is 16 */
#define ETH_DMABM_PBL_32Beat                   ((uint32_t)0x00002000)        /*!< maximum number of beats to be transferred in one TxDMA (or both) transaction is 32 */
#define ETH_DMABM_PBL_4xPBL_4Beat              ((uint32_t)0x01000100)        /*!< maximum number of beats to be transferred in one TxDMA (or both) transaction is 4 */
#define ETH_DMABM_PBL_4xPBL_8Beat              ((uint32_t)0x01000200)        /*!< maximum number of beats to be transferred in one TxDMA (or both) transaction is 8 */
#define ETH_DMABM_PBL_4xPBL_16Beat             ((uint32_t)0x01000400)        /*!< maximum number of beats to be transferred in one TxDMA (or both) transaction is 16 */
#define ETH_DMABM_PBL_4xPBL_32Beat             ((uint32_t)0x01000800)        /*!< maximum number of beats to be transferred in one TxDMA (or both) transaction is 32 */
#define ETH_DMABM_PBL_4xPBL_64Beat             ((uint32_t)0x01001000)        /*!< maximum number of beats to be transferred in one TxDMA (or both) transaction is 64 */
#define ETH_DMABM_PBL_4xPBL_128Beat            ((uint32_t)0x01002000)        /*!< maximum number of beats to be transferred in one TxDMA (or both) transaction is 128 */

#define ETH_DMABM_DSL                          ((uint32_t)0x0000007C)        /*!< Descriptor Skip Length */
#define ETH_DMABM_DA                           ((uint32_t)0x00000002)        /*!< DMA arbitration scheme */
#define ETH_DMABM_SWRST                        ((uint32_t)0x00000001)        /*!< Software reset */

/********** Bit definition for Ethernet DMA Transmit Poll Demand Register **********/
#define ETH_DMATPD_TPD                         ((uint32_t)0xFFFFFFFF)        /*!< Transmit poll demand */

/********** Bit definition for Ethernet DMA Receive Poll Demand Register ***********/
#define ETH_DMARPD_RPD                         ((uint32_t)0xFFFFFFFF)        /*!< Receive poll demand  */

/**** Bit definition for Ethernet DMA Receive Descriptor List Address Register *****/
#define ETH_DMARDLADDR_SRL                     ((uint32_t)0xFFFFFFFF)        /*!< Start of receive list */

