RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
/**** Bit definition for Ethernet DMA Transmit Descriptor List Address Register ****/
#define ETH_DMATDLADDR_STL                     ((uint32_t)0xFFFFFFFF)        /*!< Start of transmit list */

/***************** Bit definition for Ethernet DMA Status Register *****************/
#define ETH_DMASTS_TST                          ((uint32_t)0x20000000)        /*!< Time-stamp trigger status */
#define ETH_DMASTS_PMT                          ((uint32_t)0x10000000)        /*!< PMT status */
#define ETH_DMASTS_MMC                          ((uint32_t)0x08000000)        /*!< MMC status */

#define ETH_DMASTS_EB                           ((uint32_t)0x03800000)        /*!< Error bits status */
#define ETH_DMASTS_EB_DescAccess                ((uint32_t)0x02000000)        /*!< Error bits 0-data buffer, 1-desc. access */
#define ETH_DMASTS_EB_ReadTransf                ((uint32_t)0x01000000)        /*!< Error bits 0-write trnsf, 1-read transfr */
#define ETH_DMASTS_EB_DataTransfTx              ((uint32_t)0x00800000)        /*!< Error bits 0-Rx DMA, 1-Tx DMA */

#define ETH_DMASTS_TP                           ((uint32_t)0x00700000)        /*!< Transmit process state */
#define ETH_DMASTS_TP_Stopped                   ((uint32_t)0x00000000)        /*!< Stopped - Reset or Stop Tx Command issued  */
#define ETH_DMASTS_TP_Fetching                  ((uint32_t)0x00100000)        /*!< Running - fetching the Tx descriptor */
#define ETH_DMASTS_TP_Waiting                   ((uint32_t)0x00200000)        /*!< Running - waiting for status */
#define ETH_DMASTS_TP_Reading                   ((uint32_t)0x00300000)        /*!< Running - reading the data from host memory */
#define ETH_DMASTS_TP_Suspended                 ((uint32_t)0x00600000)        /*!< Suspended - Tx Descriptor unavailabe */
#define ETH_DMASTS_TP_Closing                   ((uint32_t)0x00700000)        /*!< Running - closing Rx descriptor */

#define ETH_DMASTS_RP                           ((uint32_t)0x000E0000)        /*!< Receive process state */
#define ETH_DMASTS_RP_Stopped                   ((uint32_t)0x00000000)        /*!< Stopped - Reset or Stop Rx Command issued */
#define ETH_DMASTS_RP_Fetching                  ((uint32_t)0x00020000)        /*!< Running - fetching the Rx descriptor */
#define ETH_DMASTS_RP_Waiting                   ((uint32_t)0x00060000)        /*!< Running - waiting for packet */
#define ETH_DMASTS_RP_Suspended                 ((uint32_t)0x00080000)        /*!< Suspended - Rx Descriptor unavailable */
#define ETH_DMASTS_RP_Closing                   ((uint32_t)0x000A0000)        /*!< Running - closing descriptor */
#define ETH_DMASTS_RP_Queuing                   ((uint32_t)0x000E0000)        /*!< Running - queuing the recieve frame into host memory */

#define ETH_DMASTS_NIS                          ((uint32_t)0x00010000)        /*!< Normal interrupt summary */
#define ETH_DMASTS_AIS                          ((uint32_t)0x00008000)        /*!< Abnormal interrupt summary */
#define ETH_DMASTS_ER                           ((uint32_t)0x00004000)        /*!< Early receive status */
#define ETH_DMASTS_FBE                          ((uint32_t)0x00002000)        /*!< Fatal bus error status */
#define ETH_DMASTS_ET                           ((uint32_t)0x00000400)        /*!< Early transmit status */
#define ETH_DMASTS_RWT                          ((uint32_t)0x00000200)        /*!< Receive watchdog timeout status */
#define ETH_DMASTS_RPS                          ((uint32_t)0x00000100)        /*!< Receive process stopped status */
#define ETH_DMASTS_RBU                          ((uint32_t)0x00000080)        /*!< Receive buffer unavailable status */
#define ETH_DMASTS_RECV                         ((uint32_t)0x00000040)        /*!< Receive status */
#define ETH_DMASTS_TU                           ((uint32_t)0x00000020)        /*!< Transmit underflow status */
#define ETH_DMASTS_RO                           ((uint32_t)0x00000010)        /*!< Receive overflow status */
#define ETH_DMASTS_TJT                          ((uint32_t)0x00000008)        /*!< Transmit jabber timeout status */
#define ETH_DMASTS_TBU                          ((uint32_t)0x00000004)        /*!< Transmit buffer unavailable status */
#define ETH_DMASTS_TPS                          ((uint32_t)0x00000002)        /*!< Transmit process stopped status */
#define ETH_DMASTS_TX                           ((uint32_t)0x00000001)        /*!< Transmit status */

/************* Bit definition for Ethernet DMA Operation Mode Register *************/
#define ETH_DMAOPM_DTCEFD                       ((uint32_t)0x04000000)        /*!< Disable Dropping of TCP/IP checksum error frames */
#define ETH_DMAOPM_RSFD                         ((uint32_t)0x02000000)        /*!< Receive store and forward */
#define ETH_DMAOPM_DFRFD                        ((uint32_t)0x01000000)        /*!< Disable flushing of received frames */
#define ETH_DMAOPM_TXSF                         ((uint32_t)0x00200000)        /*!< Transmit store and forward */
#define ETH_DMAOPM_FTXF                         ((uint32_t)0x00100000)        /*!< Flush transmit FIFO */

#define ETH_DMAOPM_TXTC                         ((uint32_t)0x0001C000)        /*!< Transmit threshold control */
#define ETH_DMAOPM_TXTC_64Bytes                 ((uint32_t)0x00000000)        /*!< threshold level of the MTL Transmit FIFO is 64 Bytes */
#define ETH_DMAOPM_TXTC_128Bytes                ((uint32_t)0x00004000)        /*!< threshold level of the MTL Transmit FIFO is 128 Bytes */
#define ETH_DMAOPM_TXTC_192Bytes                ((uint32_t)0x00008000)        /*!< threshold level of the MTL Transmit FIFO is 192 Bytes */
#define ETH_DMAOPM_TXTC_256Bytes                ((uint32_t)0x0000C000)        /*!< threshold level of the MTL Transmit FIFO is 256 Bytes */
#define ETH_DMAOPM_TXTC_40Bytes                 ((uint32_t)0x00010000)        /*!< threshold level of the MTL Transmit FIFO is 40 Bytes */
#define ETH_DMAOPM_TXTC_32Bytes                 ((uint32_t)0x00014000)        /*!< threshold level of the MTL Transmit FIFO is 32 Bytes */
#define ETH_DMAOPM_TXTC_24Bytes                 ((uint32_t)0x00018000)        /*!< threshold level of the MTL Transmit FIFO is 24 Bytes */
#define ETH_DMAOPM_TXTC_16Bytes                 ((uint32_t)0x0001C000)        /*!< threshold level of the MTL Transmit FIFO is 16 Bytes */

#define ETH_DMAOPM_STXE                         ((uint32_t)0x00002000)        /*!< Start/stop transmission command */
#define ETH_DMAOPM_FEF                          ((uint32_t)0x00000080)        /*!< Forward error frames */
#define ETH_DMAOPM_FUGF                         ((uint32_t)0x00000040)        /*!< Forward undersized good frames */

