RT-Thread/rt-thread/bsp/at32/Libraries/AT32_Std_Driver/CMSIS/AT32/AT32F4xx/inc/at32f4xx.h
#define ETH_DMAOPM_RXTC                         ((uint32_t)0x00000018)        /*!< receive threshold control */
#define ETH_DMAOPM_RXTC_64Bytes                 ((uint32_t)0x00000000)        /*!< threshold level of the MTL Receive FIFO is 64 Bytes */
#define ETH_DMAOPM_RXTC_32Bytes                 ((uint32_t)0x00000008)        /*!< threshold level of the MTL Receive FIFO is 32 Bytes */
#define ETH_DMAOPM_RXTC_96Bytes                 ((uint32_t)0x00000010)        /*!< threshold level of the MTL Receive FIFO is 96 Bytes */
#define ETH_DMAOPM_RXTC_128Bytes                ((uint32_t)0x00000018)        /*!< threshold level of the MTL Receive FIFO is 128 Bytes */

#define ETH_DMAOPM_OPSF                         ((uint32_t)0x00000004)        /*!< operate on second frame */
#define ETH_DMAOPM_SRXE                         ((uint32_t)0x00000002)        /*!< Start/stop receive */

/************ Bit definition for Ethernet DMA Interrupt Enable Register ************/
#define ETH_DMAIE_NISE                          ((uint32_t)0x00010000)        /*!< Normal interrupt summary enable */
#define ETH_DMAIE_AISE                          ((uint32_t)0x00008000)        /*!< Abnormal interrupt summary enable */
#define ETH_DMAIE_ERIE                          ((uint32_t)0x00004000)        /*!< Early receive interrupt enable */
#define ETH_DMAIE_FBEIE                         ((uint32_t)0x00002000)        /*!< Fatal bus error interrupt enable */
#define ETH_DMAIE_ETIE                          ((uint32_t)0x00000400)        /*!< Early transmit interrupt enable */
#define ETH_DMAIE_RXWTIE                        ((uint32_t)0x00000200)        /*!< Receive watchdog timeout interrupt enable */
#define ETH_DMAIE_RXPSIE                        ((uint32_t)0x00000100)        /*!< Receive process stopped interrupt enable */
#define ETH_DMAIE_RXBUIE                        ((uint32_t)0x00000080)        /*!< Receive buffer unavailable interrupt enable */
#define ETH_DMAIE_RXIE                          ((uint32_t)0x00000040)        /*!< Receive interrupt enable */
#define ETH_DMAIE_TUIE                          ((uint32_t)0x00000020)        /*!< Transmit Underflow interrupt enable */
#define ETH_DMAIE_ROIE                          ((uint32_t)0x00000010)        /*!< Receive Overflow interrupt enable */
#define ETH_DMAIE_TXJTIE                        ((uint32_t)0x00000008)        /*!< Transmit jabber timeout interrupt enable */
#define ETH_DMAIE_TXBUIE                        ((uint32_t)0x00000004)        /*!< Transmit buffer unavailable interrupt enable */
#define ETH_DMAIE_TXPSIE                        ((uint32_t)0x00000002)        /*!< Transmit process stopped interrupt enable */
#define ETH_DMAIE_TXIE                          ((uint32_t)0x00000001)        /*!< Transmit interrupt enable */

/** Bit definition for Ethernet DMA Missed Frame and Buffer Overflow Counter Register */
#define ETH_DMAMFBOCNT_OFOC                     ((uint32_t)0x10000000)        /*!< Overflow bit for FIFO overflow counter */
#define ETH_DMAMFBOCNT_MFA                      ((uint32_t)0x0FFE0000)        /*!< Number of frames missed by the application */
#define ETH_DMAMFBOCNT_OMFC                     ((uint32_t)0x00010000)        /*!< Overflow bit for missed frame counter */
#define ETH_DMAMFBOCNT_MFC                      ((uint32_t)0x0000FFFF)        /*!< Number of frames missed by the controller */

/** Bit definition for Ethernet DMA Current Host Transmit Descriptor Register */
#define ETH_DMACTD_HTDAP                        ((uint32_t)0xFFFFFFFF)        /*!< Host transmit descriptor address pointer */

/** Bit definition for Ethernet DMA Current Host Receive Descriptor Register */
#define ETH_DMACRD_HRDAP                        ((uint32_t)0xFFFFFFFF)        /*!< Host receive descriptor address pointer */

/** Bit definition for Ethernet DMA Current Host Transmit Buffer Address Register */
#define ETH_DMACTBADDR_HTBAP                    ((uint32_t)0xFFFFFFFF)        /*!< Host transmit buffer address pointer */

/** Bit definition for Ethernet DMA Current Host Receive Buffer Address Register */
#define ETH_DMACRBADDR_HRBAP                    ((uint32_t)0xFFFFFFFF)        /*!< Host receive buffer address pointer */
#endif /* AT32F407xx */

/**
  * @}
  */

/**
 * @}
 */

#if defined (LIBRARY_VERSION) || defined (USE_STDPERIPH_DRIVER)
#include "at32f4xx_conf.h"
#endif

/** @addtogroup Exported_macro
  * @{
  */

#define BIT_SET(REG, BIT)                       ((REG) |= (BIT))

#define BIT_CLEAR(REG, BIT)                     ((REG) &= ~(BIT))

#define BIT_READ(REG, BIT)                      ((REG) & (BIT))

#define REG_CLEAR(REG)                          ((REG) = (0x0))

#define REG_WRITE(REG, VAL)                     ((REG) = (VAL))

#define REG_READ(REG)                           ((REG))

#define REG_CHANGE(REG, CLEARMASK, SETMASK)     REG_WRITE((REG), (((REG_READ(REG)) & (~(CLEARMASK))) | (SETMASK)))

/**
  * @}
  */

#ifdef __cplusplus
}
#endif

#endif /* __AT32F4xx_H */

/**
  * @}
  */

/**
* @}
*/
